{
  "_meta": {
    "sources": [
      {
        "convertedBy": [
          "Erikku Blade"
        ],
        "authors": [
          "Erikku Blade"
        ],
        "dependencies": {
          "class": [
            "PHB"
          ],
          "classFeature": [
            "PHB",
            "TCE"
          ]
        },
        "url": "",
        "full": "The Adventures of Torrin Campaign Setting",
        "abbreviation": "AOTC",
        "json": "TACS",
        "color": "f1c232"
      }
    ],
    "dateAdded": 1638480074,
    "dateLastModified": 1638480074,
    "internalCopies": [
      "item",
      "background"
    ]
  },
  "class": [
    {
      "name": "Druid",
      "source": "TACS",
      "page": null,
      "srd": false,
      "hd": {
        "number": 1,
        "faces": 8
      },
      "proficiency": [
        "int",
        "wis"
      ],
      "spellcastingAbility": "wis",
      "casterProgression": "full",
      "preparedSpells": "<$level$> + <$wis_mod$>",
      "cantripProgression": [
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          {
            "proficiency": "{@item shield|phb|shields}",
            "full": "shields (druids will not wear armor or use shields made of metal)"
          }
        ],
        "weapons": [
          "{@item club|phb|clubs}",
          "{@item dagger|phb|daggers}",
          "{@item dart|phb|darts}",
          "{@item javelin|phb|javelins}",
          "{@item mace|phb|maces}",
          "{@item quarterstaff|phb|quarterstaffs}",
          "{@item scimitar|phb|scimitars}",
          "{@item sickle|phb|sickles}",
          "{@item sling|phb|slings}",
          "{@item spear|phb|spears}"
        ],
        "tools": [
          "{@item Herbalism kit|PHB}"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "arcana",
                "animal handling",
                "insight",
                "medicine",
                "nature",
                "perception",
                "religion",
                "survival"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a wooden {@item shield|phb} or (b) any {@filter simple weapon|items|source=phb|category=basic|type=simple weapon}",
          "(a) a {@item scimitar|phb} or (b) any {@filter simple melee weapon|items|source=phb|category=basic|type=simple weapon;melee weapon=sand}",
          "{@item Leather armor|phb}, an {@item explorer's pack|phb}, and a {@item druidic focus|phb}"
        ],
        "goldAlternative": "{@dice 2d4 × 10|2d4 × 10|Starting Gold}",
        "defaultData": [
          {
            "a": [
              "shield|phb"
            ],
            "b": [
              {
                "equipmentType": "weaponSimple"
              }
            ]
          },
          {
            "a": [
              "scimitar|phb"
            ],
            "b": [
              {
                "equipmentType": "weaponSimpleMelee"
              }
            ]
          },
          {
            "_": [
              "Leather armor|phb",
              "explorer's pack|phb",
              "druidic focus|phb"
            ]
          }
        ]
      },
      "multiclassing": {
        "requirements": {
          "wis": 13
        },
        "proficienciesGained": {
          "armor": [
            "light",
            "medium",
            {
              "proficiency": "{@item shield|phb|shields}",
              "full": "shields (druids will not wear armor or use shields made of metal)"
            }
          ]
        }
      },
      "classTableGroups": [
        {
          "colLabels": [
            "{@filter Cantrips Known|spells|level=0|class=Druid}"
          ],
          "rows": [
            [
              2
            ],
            [
              2
            ],
            [
              2
            ],
            [
              3
            ],
            [
              3
            ],
            [
              3
            ],
            [
              3
            ],
            [
              3
            ],
            [
              3
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ],
            [
              4
            ]
          ]
        },
        {
          "title": "Spell Slots per Spell Level",
          "colLabels": [
            "{@filter 1st|spells|level=1|class=Druid}",
            "{@filter 2nd|spells|level=2|class=Druid}",
            "{@filter 3rd|spells|level=3|class=Druid}",
            "{@filter 4th|spells|level=4|class=Druid}",
            "{@filter 5th|spells|level=5|class=Druid}",
            "{@filter 6th|spells|level=6|class=Druid}",
            "{@filter 7th|spells|level=7|class=Druid}",
            "{@filter 8th|spells|level=8|class=Druid}",
            "{@filter 9th|spells|level=9|class=Druid}"
          ],
          "rowsSpellProgression": [
            [
              2,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              1,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              2,
              0,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              1,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              0,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              0,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              0,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              0
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              1,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              2,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              2,
              2,
              1,
              1
            ]
          ]
        }
      ],
      "classFeatures": [
        "Bond of The Wilderness|Druid|TACS|1",
        "Druidic|Druid|TACS|1",
        "Spellcasting|Druid|TACS|1",
        "Wild Shape|Druid|TACS|2",
        "Wild Companion|Druid|TACS|2|TCE",
        {
          "classFeature": "Druid Circle|Druid|TACS|2",
          "gainSubclassFeature": true
        },
        "Wild Shape Improvement|Druid|TACS|4",
        "Ability Score Improvement|Druid|TACS|4",
        "Cantrip Versatility|Druid|TACS|4|TCE",
        {
          "classFeature": "Druid Circle feature|Druid|TACS|6",
          "gainSubclassFeature": true
        },
        "Wild Shape Improvement|Druid|TACS|8",
        "Ability Score Improvement|Druid|TACS|8",
        {
          "classFeature": "Druid Circle feature|Druid|TACS|10",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Druid|TACS|12",
        {
          "classFeature": "Druid Circle feature|Druid|TACS|14",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Druid|TACS|16",
        "Timeless Body|Druid|TACS|18",
        "Beast Spells|Druid|TACS|18",
        "Ability Score Improvement|Druid|TACS|19",
        "Archdruid|Druid|TACS|20"
      ],
      "subclassTitle": "Druid Circle",
      "fluff": [
        {
          "name": "Druid",
          "type": "section",
          "entries": [
            "Holding high a gnarled staff wreathed with holly, an elf summons the fury of the storm and calls down explosive bolts of lightning to smite the torch-carrying orcs who threaten her forest.",
            "Crouching out of sight on a high tree branch in the form of a leopard, a human peers out of the jungle at the strange construction of a temple of Evil Elemental Air, keeping a close eye on the cultists' activities.",
            "Swinging a blade formed of pure fire, a half-elf charges into a mass of skeletal soldiers, sundering the unnatural magic that gives the foul creatures the mocking semblance of life.",
            "Whether calling on the elemental forces of nature or emulating the creatures of the animal world, druids are an embodiment of nature's resilience, cunning, and fury. They claim no mastery over nature. Instead, they see themselves as extensions of nature's indomitable will.",
            {
              "type": "entries",
              "name": "Power of Nature",
              "entries": [
                "Druids revere nature above all, gaining their spells and other magical powers either from the force of nature itself or from a nature deity. Many druids pursue a mystic spirituality of transcendent union with nature rather than devotion to a divine entity, while others serve gods of wild nature, animals, or elemental forces. The ancient druidic traditions are sometimes called the Old Faith, in contrast to the worship of gods in temples and shrines.",
                "Druid spells are oriented toward nature and animals—the power of tooth and claw, of sun and moon, of fire and storm. Druids also gain the ability to take on animal forms, and some druids make a particular study of this practice, even to the point where they prefer animal form to their natural form."
              ]
            },
            {
              "type": "entries",
              "name": "Preserve the Balance",
              "entries": [
                "For druids, nature exists in a precarious balance. The four elements that make up a world—air, earth, fire, and water—must remain in equilibrium. If one element were to gain power over the others, the world could be destroyed, drawn into one of the elemental planes and broken apart into its component elements. Thus, druids oppose cults of Elemental Evil and others who promote one element to the exclusion of others.",
                "Druids are also concerned with the delicate ecological balance that sustains plant and animal life, and the need for civilized folk to live in harmony with nature, not in opposition to it. Druids accept that which is cruel in nature, and they hate that which is unnatural, including aberrations (such as beholders and mind flayers) and undead (such as zombies and vampires). Druids sometimes lead raids against such creatures, especially when the monsters encroach on the druids' territory.",
                "Druids are often found guarding sacred sites or watching over regions of unspoiled nature. But when a significant danger arises, threatening nature's balance or the lands they protect, druids take on a more active role in combating the threat, as adventurers."
              ]
            },
            {
              "type": "entries",
              "name": "Creating a Druid",
              "entries": [
                "When making a druid, consider why your character has such a close bond with nature. Perhaps your character lives in a society where the Old Faith still thrives, or was raised by a druid after being abandoned in the depths of a forest. Perhaps your character had a dramatic encounter with the spirits of nature, coming face to face with a giant eagle or dire wolf and surviving the experience. Maybe your character was born during an epic storm or a volcanic eruption, which was interpreted as a sign that becoming a druid was part of your character's destiny.",
                "Have you always been an adventurer as part of your druidic calling, or did you first spend time as a caretaker of a sacred grove or spring? Perhaps your homeland was befouled by evil, and you took up an adventuring life in hopes of finding a new home or purpose.",
                {
                  "type": "entries",
                  "name": "Quick Build",
                  "entries": [
                    "You can make a druid quickly by following these suggestions. First, Wisdom should be your highest ability score, followed by Constitution. Second, choose the {@background hermit} background."
                  ]
                }
              ]
            },
            {
              "type": "inset",
              "name": "Sacred Plants and Wood",
              "entries": [
                "A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe.",
                "Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins.",
                "Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants."
              ]
            },
            {
              "type": "inset",
              "name": "Druids and the Gods",
              "entries": [
                "Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in appendix B include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples. In fact, in the world of Greyhawk, the druidic faith is called the Old Faith, and it claims many adherents among farmers, foresters, fishers, and others who live closely with nature. This tradition includes the worship of Nature as a primal force beyond personification, but also encompasses the worship of Beory, the Oerth Mother, as well as devotees of Obad-Hai, Ehlonna, and Ulaa.",
                "In the worlds of Greyhawk and the Forgotten Realms, druidic circles are not usually connected to the faith of a single nature deity. Any given circle in the Forgotten Realms, for example, might include druids who revere Silvanus, Mielikki, Eldath, Chauntea, or even the harsh Gods of Fury: Talos, Malar, Auril, and Umberlee. These nature gods are often called the First Circle, the first among the druids, and most druids count them all (even the violent ones) as worthy of veneration.",
                "The druids of Eberron hold animistic beliefs completely unconnected to the Sovereign Host, the Dark Six, or any of the other religions of the world. They believe that every living thing and every natural phenomenon—sun, moon, wind, fire, and the world itself—has a spirit. Their spells, then, are a means to communicate with and command these spirits. Different druidic sects, though, hold different philosophies about the proper relationship of these spirits to each other and to the forces of civilization. The Ashbound, for example, believe that arcane magic is an abomination against nature, the Children of Winter venerate the forces of death, and the Gatekeepers preserve ancient traditions meant to protect the world from the incursion of aberrations."
              ]
            }
          ],
          "source": "TACS",
          "page": null
        },
        {
          "type": "section",
          "entries": [
            {
              "type": "quote",
              "entries": [
                "Even in death, each creature plays its part in maintaining the Great Balance. But now an imbalance grows, a force that seeks to hold sway over nature. This is the destructive behavior of the mortal races. The farther away from nature their actions take them, the more corrupting their influence becomes. As druids, we seek mainly to protect and educate, to preserve the Great Balance, but there are times when we must rise up against danger and eradicate it."
              ],
              "by": "Safhran, archdruid"
            },
            "Druids are the caretakers of the natural world, and it is said that in time a druid becomes the voice of nature, speaking the truth that is too subtle for the general populace to hear. Many who become druids find that they naturally gravitate toward nature; its forces, cycles, and movements fill their minds and spirits with wonder and insight. Many sages and wise folk have studied nature, writing volumes about its mystery and power, but druids are a special kind of being: at some point, they begin to embody these natural forces, producing magical phenomena that link them to the spirit of nature and the flow of life. Because of their strange and mysterious power, druids are often revered, shunned, or considered dangerous by the people around them.",
            "Your druid character might be a true worshiper of nature, one who has always scorned civilization and found solace in the wild. Or your character could be a child of the city who now strives to bring the civilized world into harmony with the wilderness. You can use the sections that follow to flesh out your druid, regardless of how your character came to the profession.",
            {
              "type": "entries",
              "name": "Druids in Torin",
              "entries": [
                "Druids are known as peacekeepers of the wilderness and seas of Torin. While they see modern civilization as destructive forces to nature, they also understand its necessity to those who are not of their ways, and would rather maintain peace with them than fight. As long as their sacred groves remain untouched by their hands, they have no issue with maintaining the peace.",
                "Eldath, the Goddess of Peace and sister to Melora, Goddess of the Wilderness and Seas, birthed the first druids. While some worship her sister, most recognize and follow the tenets of Eldath, even if they don’t directly worship her.",
                "Some druidic circles worship other deities for various reasons. For instance, some groves within the mountains or in icy terrain worship The Matron of Ravens, who also holds the winter domain."
              ]
            },
            {
              "type": "entries",
              "name": "Treasured Item",
              "entries": [
                "Some druids carry one or more items that are sacred to them or have deep personal significance. Such items are not necessarily magical, but every one is an object whose meaning connects the druid's mind and heart to a profound concept or spiritual outlook.",
                "When you decide what your character's treasured item is, think about giving it an origin story: how did you come by the item, and why is it important to you?",
                {
                  "type": "table",
                  "caption": "Treasured Item",
                  "colLabels": [
                    "{@dice d6}",
                    "Treasured Item"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "A twig from the meeting tree that stands in the center of your village"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "A vial of water from the source of a sacred river"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Special herbs tied together in a bundle"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "A small bronze bowl engraved with animal images"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "A rattle made from a dried gourd and holly berries"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "A miniature golden sickle handed down to you by your mentor"
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Guiding Aspects",
              "entries": [
                "Many druids feel a strong link to a specific aspect of the natural world, such as a body of water, an animal, a type of tree, or some other sort of plant. You identify with your chosen aspect; by its behavior or its very nature, it sets an example that you seek to emulate.",
                {
                  "type": "table",
                  "caption": "Guiding Aspects",
                  "colLabels": [
                    "{@dice d6}",
                    "Guiding Aspects"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Yew trees remind you of renewing your mind and spirit, letting the old die and the new spring forth."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Oak trees represent strength and vitality. Meditating under an oak fills your body and mind with resolve and fortitude."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "The river's endless flow reminds you of the great span of the world. You seek to act with the long-term interests of nature in mind."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "The sea is a constant, churning cauldron of power and chaos. It reminds you that accepting change is necessary to sustain yourself in the world."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "The birds in the sky are evidence that even the smallest creatures can survive if they remain above the fray."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "As demonstrated by the actions of the wolf, an individual's strength is nothing compared to the power of the pack."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Mentors",
              "entries": [
                "It's not unusual for would-be druids to seek out (or be sought out by) instructors or elders who teach them the basics of their magical arts. Most druids who learn from a mentor begin their training at a young age, and the mentor has a vital role in shaping a student's attitudes and beliefs.",
                "If your character received training from someone else, who or what was that individual, and what was the nature of your relationship? Did your mentor imbue you with a particular outlook or otherwise influence your approach to achieving the goals of your chosen path?",
                {
                  "type": "table",
                  "caption": "Mentors",
                  "colLabels": [
                    "{@dice d6}",
                    "Mentors"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Your mentor was a wise treant who taught you to think in terms of years and decades rather than days or months."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "You were tutored by a dryad who watched over a slumbering portal to the Abyss. During your training, you were tasked with watching for hidden threats to the world."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Your tutor always interacted with you in the form of a falcon. You never saw the tutor's humanoid form."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "You were one of several youngsters who were mentored by an old druid, until one of your fellow pupils betrayed your group and killed your master."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Your mentor has appeared to you only in visions. You have yet to meet this person, and you are not sure such a person exists in mortal form."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "Your mentor was a werebear who taught you to treat all living things with equal regard."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "section",
              "name": "Learning Beast Shapes",
              "entries": [
                "Your wild shape feature allows you to take an beastial form, the appearance of which is up to you, the player. However, even as a protector of nature, there are only so many animals you can learn of while within the confines of your circle.",
                "Determine the type of terrain your circle is in, work with the DM on what animals you may have seen or learned about while within the circle, and other possible animals you may have seen or learned about after you left.",
                "Anytime you see a beast, you learn about its shape, its nature, and how to properly transform into it when you use your Wild Shape feature.",
                "You can also make an Intelligence ({@skill Nature}) check, the DC of which is 10 + the CR of the beast, and 1 hour of research per CR of the creature, with a minimum of 1 hour, to learn other beast shapes."
              ]
            }
          ],
          "source": "TACS"
        }
      ]
    }
  ],
  "subclass": [
    {
      "name": "Circle of the Land",
      "shortName": "Land",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "srd": false,
      "additionalSpells": [
        {
          "name": "Arctic",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "hold person",
              "spike growth"
            ],
            "5": [
              "sleet storm",
              "slow"
            ],
            "7": [
              "freedom of movement",
              "ice storm"
            ],
            "9": [
              "commune with nature",
              "cone of cold"
            ]
          }
        },
        {
          "name": "Coast",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "mirror image",
              "misty step"
            ],
            "5": [
              "water breathing",
              "water walk"
            ],
            "7": [
              "control water",
              "freedom of movement"
            ],
            "9": [
              "conjure elemental",
              "scrying"
            ]
          }
        },
        {
          "name": "Desert",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "blur",
              "silence"
            ],
            "5": [
              "create food and water",
              "protection from energy"
            ],
            "7": [
              "blight",
              "hallucinatory terrain"
            ],
            "9": [
              "insect plague",
              "wall of stone"
            ]
          }
        },
        {
          "name": "Forest",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "barkskin",
              "spider climb"
            ],
            "5": [
              "call lightning",
              "plant growth"
            ],
            "7": [
              "divination",
              "freedom of movement"
            ],
            "9": [
              "commune with nature",
              "tree stride"
            ]
          }
        },
        {
          "name": "Grassland",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "invisibility",
              "pass without trace"
            ],
            "5": [
              "daylight",
              "haste"
            ],
            "7": [
              "divination",
              "freedom of movement"
            ],
            "9": [
              "dream",
              "insect plague"
            ]
          }
        },
        {
          "name": "Mountain",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "spider climb",
              "spike growth"
            ],
            "5": [
              "lightning bolt",
              "meld into stone"
            ],
            "7": [
              "stone shape",
              "stoneskin"
            ],
            "9": [
              "passwall",
              "wall of stone"
            ]
          }
        },
        {
          "name": "Swamp",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "darkness",
              "Melf's acid arrow"
            ],
            "5": [
              "water walk",
              "stinking cloud"
            ],
            "7": [
              "freedom of movement",
              "locate creature"
            ],
            "9": [
              "insect plague",
              "scrying"
            ]
          }
        },
        {
          "name": "Underdark",
          "known": {
            "1": {
              "_": [
                {
                  "choose": "level=0|class=Druid"
                }
              ]
            }
          },
          "prepared": {
            "3": [
              "spider climb",
              "web"
            ],
            "5": [
              "gaseous form",
              "stinking cloud"
            ],
            "7": [
              "greater invisibility",
              "stone shape"
            ],
            "9": [
              "cloudkill",
              "insect plague"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of the Land|Druid|TACS|Land|TACS|2",
        "Land's Stride|Druid|TACS|Land|TACS|6",
        "Nature's Ward|Druid|TACS|Land|TACS|10",
        "Nature's Sanctuary|Druid|TACS|Land|TACS|14"
      ]
    },
    {
      "name": "Circle of the Moon",
      "shortName": "Moon",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "14": [
              "alter self"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of the Moon|Druid|TACS|Moon|TACS|2",
        "Primal Strike|Druid|TACS|Moon|TACS|6",
        "Release the Wild|Druid|TACS|Moon|TACS|10",
        "Thousand Forms|Druid|TACS|Moon|TACS|14"
      ]
    },
    {
      "name": "Circle of Dreams",
      "shortName": "Dreams",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "subclassFeatures": [
        "Circle of Dreams|Druid|TACS|Dreams|TACS|2",
        "Hearth of Moonlight and Shadow|Druid|TACS|Dreams|TACS|6",
        "Hidden Paths|Druid|TACS|Dreams|TACS|10",
        "Walker in Dreams|Druid|TACS|Dreams|TACS|14"
      ]
    },
    {
      "name": "Circle of the Shepherd",
      "shortName": "Shepherd",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "subclassFeatures": [
        "Circle of the Shepherd|Druid|TACS|Shepherd|TACS|2",
        "Mighty Summoner|Druid|TACS|Shepherd|TACS|6",
        "Guardian Spirit|Druid|TACS|Shepherd|TACS|10",
        "Faithful Summons|Druid|TACS|Shepherd|TACS|14"
      ]
    },
    {
      "name": "Circle of Spores",
      "shortName": "Spores",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "additionalSpells": [
        {
          "known": {
            "2": [
              "chill touch#c"
            ]
          },
          "prepared": {
            "3": [
              "blindness/deafness",
              "gentle repose"
            ],
            "5": [
              "animate dead",
              "gaseous form"
            ],
            "7": [
              "blight",
              "confusion"
            ],
            "9": [
              "cloudkill",
              "contagion"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of Spores|Druid|TACS|Spores|TACS|2",
        "Fungal Infestation|Druid|TACS|Spores|TACS|6",
        "Spreading Spores|Druid|TACS|Spores|TACS|10",
        "Fungal Body|Druid|TACS|Spores|TACS|14"
      ]
    },
    {
      "name": "Circle of Stars",
      "shortName": "Stars",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "2": [
              "guidance#c"
            ]
          },
          "prepared": {
            "2": [
              "guiding bolt"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of Stars|Druid|TACS|Stars|TACS|2",
        "Cosmic Omen|Druid|TACS|Stars|TACS|6",
        "Twinkling Constellations|Druid|TACS|Stars|TACS|10",
        "Full of Stars|Druid|TACS|Stars|TACS|14"
      ]
    },
    {
      "name": "Circle of Wildfire",
      "shortName": "Wildfire",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "2": [
              "burning hands",
              "cure wounds"
            ],
            "3": [
              "flaming sphere",
              "scorching ray"
            ],
            "5": [
              "plant growth",
              "revivify"
            ],
            "7": [
              "aura of life",
              "fire shield"
            ],
            "9": [
              "flame strike",
              "mass cure wounds"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of Wildfire|Druid|TACS|Wildfire|TACS|2",
        "Enhanced Bond|Druid|TACS|Wildfire|TACS|6",
        "Cauterizing Flames|Druid|TACS|Wildfire|TACS|10",
        "Blazing Revival|Druid|TACS|Wildfire|TACS|14"
      ]
    },
    {
      "name": "Circle of the Frozen Wastes",
      "source": "TACS",
      "subclassFeatures": [
        "Circle of the Frozen Wastes|Druid|TACS|Frozen Wastes|TACS|2",
        "Frozen Fortification|Druid|TACS|Frozen Wastes|TACS|6",
        "Frozen Beast Form|Druid|TACS|Frozen Wastes|TACS|10",
        "Archdruid of the Frozen Wastes|Druid|TACS|Frozen Wastes|TACS|14"
      ],
      "subclassSpells": [
        "Winter's Grasp|TACS",
        "Rime's binding ice|FTD",
        "Cold Snap|TACS",
        "Spirit Shroud|TCE",
        "Ice Storm",
        "Yeti's Chilling Gaze|TACS",
        "Cone of Cold",
        "Creeping Cold|TACS",
        "wall of ice",
        "Otiluke's Freezing Sphere"
      ],
      "additionalSpells": [
        {
          "prepared": {
            "2": [
              "ray of frost"
            ],
            "3": [
              "Winter's Grasp|TACS",
              "Rime's binding ice|FTD"
            ],
            "5": [
              "Cold Snap|TACS",
              "Spirit Shroud|TCE"
            ],
            "7": [
              "Ice Storm",
              "Yeti's Chilling Gaze|TACS"
            ],
            "9": [
              "Cone of Cold",
              "Creeping Cold|TACS"
            ],
            "14": [
              "wall of ice",
              "Otiluke's Freezing Sphere"
            ]
          }
        }
      ],
      "shortName": "Frozen Wastes",
      "className": "Druid",
      "classSource": "TACS"
    },
    {
      "name": "Circle of the Dragonkin",
      "source": "TACS",
      "subclassFeatures": [
        "Circle of the Dragonkin|Druid|TACS|Dragonkin|TACS|2",
        "Breath of the Dragonkin|Druid|TACS|Dragonkin|TACS|6",
        "Young Dragonkin|Druid|TACS|Dragonkin|TACS|6",
        "Adult Dragonkin|Druid|TACS|Dragonkin|TACS|10",
        "Ancient Dragonkin|Druid|TACS|Dragonkin|TACS|14"
      ],
      "subclassSpells": [
        "cause fear|XGE",
        "chromatic orb",
        "alter self",
        "dragon's breath|XGE",
        "fear",
        "fly",
        "arcane eye",
        "compulsion",
        "contact other plane",
        "dominate person"
      ],
      "additionalSpells": [
        {
          "prepared": {
            "2": [
              "cause fear|XGE",
              "chromatic orb"
            ],
            "3": [
              "alter self",
              "dragon's breath|XGE"
            ],
            "5": [
              "fear",
              "fly"
            ],
            "7": [
              "arcane eye",
              "compulsion"
            ],
            "9": [
              "contact other plane",
              "dominate person"
            ]
          }
        }
      ],
      "shortName": "Dragonkin",
      "className": "Druid",
      "classSource": "TACS"
    },
    {
      "name": "Circle of Remedies",
      "subclassSpells": [
        "goodberry",
        "sleep",
        "aid",
        "calm emotions",
        "speak with plants",
        "mass healing word",
        "aura of purity",
        "ward of vitality|TACS",
        "commune with nature",
        "greater restoration"
      ],
      "additionalSpells": [
        {
          "prepared": {
            "2": [
              "goodberry",
              "sleep"
            ],
            "3": [
              "aid",
              "calm emotions"
            ],
            "5": [
              "speak with plants",
              "mass healing word"
            ],
            "7": [
              "aura of purity",
              "ward of vitality|TACS"
            ],
            "9": [
              "commune with nature",
              "greater restoration"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Circle of Remedies|Druid|TACS|Remedies|TACS|2",
        "Additional Remedies|Druid|TACS|Remedies|TACS|6",
        "Nature's Guardian|Druid|TACS|Remedies|TACS|6",
        "Additional Remedies|Druid|TACS|Remedies|TACS|10",
        "Champion of Nature|Druid|TACS|Remedies|TACS|14"
      ],
      "source": "TACS",
      "shortName": "Remedies",
      "className": "Druid",
      "classSource": "TACS"
    }
  ],
  "classFeature": [
    {
      "name": "Bond of The Wilderness",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "You have a mystical bond with the wild nature, giving you one of two gifts:",
        {
          "type": "list",
          "style": "list-hang-notitle",
          "items": [
            {
              "type": "item",
              "name": "Nature's Companion",
              "entry": "You have a companion in the form of a magical fey or beast. The creature's type doesn’t change its game statistics. Use the {@creature Nature Companion|TACS} stat block for its statistics. In combat, it acts during your turn. It can move and use its reaction on its own, but the only action it takes is the {@action Dodge} action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are incapacitated, the it can take any action of its choice, not just {@action Dodge}. If it has died within the last hour, you can use your action to touch it and expend a spell slot of 1st level or higher. The beast returns to life after 1 minute with all its hit points restored, otherwise it returns to life when you finish a long rest."
            },
            {
              "type": "item",
              "name": "Nature's Recovery",
              "entry": "While outdoors in natural terrain or wilderness, when you finish a short rest you regain an additional 1d8 hit points for each hit die you spend and you can regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). You can regain spell slots in this way only once per long rest. You can regain spell slots in this way more than once before finishing a long rest when you reach higher levels in this class, becoming twice at level 5, three times at 10th level, four times at 15th level, and five times at 20th level. In addition, when you finish a short rest, you can swap one druid spell you have prepared for another one you don't have prepared. Once you do so, you can’t do so again until you finish a long rest."
            }
          ]
        }
      ]
    },
    {
      "name": "Druidic",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "You know {@language Druidic}, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom ({@skill Perception}) check but can't decipher it without magic."
      ]
    },
    {
      "name": "Spellcasting",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for the {@filter druid spell list|spells|class=druid}.",
        {
          "type": "entries",
          "name": "Cantrips",
          "entries": [
            "At 1st level, you know two cantrips of your choice from the {@filter druid spell list|spells|level=0|class=druid}. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table."
          ]
        },
        {
          "type": "entries",
          "name": "Preparing and Casting Spells",
          "entries": [
            "The Druid table shows how many spell slots you have to cast your {@filter druid spells|spells|class=druid} of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
            "You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.",
            "For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
            "You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Ability",
          "entries": [
            "Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.",
            {
              "type": "abilityDc",
              "name": "Spell",
              "attributes": [
                "wis"
              ]
            },
            {
              "type": "abilityAttackMod",
              "name": "Spell",
              "attributes": [
                "wis"
              ]
            }
          ]
        },
        {
          "type": "entries",
          "name": "Ritual Casting",
          "entries": [
            "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared."
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Focus",
          "entries": [
            "You can use a {@item druidic focus|phb} as a spellcasting focus for your druid spells."
          ]
        }
      ]
    },
    {
      "name": "Druid Circle",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "At 2nd level, you choose to identify with a circle of druids from the list of available circles. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
      ]
    },
    {
      "name": "Wild Companion",
      "source": "TCE",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "level": 2,
      "isClassFeatureVariant": true,
      "consumes": {
        "name": "Wild Shape"
      },
      "entries": [
        "{@i 2nd-level druid {@variantrule optional class features|tce|optional feature}}",
        "You gain the ability to summon a spirit that assumes an animal form: as an action, you can expend a use of your Wild Shape feature to cast the {@spell find familiar} spell, without material components.",
        "When you cast the spell in this way, the familiar is a fey instead of a beast, and the familiar disappears after a number of hours equal to half your druid level."
      ]
    },
    {
      "name": "Wild Shape",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "Starting at 2nd level, you can use your bonus action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.",
        "When you assume this shape, use the {@creature Wild Beast|TACS} stat block. You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.",
        "While you are transformed, the following rules apply:",
        {
          "type": "list",
          "items": [
            "Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your proficiency bonus and your skill and saving throw proficiencies, in addition to gaining those of the creature.",
            "When you transform, you assume the beast's hit points. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.",
            "You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as {@spell call lightning}, that you've already cast.",
            "You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so.",
            "You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
            "When you transform, you can choose to become a medium or smaller beast. If you become a tiny beast, you always deal 1 damage with your natural weapons."
          ]
        }
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 4,
      "entries": [
        "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Cantrip Versatility",
      "source": "TCE",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "level": 4,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 4th-level druid {@variantrule optional class features|tce|optional feature}}",
        "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace one cantrip you learned from this class's Spellcasting feature with another cantrip from the {@filter druid spell list|spells|level=0|class=Druid}."
      ]
    },
    {
      "name": "Wild Shape Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 4,
      "entries": [
        "At 4th level, your wild shape improves, allowing you to gain a swimming speed equal to your walking speed while in your Wild Beast form."
      ]
    },
    {
      "name": "Druid Circle feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 6,
      "entries": [
        "At 6th level, you gain a feature granted by your Druid Circle."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Wild Shape Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "At 8th level, your wild shape improves, allowing you to gain a flying speed equal to twice your walking speed while in your Wild Beast form and you can attack twice instead of once when you take the {@action Attack} action. In addition, your size while in that form can be large or smaller, you choose when you assume the form. Becoming large increases the damage of your maul by {@dice 1d8}."
      ]
    },
    {
      "name": "Druid Circle feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 10,
      "entries": [
        "At 10th level, you gain a feature granted by your Druid Circle feature."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 12,
      "entries": [
        "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Druid Circle feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 14,
      "entries": [
        "At 14th level, you gain a feature granted by your Druid Circle feature."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 16,
      "entries": [
        "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Beast Spells",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 18,
      "entries": [
        "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
      ]
    },
    {
      "name": "Timeless Body",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 18,
      "entries": [
        "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 19,
      "entries": [
        "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Archdruid",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "level": 20,
      "entries": [
        "At 20th level, you have an unbreakable connection to nature. You can wild shape four times per short rest instead of twice. In addition, you can cast the {@spell commune with nature} spell at will, without needing to prepare it or expending a spell slot.",
        "Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "Circle of the Land",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in {@language Druidic}. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Bonus Cantrip|Druid|TACS|Land|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Natural Recovery|Druid|TACS|Land|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Land|TACS|2"
        }
      ]
    },
    {
      "name": "Bonus Cantrip",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "You learn one additional druid cantrip of your choice. This cantrip doesn't count against the number of druid cantrips you know."
      ]
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land—arctic, coast, desert, forest, grassland, mountain, swamp, or Underdark—and consult the associated list of spells.",
        "Once you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Arctic",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell hold person}, {@spell spike growth}"
            ],
            [
              "5th",
              "{@spell sleet storm}, {@spell slow}"
            ],
            [
              "7th",
              "{@spell freedom of movement}, {@spell ice storm}"
            ],
            [
              "9th",
              "{@spell commune with nature}, {@spell cone of cold}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Coast",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell mirror image}, {@spell misty step}"
            ],
            [
              "5th",
              "{@spell water breathing}, {@spell water walk}"
            ],
            [
              "7th",
              "{@spell control water}, {@spell freedom of movement}"
            ],
            [
              "9th",
              "{@spell conjure elemental}, {@spell scrying}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Desert",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell blur}, {@spell silence}"
            ],
            [
              "5th",
              "{@spell create food and water}, {@spell protection from energy}"
            ],
            [
              "7th",
              "{@spell blight}, {@spell hallucinatory terrain}"
            ],
            [
              "9th",
              "{@spell insect plague}, {@spell wall of stone}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Forest",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell barkskin}, {@spell spider climb}"
            ],
            [
              "5th",
              "{@spell call lightning}, {@spell plant growth}"
            ],
            [
              "7th",
              "{@spell divination}, {@spell freedom of movement}"
            ],
            [
              "9th",
              "{@spell commune with nature}, {@spell tree stride}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Grassland",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell invisibility}, {@spell pass without trace}"
            ],
            [
              "5th",
              "{@spell daylight}, {@spell haste}"
            ],
            [
              "7th",
              "{@spell divination}, {@spell freedom of movement}"
            ],
            [
              "9th",
              "{@spell dream}, {@spell insect plague}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Mountain",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell spider climb}, {@spell spike growth}"
            ],
            [
              "5th",
              "{@spell lightning bolt}, {@spell meld into stone}"
            ],
            [
              "7th",
              "{@spell stone shape}, {@spell stoneskin}"
            ],
            [
              "9th",
              "{@spell passwall}, {@spell wall of stone}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Swamp",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell darkness}, {@spell Melf's acid arrow}"
            ],
            [
              "5th",
              "{@spell water walk}, {@spell stinking cloud}"
            ],
            [
              "7th",
              "{@spell freedom of movement}, {@spell locate creature}"
            ],
            [
              "9th",
              "{@spell insect plague}, {@spell scrying}"
            ]
          ]
        },
        {
          "type": "table",
          "caption": "Underdark",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell spider climb}, {@spell web}"
            ],
            [
              "5th",
              "{@spell gaseous form}, {@spell stinking cloud}"
            ],
            [
              "7th",
              "{@spell greater invisibility}, {@spell stone shape}"
            ],
            [
              "9th",
              "{@spell cloudkill}, {@spell insect plague}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Natural Recovery",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest.",
        "For example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots."
      ]
    },
    {
      "name": "Land's Stride",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, moving through nonmagical {@quickref difficult terrain|TACS|3} costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
        "In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the {@spell entangle} spell."
      ]
    },
    {
      "name": "Nature's Ward",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "When you reach 10th level, you can't be {@condition charmed} or {@condition frightened} by elementals or fey, and you are immune to poison and disease."
      ]
    },
    {
      "name": "Nature's Sanctuary",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Land",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.",
        "The creature is aware of this effect before it makes its attack against you."
      ]
    },
    {
      "name": "Circle of the Moon",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Moon",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "Druids of the Circle of the Moon are fierce guardians of the wilds. Their order gathers under the full moon to share news and trade warnings. They haunt the deepest parts of the wilderness, where they might go for weeks on end before crossing paths with another humanoid creature, let alone another druid.",
        "Changeable as the moon, a druid of this circle might prowl as a great cat one night, soar over the treetops as an eagle the next day, and crash through the undergrowth in bear form to drive off a trespassing monster. The wild is in the druid's blood.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Combat Wild Shape|Druid|TACS|Moon|TACS|2"
        }
      ]
    },
    {
      "name": "Combat Wild Shape",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Moon",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Starting at 2nd level, when you use your Wild Shape ability, your Wild Beast form gains a number of temporary hit points equal to your druid level.",
        "Additionally, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to regain {@dice 1d8} hit points per level of the spell slot expended."
      ]
    },
    {
      "name": "Primal Strike",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Moon",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, your attacks in beast form count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
      ]
    },
    {
      "name": "Release the Wild",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Moon",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "consumes": {
        "name": "Wild Shape",
        "amount": 2
      },
      "entries": [
        "At 10th level, while in your Wild Beast form, you can make three attacks when you take the attack action, as opposed to two."
      ]
    },
    {
      "name": "Thousand Forms",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Moon",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "By 14th level, you have learned to use magic to alter your physical form in more subtle ways. You can cast the {@spell alter self} spell at will."
      ]
    },
    {
      "name": "Circle of Spores",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "Druids of the Circle of Spores find beauty in decay. They see within mold and other fungi the ability to transform lifeless material into abundant, albeit somewhat strange, life.",
        "These druids believe that life and death are parts of a grand cycle, with one leading to the other and then back again. Death isn't the end of life, but instead a change of state that sees life shift into a new form.",
        "Druids of this circle have a complex relationship with the undead. Unlike most other druids, they see nothing inherently wrong with undeath, which they consider to be a companion to life and death. But these druids believe that the natural cycle is healthiest when each segment of it is vibrant and changing. Undead that seek to replace all life with undeath, or that try to avoid passing to a final rest, violate the cycle and must be thwarted.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Spores|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Halo of Spores|Druid|TACS|Spores|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Symbiotic Entity|Druid|TACS|Spores|TACS|2"
        }
      ]
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Your symbiotic link to fungus and your ability to tap into the cycle of life and death grants you access to certain spells. At 2nd level, you learn the {@spell chill touch} cantrip. At 3rd, 5th, 7th, and 9th level you gain access to the spells listed for that level in the Circle of Spores Spells table.",
        "Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Circle of Spores Spells",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell blindness/deafness}, {@spell gentle repose}"
            ],
            [
              "5th",
              "{@spell animate dead}, {@spell gaseous form}"
            ],
            [
              "7th",
              "{@spell blight}, {@spell confusion}"
            ],
            [
              "9th",
              "{@spell cloudkill}, {@spell contagion}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Halo of Spores",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Starting at 2nd level, you are surrounded by invisible, necrotic spores that are harmless until you unleash them on a creature nearby. When a creature you can see moves into a space within 10 feet of you or starts its turn there, you can use your reaction to deal {@damage 1d4} necrotic damage to that creature unless it succeeds on a Constitution saving throw against your spell save DC. The necrotic damage increases to {@dice 1d6} at 6th level, {@dice 1d8} at 10th level, and {@dice 1d10} at 14th level."
      ]
    },
    {
      "name": "Symbiotic Entity",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "consumes": {
        "name": "Wild Shape"
      },
      "entries": [
        "At 2nd level, you gain the ability to channel magic into your spores. As an action, you can expend a use of your Wild Shape feature to awaken those spores, rather than transforming into a beast form, and you gain 4 temporary hit points for each level you have in this class. While this feature is active, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "When you deal your Halo of Spores damage, roll the damage die a second time and add it to the total.",
            "Your melee weapon attacks deal an extra {@damage 1d6} necrotic damage to any target they hit."
          ]
        },
        "These benefits last for 10 minutes, until you lose all these temporary hit points, or until you use your Wild Shape again."
      ]
    },
    {
      "name": "Fungal Infestation",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "At 6th level, your spores gain the ability to infest a corpse and animate it. If a beast or a humanoid that is Small or Medium dies within 10 feet of you, you can use your reaction to animate it, causing it to stand up immediately with 1 hit point. The creature uses the {@creature zombie} stat block in the {@book Monster Manual|MM}. It remains animate for 1 hour, after which time it collapses and dies.",
        "In combat, the zombie's turn comes immediately after yours. It obeys your mental commands, and the only action it can take is the {@action Attack} action, making one melee attack.",
        "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses of it when you finish a long rest."
      ]
    },
    {
      "name": "Spreading Spores",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "At 10th level, you gain the ability to seed an area with deadly spores. As a bonus action while your Symbiotic Entity feature is active, you can hurl spores up to 30 feet away, where they swirl in a 10-foot cube for 1 minute. The spores disappear early if you use this feature again, if you dismiss them as a bonus action, or if your Symbiotic Entity feature is no longer active.",
        "Whenever a creature moves into the cube or starts its turn there, that creature takes your Halo of Spores damage, unless the creature succeeds on a Constitution saving throw against your spell save DC. A creature can take this damage no more than once per turn.",
        "While the cube of spores persists, you can't use your Halo of Spores reaction."
      ]
    },
    {
      "name": "Fungal Body",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "GGR",
          "page": 26
        }
      ],
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Spores",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "At 14th level, the fungal spores in your body alter you: you can't be {@condition blinded}, {@condition deafened}, {@condition frightened}, or {@condition poisoned}, and any critical hit against you counts as a normal hit instead, unless you're {@condition incapacitated}."
      ]
    },
    {
      "name": "Circle of Stars",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "The Circle of Stars allows druids to draw on the power of starlight. These druids have tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By revealing and understanding these secrets, the Circle of the Stars seeks to harness the powers of the cosmos.",
        "Many druids of this circle keep records of the constellations and the stars' effects on the world. Some groups document these observations at megalithic sites, which serve as enigmatic libraries of lore. These repositories might take the form of stone circles, pyramids, petroglyphs, and underground temples-any construction durable enough to protect the circle's sacred knowledge even against a great cataclysm.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Star Map|Druid|TACS|Stars|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Starry Form|Druid|TACS|Stars|TACS|2"
        }
      ]
    },
    {
      "name": "Star Map",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "{@i 2nd-level Circle of the Stars feature}",
        "You've created a star chart as part of your heavenly studies. It is a Tiny object and can serve as a spellcasting focus for your druid spells. You determine its form by rolling on the Star Map table or by choosing one.",
        {
          "type": "table",
          "caption": "Star Map",
          "colLabels": [
            "d6",
            "Map Form"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "1",
              "A scroll covered with depictions of constellations"
            ],
            [
              "2",
              "A stone tablet with fine holes drilled through it"
            ],
            [
              "3",
              "A speckled owlbear hide, tooled with raised marks"
            ],
            [
              "4",
              "A collection of maps bound in an ebony cover"
            ],
            [
              "5",
              "A crystal that projects starry patterns when placed before a light"
            ],
            [
              "6",
              "Glass disks that depict constellations"
            ]
          ]
        },
        "While holding this map, you have these benefits:",
        {
          "type": "list",
          "items": [
            "You know the {@spell guidance} cantrip.",
            "You have the {@spell guiding bolt} spell prepared. It counts as a druid spell for you, and it doesn't count against the number of spells you can have prepared.",
            "You can cast {@spell guiding bolt} without expending a spell slot. You can do so a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
          ]
        },
        "If you lose the map, you can perform a 1-hour ceremony to magically create a replacement. This ceremony can be performed during a short or long rest, and it destroys the previous map."
      ]
    },
    {
      "name": "Starry Form",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "consumes": {
        "name": "Wild Shape"
      },
      "entries": [
        "{@i 2nd-level Circle of the Stars feature}",
        "As a bonus action, you can expend a use of your Wild Shape feature to take on a starry form, rather than transforming into a beast.",
        "While in your starry form, you retain your game statistics, but your body becomes luminous; your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The form lasts for 10 minutes. It ends early if you dismiss it (no action required), are {@condition incapacitated}, die, or use this feature again.",
        "Whenever you assume your starry form, choose which of the following constellations glimmers on your body; your choice gives you certain benefits while in the form:",
        {
          "type": "entries",
          "name": "Archer",
          "entries": [
            "A constellation of an archer appears on you. When you activate this form, and as a bonus action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous arrow that targets one creature within 60 feet of you. On a hit, the attack deals radiant damage equal to {@dice 1d8} + your Wisdom modifier."
          ]
        },
        {
          "type": "entries",
          "name": "Chalice",
          "entries": [
            "A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores hit points to a creature, you or another creature within 30 feet of you can regain hit points equal to {@dice 1d8} + your Wisdom modifier."
          ]
        },
        {
          "type": "entries",
          "name": "Dragon",
          "entries": [
            "A constellation of a wise dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain concentration on a spell, you can treat a roll of 9 or lower on the {@dice d20} as a 10."
          ]
        }
      ]
    },
    {
      "name": "Cosmic Omen",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Circle of the Stars feature}",
        "Whenever you finish a long rest, you can consult your Star Map for omens. When you do so, roll a die. Until you finish your next long rest, you gain access to a special reaction based on whether you rolled an even or an odd number on the die:",
        {
          "type": "list",
          "style": "list-hang-notitle",
          "items": [
            {
              "type": "item",
              "name": "Weal (even)",
              "entry": "Whenever a creature you can see within 30 feet of you is about to make an attack roll, a saving throw, or an ability check, you can use your reaction to roll a {@dice d6} and add the number rolled to the total."
            },
            {
              "type": "item",
              "name": "Woe (odd)",
              "entry": "Whenever a creature you can see within 30 feet of you is about to make an attack roll, a saving throw, or an ability check, you can use your reaction to roll a {@dice d6} and subtract the number rolled from the total."
            }
          ]
        },
        "You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Twinkling Constellations",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "{@i 10th-level Circle of the Stars feature}",
        "The constellations of your Starry Form improve. The {@dice 1d8} of the Archer and the Chalice becomes {@dice 2d8}, and while the Dragon is active, you have a flying speed of 20 feet and can hover.",
        "Moreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body."
      ]
    },
    {
      "name": "Full of Stars",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Stars",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Circle of the Stars feature}",
        "While in your Starry Form, you become partially incorporeal, giving you resistance to bludgeoning, piercing, and slashing damage."
      ]
    },
    {
      "name": "Circle of Wildfire",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "Druids within the Circle of Wildfire understand that destruction is sometimes the precursor of creation, such as when a forest fire promotes later growth. These druids bond with a primal spirit that harbors both destructive and creative power, allowing the druids to create controlled flames that burn away one thing but give life to another.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Wildfire|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Summon Wildfire Spirit|Druid|TACS|Wildfire|TACS|2"
        }
      ]
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "{@i 2nd-level Circle of Wildfire feature}",
        "You have formed a bond with a wildfire spirit, a primal being of creation and destruction. Your link with this spirit grants you access to some spells when you reach certain levels in this class, as shown on the Circle of Wildfire Spells table.",
        "Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Circle of Wildfire Spells",
          "colLabels": [
            "Druid Level",
            "Circle Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "2nd",
              "{@spell burning hands}, {@spell cure wounds}"
            ],
            [
              "3rd",
              "{@spell flaming sphere}, {@spell scorching ray}"
            ],
            [
              "5th",
              "{@spell plant growth}, {@spell revivify}"
            ],
            [
              "7th",
              "{@spell aura of life}, {@spell fire shield}"
            ],
            [
              "9th",
              "{@spell flame strike}, {@spell mass cure wounds}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Summon Wildfire Spirit",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "consumes": {
        "name": "Wild Shape"
      },
      "entries": [
        "{@i 2nd-level Circle of Wildfire feature}",
        "You can summon the primal spirit bound to your soul. As an action, you can expend one use of your Wild Shape feature to summon your wildfire spirit, rather than assuming a beast form.",
        "The spirit appears in an unoccupied space of your choice that you can see within 30 feet of you. Each creature within 10 feet of the spirit (other than you) when it appears must succeed on a Dexterity saving throw against your spell save DC or take {@damage 2d6} fire damage.",
        "The spirit is friendly to you and your companions and obeys your commands. See this creature's game statistics in the {@creature Wildfire Spirit|TCE} stat block, which uses your proficiency bonus (PB) in several places. You determine the spirit's appearance. Some spirits take the form of a humanoid figure made of gnarled branches covered in flame, while others look like beasts wreathed in fire.",
        "In combat, the spirit shares your initiative count, but it takes its turn immediately after yours. The only action it takes on its turn is the {@action Dodge} action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are {@condition incapacitated}, the spirit can take any action of its choice, not just {@action Dodge}.",
        "The spirit manifests for 1 hour, until it is reduced to 0 hit points, until you use this feature to summon the spirit again, or until you die.",
        "If you have the nature's companion gift from your Bond of The Wilderness feature, instead of summoning a wildfire spirit, you can expend your wild shape to cause your nature companion to transform into a wildfire spirit, assuming its hit points and statistics. When it is reduced to 0 hit points, it reverts back to its original form with the hit points it was at before it transformed. It otherwise follows the same rules as your nature companion."
      ]
    },
    {
      "name": "Enhanced Bond",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Circle of Wildfire feature}",
        "The bond with your wildfire spirit enhances your destructive and restorative spells. Whenever you cast a spell that deals fire damage or restores hit points while your wildfire spirit is summoned, roll a {@dice d8}, and you gain a bonus equal to the number rolled to one damage or healing roll of the spell.",
        "In addition, when you cast a spell with a range other than self, the spell can originate from you or your wildfire spirit."
      ]
    },
    {
      "name": "Cauterizing Flames",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "{@i 10th-level Circle of Wildfire feature}",
        "You gain the ability to turn death into magical flames that can heal or incinerate. When a Small or larger creature dies within 30 feet of you or your wildfire spirit, a harmless spectral flame springs forth in the dead creature's space and flickers there for 1 minute. When a creature you can see enters that space, you can use your reaction to extinguish the spectral flame there and either heal the creature or deal fire damage to it. The healing or damage equals {@dice 2d10} + your Wisdom modifier.",
        "You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Blazing Revival",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Wildfire",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Circle of Wildfire feature}",
        "The bond with your wildfire spirit can save you from death. If the spirit is within 120 feet of you when you are reduced to 0 hit points and thereby fall {@condition unconscious}, you can cause the spirit to drop to 0 hit points. You then regain half your hit points and immediately rise to your feet.",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Circle of Dreams",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dreams",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "Druids who are members of the Circle of Dreams hail from regions that have strong ties to the Feywild and its dreamlike realms. The druids' guardianship of the natural world makes for a natural alliance between them and good-aligned fey. These druids seek to fill the world with dreamy wonder. Their magic mends wounds and brings joy to downcast hearts, and the realms they protect are gleaming, fruitful places, where dream and reality blur together and where the weary can find rest.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Balm of the Summer Court|Druid|TACS|Dreams|TACS|2"
        }
      ]
    },
    {
      "name": "Balm of the Summer Court",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dreams",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "At 2nd level, you become imbued with the blessings of the Summer Court. You are a font of energy that offers respite from injuries. You have a pool of fey energy represented by a number of {@dice d6}s equal to your druid level.",
        "As a bonus action, you can choose one creature you can see within 120 feet of you and spend a number of those dice equal to half your druid level or less. Roll the spent dice and add them together. The target regains a number of hit points equal to the total. The target also gains 1 temporary hit point per die spent.",
        "You regain all expended dice when you finish a long rest."
      ]
    },
    {
      "name": "Hearth of Moonlight and Shadow",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dreams",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "At 6th level, home can be wherever you are. During a short or long rest, you can invoke the shadowy power of the Gloaming Court to help guard your respite. At the start of the rest, you touch a point in space, and an invisible, 30-foot-radius sphere of magic appears, centered on that point. Total cover blocks the sphere.",
        "While within the sphere, you and your allies gain a +5 bonus to Dexterity ({@skill Stealth}) and Wisdom ({@skill Perception}) checks, and any light from open flames in the sphere (a campfire, torches, or the like) isn't visible outside it.",
        "The sphere vanishes at the end of the rest or when you leave the sphere."
      ]
    },
    {
      "name": "Hidden Paths",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dreams",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, you can use the hidden, magical pathways that some fey use to traverse space in the blink of an eye. As a bonus action on your turn, you can teleport up to 60 feet to an unoccupied space you can see. Alternatively, you can use your action to teleport one willing creature you touch up to 30 feet to an unoccupied space you can see.",
        "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses of it when you finish a long rest."
      ]
    },
    {
      "name": "Walker in Dreams",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dreams",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "At 14th level, the magic of the Feywild grants you the ability to travel mentally or physically through dreamlands.",
        "When you finish a short rest, you can cast one of the following spells, without expending a spell slot or requiring material components: {@spell dream} (with you as the messenger), {@spell scrying}, or {@spell teleportation circle}.",
        "This use of {@spell teleportation circle} is special. Rather than opening a portal to a permanent {@spell teleportation circle}, it opens a portal to the last location where you finished a long rest on your current plane of existence. If you haven't taken a long rest on your current plane, the spell fails but isn't wasted.",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Circle of the Shepherd",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 2,
      "entries": [
        "Druids of the Circle of the Shepherd commune with the spirits of nature, especially the spirits of beasts and the fey, and call to those spirits for aid. These druids recognize that all living things play a role in the natural world, yet they focus on protecting animals and fey creatures that have difficulty defending themselves. Shepherds, as they are known, see such creatures as their charges. They ward off monsters that threaten them, rebuke hunters who kill more prey than necessary, and prevent civilization from encroaching on rare animal habitats and on sites sacred to the fey. Many of these druids are happiest far from cities and towns, content to spend their days in the company of animals and the fey creatures of the wilds.",
        "Members of this circle become adventurers to oppose forces that threaten their charges or to seek knowledge and power that will help them safeguard their charges better. Wherever these druids go, the spirits of the wilderness are with them.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Speech of the Woods|Druid|TACS|Shepherd|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Spirit Totem|Druid|TACS|Shepherd|TACS|2"
        }
      ]
    },
    {
      "name": "Speech of the Woods",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "At 2nd level, you gain the ability to converse with beasts and many fey.",
        "You learn to speak, read, and write {@language Sylvan}. In addition, beasts can understand your speech, and you gain the ability to decipher their noises and motions. Most beasts lack the intelligence to convey or understand sophisticated concepts, but a friendly beast could relay what it has seen or heard in the recent past. This ability doesn't grant you friendship with beasts, though you can combine this ability with gifts to curry favor with them as you would with any nonplayer character."
      ]
    },
    {
      "name": "Spirit Totem",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 2,
      "header": 1,
      "entries": [
        "Starting at 2nd level, you can call forth nature spirits to influence the world around you. As a bonus action, you can magically summon an incorporeal spirit to a point you can see within 60 feet of you. The spirit creates an aura in a 30-foot radius around that point. It counts as neither a creature nor an object, though it has the spectral appearance of the creature it represents.",
        "As a bonus action, you can move the spirit up to 60 feet to a point you can see.",
        "The spirit persists for 1 minute or until you're {@condition incapacitated}. Once you use this feature, you can't use it again until you finish a short or long rest.",
        "The effect of the spirit's aura depends on the type of spirit you summon from the options below.",
        {
          "type": "entries",
          "name": "Bear Spirit",
          "entries": [
            "The bear spirit grants you and your allies its might and endurance. Each creature of your choice in the aura when the spirit appears gains temporary hit points equal to 5 + your druid level. In addition, you and your allies gain advantage on Strength checks and Strength saving throws while in the aura."
          ]
        },
        {
          "type": "entries",
          "name": "Hawk Spirit",
          "entries": [
            "The hawk spirit is a consummate hunter, aiding you and your allies with its keen sight. When a creature makes an attack roll against a target in the spirit's aura, you can use your reaction to grant advantage to that attack roll. In addition, you and your allies have advantage on Wisdom ({@skill Perception}) checks while in the aura."
          ]
        },
        {
          "type": "entries",
          "name": "Unicorn Spirit",
          "entries": [
            "The unicorn spirit lends its protection to those nearby. You and your allies gain advantage on all ability checks made to detect creatures in the spirit's aura. In addition, if you cast a spell using a spell slot that restores hit points to any creature inside or outside the aura, each creature of your choice in the aura also regains hit points equal to your druid level."
          ]
        },
        "If you have the nature's companion gift from your Bond of The Wilderness feature, instead of summoning a spirit you can cause the aura to emit off of your nature companion, choosing from the spirit options for the purposes of the effect of the aura. You can either have the choice to transform your companion to assume the form of that spirit, or it can maintain its original form. The aura moves with your companion.",
        "The transformation lasts for 1 minute or until you're {@condition incapacitated}. When you have no uses of the feature remaining, you can expend a spell slot of 1st level or higher to use it again."
      ]
    },
    {
      "name": "Mighty Summoner",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, beasts and fey that you conjure are more resilient than normal. Any beast or fey summoned or created by a spell that you cast, or from a class feature, gains the following benefits:",
        {
          "type": "list",
          "items": [
            "The creature appears with more hit points than normal: 2 extra hit points per Hit Die it has.",
            "The damage from its natural weapons is considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks and damage."
          ]
        }
      ]
    },
    {
      "name": "Guardian Spirit",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Beginning at 10th level, your Spirit Totem safeguards the beasts and fey that you call forth with your magic. When a beast or fey that you summoned or created with a spell, or class feature, ends its turn in your Spirit Totem aura, that creature regains a number of hit points equal to half your druid level."
      ]
    },
    {
      "name": "Faithful Summons",
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Shepherd",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, the nature spirits you commune with protect you when you are the most defenseless. If you are reduced to 0 hit points or are {@condition incapacitated} against your will, you can immediately gain the benefits of {@spell conjure animals} as if it were cast using a 9th-level spell slot. It summons four beasts of your choice that are challenge rating 2 or lower. The conjured beasts appear within 20 feet of you. If they receive no commands from you, they protect you from harm and attack your foes. The spell lasts for 1 hour, requiring no concentration, or until you dismiss it (no action required).",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Circle of The Frozen Wastes",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "level": 2,
      "header": 1,
      "entries": [
        "Druids of the Circle of The Frozen Wastes find safety in the cold. Few creatures can survive in the icy tundras and those that do often form pacts with these druidic tribes. Elementals, dragons, even the occasional wandering spirits often thrive in the cold.",
        "Winter is an unavoidable part of nature, most flowers and crops perish during these times. However, there are other plants that flourish in the cold and the shade, perishing in the warmth and sunlight.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Frozen Wastes|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Frozen Affinity|Druid|TACS|Frozen Wastes|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Frigid Form|Druid|TACS|Frozen Wastes|TACS|2"
        }
      ],
      "page": null
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "page": null,
      "level": 2,
      "header": 2,
      "entries": [
        "Your time surviving in the frozen wastes grants you access to certain spells. At 2nd level, you learn the ray of frost cantrip. At 3rd, 5th, 7th, and 9th level you gain access to the spells listed for that level in the Circle of Frozen Wastes Spells table.",
        "Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Circle Spells",
          "colLabels": [
            "Druid Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "3rd",
              "{@spell winter's grasp|TACS}, {@spell Rime's binding ice|FTD}"
            ],
            [
              "5th",
              "{@spell cold snap|TACS}, {@spell spirit shroud|TCE}"
            ],
            [
              "7th",
              "{@spell Yeti's chilling gaze|TACS}, {@spell ice storm|PHB}"
            ],
            [
              "9th",
              "{@spell creeping cold|TACS}, {@spell cone of cold|PHB}"
            ]
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Frigid Form",
      "entries": [
        "At 2nd level, you gain the ability to channel your icy magic into a shiny elemental form. As a bonus action, you can expend a use of your Wild Shape feature to cover your body with freezing ice, rather than transforming into a beast form, and you gain 4 temporary hit points for each level you have in this class. While this feature is active, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You add your Wisdom modifier (a minimum of +1) to the damage you deal with any druid cantrip or spell as additional cold damage.",
            "Your melee weapon attacks deal an extra {@dice 1d6} cold damage to any target they hit.",
            "You have resistance to cold damage."
          ]
        },
        "These benefits last for 10 minutes, until you lose all these temporary hit points, or until you use your Wild Shape again."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Frozen Affinity",
      "entries": [
        "Also at 2nd level, you are acclimated to cold temperatures and frozen terrain. You do not incur penalties from extreme cold. You also do not suffer from difficult terrain imposed by ice or snow."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Frozen Fortification",
      "entries": [
        "Starting at 6th level, when you transform your body temperature drops to freezing cold temperatures, making you more resilient against ailments. You gain the following benefits while your Frigid Form is active:",
        {
          "type": "list",
          "items": [
            "You have advantage on Constitution saving throws.",
            "When you enter this form, you end any diseases you are afflicted with."
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Frozen Beast Form",
      "entries": [
        "At 10th level, after you use your wild shape feature to transform into your Wild Beast form, as part of that bonus action you can immediately assume your Frigid Form simultaneously with your Wild Beast form. When you enter your Frigid Form in this way, you only gain 1 temporary hit point for each level you have in this class. At 16th level, the temporary hit points gained increases to 2 per level you have in this class."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Archdruid of The Frozen Wastes",
      "entries": [
        "At 14th level, you’ve obtained mastery over the elements of the frozen wastes. You have resistance to cold damage in your normal form and immunity to cold damage while in Frigid Form. Also, you add the {@spell wall of ice} and {@spell otiluke's freezing sphere} spells to your druid spell list and can prepare them as you would any other druid spell.",
        "In addition, when you activate your Frigid Form, or as a bonus action on subsequent turns, you can unleash a powerful burst of icy wind. Each creature in a 20-foot cone originating from you makes a Constitution saving throw using your Spell Save DC or takes {@dice 3d8} cold damage and their movement speed is reduced by 10 feet on a failed save. On a success they take half as much damage and their speed is not reduced. The speed reduction lasts until the start of your next turn. You can use this blast a number of times equal to your proficiency bonus, regaining all expended uses on a long rest."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Frozen Wastes",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2
    },
    {
      "name": "Circle of The Dragonkin",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Dragonkin",
      "level": 2,
      "header": 1,
      "entries": [
        "Some druid circles follow and worship dragons as they can command the forces of nature themselves. Some druids among these circles are blessed by these dragons in exchange for their servitude.",
        "Other druids are direct kin to these dragons, giving them the ability to take their shape for moments at a time, with the most powerful of these druids earning the title of \"true dragons\".",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Dragonkin|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Dragonkin|Druid|TACS|Dragonkin|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Shape of the Dragonkin|Druid|TACS|Dragonkin|TACS|2"
        }
      ],
      "page": null
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Dragonkin",
      "page": null,
      "level": 2,
      "header": 2,
      "entries": [
        "Your direct link to the overwhelming magical power of dragons allows you to gain access to some of their own spells when you reach certain levels in this class, as shown on the Circle of Dragons Spells table.",
        "Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Circle Spells",
          "colLabels": [
            "Druid Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "2nd",
              "{@spell cause fear|XGE}, {@spell chromatic orb}"
            ],
            [
              "3rd",
              "{@spell alter self}, {@spell dragon's breath|XGE}"
            ],
            [
              "5th",
              "{@spell fear}, {@spell fly}"
            ],
            [
              "7th",
              "{@spell arcane eye}, {@spell compulsion}"
            ],
            [
              "9th",
              "{@spell contact other plane}, {@spell dominate person}"
            ]
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Dragonkin",
      "entries": [
        "Starting at 2nd level, you learn to speak, read, and write Draconic or one other language of your choice. In addition, you’ve grown up around dragons, inheriting some of their magic. Choose chromatic, gem, or metallic. You can then choose one damage type that is associated with your chosen dragonkin. The damage type you choose is used by features you gain later.",
        "In addition, if you chose the Nature's Companion gift option from your Bond of the Wilderness feature, your companion can have the dragon creature type and take the shape of a lesser dragon, typically in the form of a drake or a young wyvern. Everything else about the companion's statblock remains the same.",
        {
          "type": "table",
          "caption": "Dragonkin Table",
          "colLabels": [
            "Dragon",
            "Damage Type"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "Chromatic",
              "acid, cold, fire, lightning, or poison"
            ],
            [
              "Gem",
              "force, necrotic, psychic, radiant, thunder"
            ],
            [
              "Metallic",
              "acid, cold, fire, lightning"
            ]
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Shape of the Dragonkin",
      "entries": [
        "Also at 2nd level, you can assume the form of a minor dragon. As a bonus action, by expending a use of your wildshape you can assume this form instead of a beast shape. You gain 5 temporary hit points for each level you have in this class. When you assume this shape, You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Equipment that merges with the form has no effect until you leave the form. While this feature is active, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            {
              "type": "entries",
              "name": "Natural Weapons",
              "entries": [
                "You have a natural weapon in the form of a bite, claw, or tail (you choose when you make the attack). It counts as a simple melee weapon for you, and you add your Strength or Dexterity for the bonus to attack and damage rolls made with these natural weapons, as normal. On hit, these natural weapons deal {@dice 1d8} bludgeoning, piercing, or slashing damage (you choose when you make the attacks)."
              ]
            },
            {
              "type": "entries",
              "name": "Natural Defense",
              "entries": [
                "You have a thick scaley hide that protects you from harm. Your AC equals 13 + Wisdom modifier. In addition, you have resistance to the damage type associated with your Dragonkin feature."
              ]
            },
            {
              "type": "entries",
              "name": "Dragon Form",
              "entries": [
                "Your shape changes to resemble that of a dragon. You determine the specifics of your appearance, so long as it fits within the parameters of a typical medium sized dragon or dragon-like beast. Your creature type becomes dragon and if you are smaller than medium, you become medium."
              ]
            }
          ]
        },
        "You follow the same restrictions as you do for your wild shape for the purposes of spellcasting, however you can still speak while in this form. These benefits last for 10 minutes, until you lose all these temporary hit points, or until you use your Wild Shape again."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Breath of the Dragonkin",
      "entries": [
        "Starting at 6th level, you can channel the draconic energies within and exhale it into a powerful magical burst. ",
        "While your shape of the dragonkin is active, by expending a spell slot of any level you can use an action to make an exhalation of draconic energy in either a 20-foot cone or a 30-foot line that is 5 feet wide (your choice). Each creature in that area must make a Dexterity saving throw against your spell save DC. They take {@dice 2d8} damage of the type associated with your dragonkin per level of the expended spell slot on a failed save, or half as much on a success.",
        "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. While you have no uses available, you can expend a use of your wild shape to use this feature again."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Young Dragonkin",
      "entries": [
        "Also at 6th level, your connection to draconic magic grows more powerful, granting you new abilities. While your shape of the dragonkin is active, you gain the following benefits: ",
        {
          "type": "list",
          "items": [
            "If you are smaller than large, you become large. If you lack the room to become Large, your size doesn't change.",
            "Your natural weapons count as magical for the purposes of overcoming non-magical resistances. In addition, you can attack twice with your natural weapons when you take the attack action instead of once.",
            "Your walking speed increases by 10 feet and you gain either a swim speed or a climb speed equal to your walking speed (you choose when you assume this form)."
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Adult Dragonkin",
      "entries": [
        "Starting at 10th level, your growth as a dragonkin advances to a more adulterated state, granting you even greater power. While your shape of the dragonkin is active, you gain the following benefits: ",
        {
          "type": "list",
          "items": [
            "If you are smaller than huge, you become huge. If you lack the room to become Huge, your size changes to large, unless you lack the room to become large, then your size doesn’t change.",
            "When you deal damage with your natural weapons, you add an additional 1d8 damage of the type associated with your dragonkin.",
            "You gain a magical flying speed equal to twice your walking speed. You can choose whether or not you grow wings when you assume this form."
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Ancient Dragonkin",
      "entries": [
        "At 14th level, you’ve advanced to the highest stage you can inherit from your dragonkin. While your shape of the dragonkin is active, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You add your Wisdom modifier to the damage rolls of your natural weapons and your breath of the dragonkin.",
            "The bonus damage you add from your adult dragonkin feature increases to {@dice 2d8}.",
            "As a bonus action, you can spend a number of hit dice up to your proficiency bonus. Roll the spent hit dice and add your Constitution modifier, you gain a number of temporary hit points equal to the result. These temporary hit points replace any you gained from your shape of the dragonkin feature, but count towards maintaining it.",
            "You have immunity to the damage type associated with your dragonkin."
          ]
        },
        "In addition, you can now maintain your shape of the dragonkin feature for up to a number of hours equal to the amount you can for your wild shape feature. You still lose the form if you lose all of the temporary hit points gained from that feature or this one."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Dragonkin",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2
    },
    {
      "name": "Circle of Remedies",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Remedies",
      "page": null,
      "level": 2,
      "entries": [
        "Nature provides natural forms of remedies for poisons, disease, illness, and wounds. Druids a part of this circle are particularly skilled in taking these natural remedies and magically enhancing them, dedicating their lives to preserving the lives of their circle and the lives of the creatures of their terrain.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Circle Spells|Druid|TACS|Remedies|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Natural Herbalist|Druid|TACS|Remedies|TACS|2"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Remedies of The Wild|Druid|TACS|Remedies|TACS|2"
        }
      ]
    },
    {
      "name": "Circle Spells",
      "source": "TACS",
      "className": "Druid",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Remedies",
      "page": null,
      "level": 2,
      "header": 2,
      "entries": [
        "Many druids form a connection to nature, but few to this level. Your connection to the natural world grants you access to some spells when you reach certain levels in this class, as shown on the Circle of Remedies Spells table.",
        "Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.",
        {
          "type": "table",
          "caption": "Circle of Remedies Spells",
          "colLabels": [
            "Druid Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "2nd",
              "{@spell goodberry}, {@spell sleep}"
            ],
            [
              "3rd",
              "{@spell aid}, {@spell calm emotions}"
            ],
            [
              "5th",
              "{@spell speak with plants}, {@spell mass healing word}"
            ],
            [
              "7th",
              "{@spell aura of purity}, {@spell ward of vitality|TACS}"
            ],
            [
              "9th",
              "{@spell commune with nature}, {@spell greater restoration}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Natural Herbalist",
      "entries": [
        "Starting at 2nd level, your proficiency bonus is doubled when you make an ability check using a herbalism kit. In addition, you gain proficiency in Nature and Survival and your proficiency bonus is doubled when making an ability check using those skills.",
        "In addition, you are an expert at brewing potions of healing. The cost and time required for you to craft potions of healing is halved."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "name": "Remedies of The Wild",
      "entries": [
        "Also at 2nd level, by performing a 10 minute ritual you can magically create special herbs that can be used as medical remedies. You create a number of these remedies equal to your proficiency bonus, choosing from the following remedies for each one:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Remedy of Wound Closure",
              "entries": [
                "A creature may use a bonus action to quickly chew on this remedy, igniting regenerative properties. They magically regain 1d6 plus your Wisdom modifier hit points and any scars, magical or non-magical, are removed. This healing has no effect on undead or constructs and has no effects on unconscious creatures."
              ]
            },
            {
              "type": "entries",
              "name": "Remedy of Curing",
              "entries": [
                "A creature may use a bonus action to consume this remedy, removing any poisons or diseases afflicting them."
              ]
            },
            {
              "type": "entries",
              "name": "Remedy of Revitalization",
              "entries": [
                "A creature may use an action to break this remedy and release a magical vapor which rejuvenates an {@condition unconscious} creature. An {@condition unconscious} creature that is not at 0 hit points becomes awake and conscious again, unless they are cursed to be {@condition unconscious}. A creature at 0 hit points and is {@condition unconscious} regains 1 hit point and regains consciousness, instantly coming to their feet with a burst of energy."
              ]
            }
          ]
        },
        "A creature may also use an action to apply these remedies to another creature.",
        "Once you create these magical remedies, they last for 24 hours until they lose their potency and you cannot create them again until you finish a short or long rest. The first time you use this feature after each long rest, you can create these magical remedies without expending a spell slot. All other times you expend a spell slot of 1st-level or higher."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 2,
      "header": 2
    },
    {
      "name": "Additional Remedies",
      "entries": [
        "At 6th level, the list of remedies you can create expands as your knowledge of remedies increases:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Remedy of Restoration",
              "entries": [
                "A creature can use an action to apply this remedy to themselves or another creature, allowing them to remove one condition listed in the {@spell lesser restoration} spell."
              ]
            },
            {
              "type": "entries",
              "name": "Remedy of Heightened Senses",
              "entries": [
                "A creature can use a bonus action to apply this remedy on their eyes and ears. The creature has advantage on Wisdom (Perception) checks and gains the benefits of the {@spell see invisibility} spell for 1 hour. After the hour has passed, the creature becomes blinded and deafened for 1 minute as pain swells up in their eyes and ears suffering the drawback of the remedy."
              ]
            }
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2
    },
    {
      "name": "Nature's Guardian",
      "entries": [
        "Also at 6th level, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to have yourself, or a creature you can see within 30 feet of you regain {@dice 1d6} hit points per level of the spell slot expended. Regardless of how many dice you roll, you add your Wisdom modifier to the total amount of hit points restored.",
        "In addition, as a bonus action while in your Wild Shape form or your normal form, you can gain a restorative aura that heals your allies that extends out to a 10-foot radius which lasts for 1 minute. Each creature you choose (other than yourself) that starts its turn in the aura, or enters it for the first time on its turn, regains a number of hit points equal to your proficiency bonus.",
        "A creature can recover hit points from this aura a number of times equal to your proficiency bonus, regaining the ability to heal from it again when they finish a long rest.",
        "Once you create this aura, you cannot do so again until you finish a long rest unless you expend a 3rd-level or higher spell slot to regain a use of the aura."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2
    },
    {
      "name": "Additional Remedies",
      "entries": [
        "At 10th level, the list of remedies you can create expands as your knowledge of remedies increases:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Remedy of Adrenaline",
              "entries": [
                "A creature can use a bonus action to inhale this remedy, granting them a boost in motor functions. They gain the benefits of the {@spell haste} spell for a number of rounds equal to your proficiency bonus. They suffer from the lethargy the haste spell gives after the benefits ends."
              ]
            },
            {
              "type": "entries",
              "name": "Remedy of Stone Melting",
              "entries": [
                "A creature can use an action to apply this remedy onto a {@condition petrified} creature. At the end of the {@condition petrified} creature’s next turn, they are no longer {@condition petrified}."
              ]
            }
          ]
        }
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2
    },
    {
      "name": "Champion of Nature",
      "entries": [
        "At 14th level, you’ve achieved the peak of your magical abilities. There is no longer a limit to how many times a creature can heal from your aura created by your Nature's Guardian feature and the aura becomes a 20-foot radius. In addition, you also regain hit points at the start of your turns while your aura is active.",
        "Also, when you restore hit points to a creature using a spell of 1st-level or higher, or when they would restore hit points from one of your remedies, they regain an additional amount of hit points equal to your proficiency bonus."
      ],
      "source": "TACS",
      "page": null,
      "className": "Druid",
      "classSource": "TACS",
      "subclassShortName": "Remedies",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2
    }
  ],
  "monster": [
    {
      "name": "Nature Companion",
      "source": "TACS",
      "summonedByClass": "Druid|TACS",
      "size": [
        "S"
      ],
      "type": "beast",
      "alignment": [
        "U"
      ],
      "ac": [
        {
          "special": "11 + PB (natural armor)"
        }
      ],
      "hp": {
        "special": "5 + five times your druid level (the beast has a number of Hit Dice [d8s] equal to your druid level)"
      },
      "speed": {
        "walk": 30
      },
      "str": 14,
      "dex": 14,
      "con": 16,
      "int": 8,
      "wis": 14,
      "cha": 11,
      "skill": {
        "athletics": "+2 + PB",
        "perception": "+2 + PB"
      },
      "senses": [
        "darkvision 30 ft."
      ],
      "passive": 12,
      "languages": [
        "understands the languages you know",
        "but can't speak"
      ],
      "pbNote": "equals your bonus",
      "trait": [
        {
          "name": "Variable Trait",
          "entries": [
            "When summoning this creature, choose one of the following traits to have.",
            {
              "type": "entries",
              "name": "Land Beast",
              "entries": [
                "The beast has advantage on an attack roll against a creature if at least one of the beast's allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}. It also has advantage on Wisdom (Perception) checks that rely on hearing or smell."
              ]
            },
            {
              "type": "entries",
              "name": "Aquatic Beast",
              "entries": [
                "The beast can breathe air and water. It also has a swim speed equal to twice its walking speed."
              ]
            },
            {
              "type": "entries",
              "name": "Sky Beast",
              "entries": [
                "The beast has a flying speed equal to twice its walking speed and doesn't provoke opportunity attacks when it flies out of an enemy's reach."
              ]
            },
            {
              "type": "entries",
              "name": "Arachnid Beast",
              "entries": [
                "The beast has a climbing speed equal to its walking speed, can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check and ignores movement restrictions caused by webbing. Also, while in contact with a web, the beast knows the exact location of any other creature in contact with the same web."
              ]
            },
            {
              "type": "entries",
              "name": "Snake Beast",
              "entries": [
                "The beast has a {@sense blindsight} out to a range of 10 feet and a swim speed equal to its walking speed."
              ]
            }
          ]
        }
      ],
      "action": [
        {
          "name": "Maul",
          "entries": [
            "{@atk mw} {@hitYourSpellAttack} to hit, reach 5 ft., one target. {@h}{@damage 1d8 + 2 + PB} slashing damage."
          ]
        },
        {
          "name": "Web (Arachnid Beast Trait Only)",
          "entries": [
            "{@atk rw} {@hitYourSpellAttack} to hit, range 30/60 ft., one target. {@h} The target is {@condition restrained} by webbing. As an action, the {@condition restrained} target can make a Strength check against your spell save DC, bursting the webbing on a success. The webbing can also be attacked and destroyed (AC 10; hp 5; vulnerability to fire damage; immunity to bludgeoning, poison, and psychic damage)."
          ]
        },
        {
          "name": "Venomous Bite (Snake Beast Trait Only)",
          "entries": [
            "{@atk mw} {@hitYourSpellAttack} to hit, reach 5 ft., one target. {@h} {@damage 1d4 + 2 + PB} piercing damage, plus 3 ({@damage 1d6}) poison damage and must succeed on a Constitution saving throw against your spell save DC or be {@condition poisoned} until the start of your next turn."
          ]
        }
      ],
      "senseTags": [
        "D"
      ],
      "languageTags": [
        "CS"
      ],
      "damageTags": [
        "I",
        "P",
        "S"
      ],
      "miscTags": [
        "MW",
        "RW"
      ],
      "conditionInflict": [
        "restrained"
      ]
    },
    {
      "name": "Wild Beast",
      "source": "TACS",
      "summonedByClass": "Druid|TACS",
      "size": [
        "M"
      ],
      "type": "beast",
      "alignment": [
        "U"
      ],
      "ac": [
        {
          "special": "11 + PB (natural armor)"
        }
      ],
      "hp": {
        "special": "10 + five times your druid level"
      },
      "speed": {
        "walk": 40,
        "climb": 40
      },
      "str": 16,
      "dex": 14,
      "con": 16,
      "int": 8,
      "wis": 14,
      "cha": 11,
      "skill": {
        "athletics": "+3 + PB",
        "perception": "+2 + PB"
      },
      "passive": 12,
      "pbNote": "equals your bonus",
      "trait": [
        {
          "name": "Variable Trait",
          "entries": [
            "When assuming this form, choose one of the following traits to have. Some traits are only available at later levels. When you reach 4th level, you can choose an additional trait, and you can choose one additional one when you reach 8th level.",
            {
              "type": "options",
              "entries": [
                {
                  "type": "entries",
                  "name": "Pack Tactics",
                  "entries": [
                    "The beast has advantage on an attack roll against a creature if at least one of the beast's allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}."
                  ]
                },
                {
                  "type": "entries",
                  "name": "Keen Senses",
                  "entries": [
                    "The beast has advantage on Wisdom (Perception) checks that rely on hearing or smell."
                  ]
                },
                {
                  "type": "entries",
                  "name": "Charge",
                  "entries": [
                    "If the beast moves at least 20 feet straight toward a target and then hits it with a maul attack on the same turn, the target takes an extra 7 ({@damage 2d6}) damage. If the target is a creature, it must succeed on a Strength saving throw against your spell save DC or be knocked {@condition prone}."
                  ]
                },
                {
                  "type": "entries",
                  "name": "Amphibious (4th level or higher)",
                  "entries": [
                    "The beast can breathe air and water."
                  ]
                },
                {
                  "type": "entries",
                  "name": "Spider Walk (4th level or higher)",
                  "entries": [
                    "The beast can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check and ignores movement restrictions caused by webbing.."
                  ]
                },
                {
                  "type": "entries",
                  "name": "Flyby (8th level or higher)",
                  "entries": [
                    "The beast doesn't provoke opportunity attacks when it flies out of an enemy's reach."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "action": [
        {
          "name": "Maul",
          "entries": [
            "{@atk mw} {@hitYourSpellAttack} to hit, reach 5 ft., one target. {@h}{@damage 1d8 + 3 + PB} slashing damage."
          ]
        },
        {
          "name": "Multiattack (8th level or higher)",
          "entries": [
            "The Wild Beast makes two attacks using its Maul."
          ]
        }
      ],
      "actionTags": [
        "Multiattack"
      ],
      "damageTags": [
        "S"
      ],
      "miscTags": [
        "MW"
      ],
      "conditionInflict": [
        "prone"
      ]
    }
  ],
  "spell": [
    {
      "name": "Air Promenade",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform elegant and rhythmic movements to allow yourself to dance through the air effortlessly as powerful winds lift you off the ground. For the duration, you have a flying speed equal to your walking speed and can hover, but you cannot ascend any higher than 10 feet off the ground. ",
        "When the spell ends, you safely descend to the ground, provided you are no higher than 20 feet. If you are higher than 20 feet when the spell ends, you fall at a normal rate."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 4th level or higher, the duration is 8 hours. If you use a spell slot of 6th level or higher, the duration is 24 hours. Using a spell slot of 4th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Aquarius's Veil",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A gilded gemstone worth 500 gp filled with ocean water",
          "cost": 50000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You don yourself with a veil of watery armor. Until the spell ends, you have the following benefits:",
        {
          "type": "list",
          "items": [
            "You have immunity to fire damage and resistance to cold damage.",
            "You have a swim speed of 80 feet and can breathe underwater as you do air.",
            "While you're not wearing armor, your armor class becomes 14 + your Dexterity modifier and you have advantage on Strength and Dexterity saving throws.",
            "You have advantage on attack rolls made with daggers, javelins, shortswords, spears, or tridents and you can use your spellcasting ability for the attack and damage rolls made with such weapons in place of Strength or Dexterity.",
            "You gain 60 temporary hit points. If any of these remain when the spell ends, they are lost."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Fiery Earth",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and fire, syncing together in a perfect harmony. Until the spell ends, the target is wreathed in magical flames that retaliate against creatures that hit them with melee attacks, dealing {@damage 1d8} fire damage to the attacker.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of earth and the elemental plane of fire. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} fire or poison damage.",
        "Also, whenever a creature under the effects of this spell heals a creature with a spell, they can add {@dice 1d8} healing to one of the rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire",
        "poison"
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Flowing Life",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and water, syncing together in a perfect harmony. Until the spell ends, the target has a swim and climb speed of 60 feet and do not suffer penalties to their speed while traversing through difficult terrain.",
        "In addition, the target can empower their ability to heal immensely by channeling both of the primordial energies of the elemental plane of earth and the elemental plane of water. Whenever they heal a creature with a spell, they can add an additional {@dice 2d8} healing to one of the rolls from the spell.",
        "In addition, when they heal a creature with a spell, they can remove any one condition or disease, or they can remove one level of {@condition exhaustion}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Storms",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of air and water, syncing together in a perfect harmony. Until the spell ends, the target has a flying speed of 60 feet and can hover.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of air and the elemental plane of water. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} lightning or thunder damage and creatures who take this damage are pushed up to 10 feet away from the attacker or source of the spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "lightning",
        "thunder"
      ],
      "miscTags": [
        "FMV"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Blade of Frost",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "sphere",
        "distance": {
          "type": "feet",
          "amount": 5
        }
      },
      "components": {
        "s": true,
        "m": "a melee weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You brandish the weapon used in the spell's casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack's normal effects and then ice begins to creep from the point of impact. The target's speed is reduced by 10 feet until the start of your next turn.",
        "This spell's damage increases when you reach certain levels. At 5th level, the melee attack deals an extra {@damage 1d8} cold damage to the target on a hit. The extra damage increases by {@dice 1d8} at 11th level ({@dice 2d8}) and again at 17th level ({@dice 3d8})."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Blustering Winds",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You extend your hands and gales of wind blows around you in a 10 foot radius centered on you. Creatures within range make a strength saving throw. On a failed save, the creature takes {@damage 1d10} bludgeoning damage and is pushed 10 feet back and knocked {@condition prone}. On a success, they take half damage and suffers no additional effects."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Boulder Bash",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a giant rock and throw it in a 5-foot-wide 30-foot-long line. Each creature within range must make a Dexterity saving throw, taking {@damage 3d10} bludgeoning damage and is knocked {@condition prone} on a failed save or half as much on a success and is not knocked {@condition prone}. When the rock reaches the end of its range, or if it hits a wall, the rock vanishes. If it hits a wall, the wall automatically takes damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd"
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Burning Touch",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You ignite your hands with red hot flames and attempt to burn a creature. Make a melee spell attack, on hit it takes {@damage 2d8} fire damage and must make a Constitution saving throw. On a failed save, they are caught on fire and takes an additional {@damage 1d8} fire damage at the start of each of their turns for the duration. A creature can use its action to put out the flames, or at the end of each of the affected creature's turn it can repeat its Constitution save, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "spellAttack": [
        "M"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Charity",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You touch a creature and imbue them with a small pool of your magical power, which can restore them in two different ways. If the target is a spellcaster, you can have it regain one of its expended spell slots of 2nd level or lower. If the target is not a spellcaster, or if it chooses not to regain a spell slot, it instead regains a number of hit points equal to {@dice 4d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the maximum expended slot level that can be regained increases by 1 and the healing increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Chilling Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The next time you hit with a melee weapon attack during this spell's duration, your weapon is freezing cold to the touch, and the attack deals an extra {@damage 1d8} cold damage. If the target is a creature, at the start of its next turn it must succeed a Constitution saving throw or have their movement speed cut in half until the spell ends. The creature may repeat its save at the start of each of its turns until the spell ends, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cold Snap",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You snap your fingers and a burst of cold energy cracks at a point you choose within range. Each creature in a 15-foot-radius sphere centered on that point must make a Constitution saving throw. A target takes {@damage 6d6} cold damage and their movement is reduced to 0 until the start of your next turn on a failed save, or half as much damage on a successful one and their speed is not reduced.",
        "The cold vapors spread around corners. It freezes non-magical objects and liquid in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@damage 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Contact Ancient Spirits",
      "source": "TACS",
      "level": 3,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny statue made of gold or silver worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "You reach out to the great beyond to call upon the wisdom of ancient souls of long dead scholars. Three tiny sized spirits which take the forms of balls of light float around you within range of the spell. You can ask each of the spirits a single question, which they must answer truthfully. After a spirit has answered your question, it disappears. You must ask your questions before the spell ends.",
        "Each spirit has a +10 to any Intelligence ability check, though depending on the question, a check may or may not be required (DM's choice). If a check is required, the DM determines the DC based on the rarity of the answer, the rarest resulting in a DC 30, whereas an uncommon answer results in a DC 15. The spirit takes the form of a creature who may know the answer to your question when it is asked. The creature does not have to be humanoid. A failed check results in the spirit being unable to answer the question, and disappears out of embarrassment or prideful arrogance.",
        "The spell fails if you have cast it within the last 24 hours."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Counterspell",
      "source": "TACS",
      "otherSources": [
        {
          "source": "PHB",
          "page": 228
        }
      ],
      "level": 3,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a creature within 60 feet of you casting a spell and you are not casting a spell."
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You attempt to interrupt a creature in the process of casting a spell. Make an ability check using your spellcasting ability and add your proficiency bonus to the roll. The DC equals the caster’s spell save DC. On a success, its spell fails and has no effect.",
        "On a failure, their spell succeeds but its effects are dampened as your spell acts as a buffer for its effects. The spell’s damage, healing, range, and duration is halved. If there was nothing to halve, this spell simply has no effect. If your check fails by 5 or more, this spell also has no effect.",
        "An astute caster can recognize when their spell is about to fail and attempt to reinforce it with their own magic. A creature with proficiency in arcana can use their reaction to add to the DC equal to the level they are casting their own spell at."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, you can add a +1 bonus to  your spellcasting ability check used for the spell for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ],
        "fromSubclass": [
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption (UA)",
              "source": "UAATrioOfSubclasses"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption",
              "source": "XGE"
            }
          },
          {
            "class": {
              "name": "Sorcerer",
              "source": "PHB"
            },
            "subclass": {
              "name": "Clockwork Soul (UA)",
              "source": "UA2020SubclassesPt2"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers (UA)",
              "source": "UA2020SubclassesPt1"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers",
              "source": "TCE"
            }
          }
        ]
      },
      "races": [
        {
          "name": "Human (Mark of Sentinel)",
          "source": "ERLW",
          "baseName": "Human",
          "baseSource": "PHB"
        }
      ],
      "backgrounds": [
        {
          "name": "Azorius Functionary",
          "source": "GGR"
        }
      ]
    },
    {
      "name": "Creeping Cold",
      "source": "TACS",
      "level": 5,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pinch of powdered snow"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You choose a creature within range that you can see and mark them with a freezing cold brand. Ice begins to slowly creep from the ground beneath their feet to the tip of their head, covering the body with ice. The creature must make a Constitution saving throw. On a failed save, they take {@damage 6d6} cold damage and is {@condition restrained} as they are frozen to the ground. If the creature is airborne, a pillar of ice is made between the creature and the ground. The ice occupies the spaces in between it and the ground and the creature's elevation remains the same. The spell fails if the creature is more than 30 feet off the ground. On a successful save, the creature takes half damage and isn't affected. A creature is also unaffected by the spell if it has immunity to cold damage or being {@condition petrified} and a creature with resistance to cold damage has advantage on its saves against the spell.",
        "A creature affected by the spell must make another Constitution saving throw at the end of each of its turns. On a failed save, it takes an additional {@damage 2d6} cold damage or half as much on a success. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to a frozen statue and subjected to the {@condition petrified} condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.",
        "A creature may use its action to break off a piece of the ice. Doing so counts as one successful save for the purposes of the spell. Every time the creature takes any amount of piercing or fire damage counts as one successful save."
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cutting Wind",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "Magical winds build up in your hands and launch out to a creature within range. Make a ranged spell attack. On hit, the target takes {@damage 1d6} slashing damage and are left scarred with magic. Until the start of your next turn, the next weapon attack that hits the target deals an additional {@damage 1d6} damage of the weapon's type.",
        "This spell's damage increases when you reach certain levels. At 5th level, the attack's damage increases by {@damage 1d6} ({@dice 2d6}). Both damage rolls increase by {@dice 1d6} at 11th level ({@dice 3d6} and {@dice 2d6}) and the attack again increases by {@dice 1d6} at 17th level ({@dice 4d6} and {@dice 2d6})."
      ],
      "damageInflict": [
        "slashing"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cyclone",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You summon a brief powerful windstorm to launch your enemies into the air. Choose a point within range, you summon a swirling windstorm in a 20-foot tall 20-foot radius cylinder. Every creature within the cylinder makes a Strength saving throw. On a failed save, they take {@damage 6d6} bludgeoning damage and are pulled to the top of the cylinder toward the center, falling to the ground afterward. On a success they take half as much and are not pulled."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Destruct Riff",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A musical instrument worth at least 1 sp"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You play a quick and powerful musical performance. Make a ranged spell attack against a creature or object to assail it with the rupturing power of song. On a hit, the target takes {@damage 1d8} thunder damage and are pushed 5 feet away from you.",
        "If you hit a construct target, it also has disadvantage on attack rolls against you until the end of your next turn.",
        "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), and 17th level ({@dice 4d8})."
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "FMV"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine Avatar",
      "source": "TACS",
      "level": 12,
      "school": "T",
      "subschools": [
        "epic spell"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A crystal or gem containing the soul of a dead god worth at least 100,000 gp"
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You assume the form of a god of your choosing. You become an avatar of said god, using an appropriate statblock. If one is not otherwise provided, you use the Divine Avatar statblock and if you do, choose from one of the listed domains: Arcana, Death, Forge, Grave, Knowledge, Life, Light, Nature, Order, Peace, Tempest, Trickery, Twilight, or War. You gain certain statistics depending on the domain you chose.",
        "You maintain this form for the duration, until your hit points is reduced to 0 in that form, or until you dismiss the spell as an action. Becoming even the avatar of a god, even for a moment, is a taxing endeavor. You gain three levels of {@condition exhaustion}, which cannot be recovered until you complete a long rest for each individual {@condition exhaustion} level. In addition, you lose the ability to cast spells until you finish a long rest."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Fiery Chains",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You launch outward a chain of fire that wraps around a target of your choice that you can see within range. Three additional chains then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the chains.",
        "A target must make a Dexterity saving throw. The target takes {@damage 6d6} fire damage and is {@condition restrained} on a failed save, or half as much damage and is not {@condition restrained} on a success.",
        "A {@condition restrained} creature takes {@damage 2d6} fire damage at the start of its turns and can use its action to attempt to break out of the chains by making a successful Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, one additional chain leaps from the first target to another target for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Flames of Life or Death",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "A wave of fiery energy washes out from a point centered on yourself. Choose either life or death. You can expend one of your Hit Dice and make three rolls using the size of the chosen Hit Die. You take damage equal to the total number rolled as burns envelop your body and your constitution is used to fuel the spell. You then apply one of the following effects depending on what you chose:",
        "{@b Death.} Every other creature in that area needs to make a Dexterity saving throw, taking fire damage equal to the total number rolled plus your spellcasting ability modifier on a failed save, or half as much on a success.",
        "{@b Life.} Every other creature you choose in that area regains hit points equal to the total number rolled plus your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, the number of dice rolled increases by one for each slot level above 6th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Encore",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a spell being cast"
        }
      ],
      "range": {
        "type": "special"
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "special"
        }
      ],
      "entries": [
        "When you see a 2nd level or lower spell being cast, you can immediately use your reaction to cast that spell, using its range and duration for this spell's. If you do not meet the requirements of the spell, such as having costly material components or a specific prerequisite listed in the spell, the spell fails. The spell also fails if the casting time is not an action or bonus action.",
        "When you cast that spell in this way, it is cast at its lowest level, but uses your spellcasting ability for it."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the level of spell you can encore can be one level higher for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fairy Fun",
      "source": "TACS",
      "level": 1,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You summon forth the mischief of the fey and implore various pranks and tricks onto a creature, causing them one of varying effects. Choose a creature that you can see within range, they suffer one of the following effects of your choosing for the duration, or until you end the spell as a bonus action.",
        {
          "type": "entries",
          "name": "Hallucinations",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, they have disadvantage on {@skill Perception} checks that rely on sight, as colorful and misty visions of various fey creatures cloud their vision. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Tumbling Fool",
          "entries": [
            "The target makes a Dexterity saving throw. On a failed save, they have disadvantage on Dexterity-based attack rolls and Dexterity ability checks, as they begin to tumble and fool around. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Babble of Doom",
          "entries": [
            "The target makes a Charisma saving throw. On a failed save, they have disadvantage on Charisma ability checks as they begin to babbling over their words like a fool. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Forgetful Idiot",
          "entries": [
            "The target makes an Intelligence saving throw. On a failed save, they struggle to recall specific details on anything, such as a name, yet they always have that feeling of familiarity as if the information is constantly on the tip of their tongue. They have disadvantage on Intelligence ability checks. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Beware the Bear",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, everyone in their vision appears as a giant, terrifying bear that fills them with a magical fear. The target is {@condition frightened} for the duration. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Why is it Always Chickens?!",
          "entries": [
            "The target makes a Strength saving throw. On a failed save, countless chickens flock from out of nowhere and bombard the target, causing them to fall {@condition prone}. This effect repeats at the end of each of the target's turns, until they succeed against it three times, ending the effect."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fey Transformation",
      "source": "TACS",
      "level": 3,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a gilded flower from the feywild worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with an iridescent aura that allows you to take the visage of a creature from the feywild. When you cast the spell, you choose one of the following forms to assume: Fuming, Mirthful, or Tricksy.",
        {
          "type": "entries",
          "name": "Fuming",
          "entries": [
            "Your iridescent aura becomes a fiery aura which empowers you with the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "Your weapon and spell attacks deal an additional {@damage 1d6} fire damage on hit.",
            "You emit bright light out to a range of 30 feet and dim light for an additional 30 feet.",
            "Creatures that hit you with melee attacks take {@damage 1d6} fire damage."
          ]
        },
        {
          "type": "entries",
          "name": "Mirthful",
          "entries": [
            "Your iridescent aura becomes a shimmering sparkle that makes you more appealing, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You have advantage on Charisma ({@skill Persuasion}) checks.",
            "Creatures you choose that can hear you speak must make a Wisdom saving throw or become {@condition charmed} by you until the spell ends, or until you or your allies do something hostile toward them after they were {@condition charmed}.",
            "You have advantage on Charisma saving throws and are immune to being {@condition charmed}."
          ]
        },
        {
          "type": "entries",
          "name": "Tricksy",
          "entries": [
            "Your iridescent aura becomes a shadowy veil, protecting you from sight, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You become {@condition invisible} until the spell ends, or until you make an attack or cast a spell. At the start of each of your turns, you become {@condition invisible} again if you weren't already.",
            "You have advantage on Dexterity and Intelligence saving throws.",
            "If you make an attack roll with advantage, you deal an additional {@damage 1d6} psychic damage on hit."
          ]
        },
        "As a bonus action on your turn, you can shift your form to a different one, losing the previous benefits and gaining the new ones until the spell ends. Doing so halves the current duration of the spell."
      ],
      "conditionInflict": [
        "charmed"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Flames of Avernus",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "cone",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "A wave of heat bursts out of your hands originating from the nine hells, incinerating creatures in a 120-foot cone of fire. Each creature within range makes a Constitution saving throw. On a failed save they take {@damage 20d6} fire damage and are lit on fire for the duration. Creatures who failed take {@damage 5d6} fire damage at the start of each of their turns. As an action, a creature can attempt to put out the flames with a Dexterity ability check against your spell save DC. A creature that attempts this, pass or fail, takes {@damage 2d6} fire damage. On a success, the flames are put out and its effects no longer persist. On a fail, the flames and the spell persists.",
        "On a successful save, the creatures take half the initial damage and are not lit on fire.",
        "A creature who dies while under the effects of the spell has their body immediately turned to scorched ash, leaving behind only any magical items they had in their possession."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Transformation",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A chunk of rare precious metal worth 1000 gp infused with magical moss, which the spell consumes",
          "consumed": true,
          "cost": 100000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You assume a magical form by mimicking the powers of Gaia. Your body becomes stone and moss forms randomly around your body. Choose either Guardian or Warrior. You gain the following benefits depending on what you chose when you cast the spell:",
        {
          "type": "list",
          "items": [
            "You are immune to poison; bludgeoning, piercing, and slashing damage from non-magical weapons that are not adamantine. You have resistance to slashing, piercing, and bludgeoning damage regardless of the source.",
            "You are immune to the {@condition poisoned} and {@condition petrified} conditions.",
            "Your size becomes one size category larger. If you were gargantuan, you become twice as large. As a result, you deal twice as much damage with weapons against objects.",
            "You have a burrow speed of 40 feet and can move through solid stone effortlessly, leaving the earth untampered with as you pass by.",
            "You have a +2 bonus to AC (Guardian), or you have a +2 bonus to Strength, Dexterity, and Constitution saving throws (Warrior).",
            "All your weapon attacks are magical, and when you make a weapon attack, you can use your spellcasting ability modifier, instead of Strength or Dexterity, for the attack and damage rolls.",
            "You gain 100 temporary hit points (Guardian) or you gain 50 temporary hit points (Warrior). If any of these remain when the spell ends, they are lost.",
            "Your weapon attacks deal an additional {@damage 2d10} bludgeoning damage (Warrior) or when you're not wearing armor, your AC becomes 20. You can still gain the benefits of a shield while under the effects of this spell (Guardian).",
            "(Warrior) You can attack twice, instead of once, when you take the {@action Attack} action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that lets you attack more than once when you take the Attack action on your turn; (Guardian) or you can use your action to form a protective barrier on any number of allies within 30 feet of you, protecting them from damage from one source reducing that damage to 0 (such as a weapon, spell, a dragon's breath weapon, etc.). This barrier lasts until the start of your next turn."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 300
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small chunk of a meteorite"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a large object made of stone which appears 200 feet above the point you choose. The stone can take any shape or appearance, so long as it is purely made of a form of earth. The object crashes directly onto the point you choose and creates. Each creature within a 60-foot radius makes a dexterity saving throw or takes {@damage 40d6} bludgeoning damage from the debris, or half as much on a success. ",
        "Objects in the area automatically take twice as much damage. ",
        "A 60-foot radius and 30-foot deep creator is left in the wake of the object, with the object completely destroyed and gravel fills the area, making it difficult terrain"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gale of The Primordials",
      "source": "TACS",
      "level": 9,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a wing from a powerful creature, such as an angel or winged beast from the elemental plane of air"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "A powerful wind builds up from your feet, granting you unmatched flight. You gain a flying speed of 150 feet for the duration. You take no damage as a result of falling and are immune to being {@condition grappled} or {@condition restrained} as wind rushes from you, preventing anything from keeping hold of you.",
        "Ranged attacks made against you have disadvantage and automatically miss if you are within their long range distance."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Giant's Strength",
      "source": "TACS",
      "level": 2,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a piece of mithral or adamantine worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body, empowering you with the might of giants. If your Strength score is lower than 19, it becomes 19 for the duration. If your strength score is being reduced by any effect, the reduction is still applied."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, your Strength score increases by 2 for every two slot levels above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Glacial Grip",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You release a magical hand made of freezing cold ice toward a creature you can see. Make a ranged spell attack against that creature. On a hit, the hand grasps onto the target and it takes {@damage 1d8} cold damage, and on each of your turns for the duration, you can use a bonus action to deal {@damage 1d8} cold damage to the target automatically, except the turn you cast the spell. Each time the target takes damage from the spell, its speed is reduced by 10 feet. The creature makes a constitution saving throw at the end of each of its turns, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by {@damage 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT",
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guided Hand",
      "source": "TACS",
      "level": 1,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You touch a creature, granting them the ability to strike true. Once before the spell ends, the target can give themself advantage on one weapon attack roll on their turn, as a spectral hand from a comforting source guides their attack. That attack deals an extra {@damage 1d6} radiant or necrotic damage on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Guise of The Blood Witch",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a vile of humanoid blood engraved with arcane sigils worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Uttering an incantation, you draw on the magic of the blood witch to transform yourself. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "You are immune to being {@condition charmed} and have advantage on saving throws against enchantment spells.",
            "Whenever you take damage from a spell or effect originating from yourself, you can choose to not take damage once on each of your turns.",
            "You have a magical flying speed of 30 feet and you can hover.",
            "You gain 30 temporary hit points. If any of these remain when the spell ends, they are lost.",
            "You can use a bonus action on each of your turns to turn your gaze to a creature you can see within 60 feet. That creature makes a wisdom saving throw or takes {@damage 4d6} necrotic damage and is {@condition frightened} until the spell ends. They take half damage and are not {@condition frightened} on a successful save."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guise of the Haunted Fey",
      "source": "TACS",
      "level": 0,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with haunting lights and illusory sounds, making you look and sound like a horrifying fey creature from the Unseelie court. For the duration, you have advantage on Charisma ({@skill Intimidation}) checks."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Heart Sunder",
      "source": "TACS",
      "level": 4,
      "school": "N",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of blood from a humanoid"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You fill a creature you choose within range that you can see with necrotic energy. You cause their heart to beat rapidly and then stop momentarily. The creature makes a constitution saving throw taking {@damage 8d6} necrotic damage and is {@condition stunned} until the start of your next turn on a failed save, or half as much and is not {@condition stunned} on a success. Undead and Constructs automatically pass the saving throw of this spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 and the duration increases by 1 additional round for each slot level above 4th."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "stunned"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Investiture of Water",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Until the spell ends, your body takes a watery appearance, and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to cold; bludgeoning, piercing, and slashing damage from non-magical attacks.",
            "You have a swim speed of 60 feet and can breathe underwater as you do air.",
            "You are always treated as if you were submerged underwater.",
            "You can use your action to create a 10 foot long whip made of water. You can use a bonus action to attack with the whip. When you do, make a melee spell attack with a range of 10 feet. On hit, the water whip deals {@dice 2d4} plus your spellcasting ability modifier bludgeoning damage and the target makes a Strength saving throw. On a failed save, they are knocked {@condition prone}.",
            "You can use your action to control nearby water to snare your enemies. Choose a creature within 30 feet of a pool of water that is within 120 feet of you. That creature must make a Dexterity saving throw or be {@condition restrained}. You can use a bonus action to drag a creature {@condition restrained} in this way 10 feet closer to the pool. Once the creature is close enough, it can be dragged underneath the pool of water. A creature can use an action to repeat its Strength save, ending the {@condition restrained} effect on a success."
          ]
        }
      ],
      "damageResist": [
        "fire"
      ],
      "damageImmune": [
        "cold"
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "N",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Lightning Spear",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "an electrified twig"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You create a bolt of lightning in your hand and throw it at a creature you can see within range. Make a ranged spell attack, on hit you deal {@damage 3d10} lightning damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d10} for each slot level above 2nd. When you cast this spell using a spell slot of 4th level or higher, you can create one additional bolt and throw it at another creature or the same creature, but it only deals {@damage 2d10} lightning damage on hit. When you cast this spell using a spell slot of 7th level or higher, the second bolt increases to {@damage 4d10} damage."
          ]
        }
      ],
      "damageInflict": [
        "lightning"
      ],
      "spellAttack": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      },
      "fluff": {
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://img.game8.co/3498526/93b71a6524daa52afd9d3c4c8136a857.png/show"
            }
          }
        ]
      }
    },
    {
      "name": "Lightning Whip",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You evoke an electrifying whip in your free hand. It is similar in size and shape to an actual whip, and it lasts for the duration. It has the light and reach properties. If you let go of the whip, it disappears, but you can evoke the whip again as a bonus action.",
        "You can use your action to make a melee spell attack with the lightning whip. On a hit, the target takes {@damage 3d4} lightning damage and it must succeed on a Strength saving throw. On a fail, the target is knocked {@condition prone}.",
        "In addition, you can use your bonus action to make a melee spell attack with the lightning whip, however it instead deals {@damage 1d4} lightning damage on hit instead of {@dice 3d4}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d4} for every two slot levels above 2nd."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Metronome",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You point at a creature you can see within range and use rhythmic movements to build up momentum and damage them. The target makes a Dexterity saving throw, taking {@damage 6d6} force damage and is marked by the spell on a failed save, or half as much on a success and are not marked. ",
        "While marked, you can use an action or a bonus action to deal {@damage 2d6} force damage to them, but you can only do so once per round and not on the turn you cast the spell. Each time the target takes this damage, they can repeat their save, ending the effect on a success.",
        "After the first round you cast the spell, if you do not use your action or bonus action to deal damage to the target with this spell, your concentration ends early."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ode of Seasons",
      "source": "TACS",
      "level": 1,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 50 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a magical song that empowers a target within range (you can choose yourself). Choose from Autumn, Winter, Spring, or Summer. The target gains the following benefits depending on what you chose:",
        {
          "name": "Autumn",
          "type": "entries",
          "entries": [
            "The target has advantage on Charisma ability checks."
          ]
        },
        {
          "name": "Winter",
          "type": "entries",
          "entries": [
            "The target has resistance to cold damage."
          ]
        },
        {
          "name": "Spring",
          "type": "entries",
          "entries": [
            "The target has advantage on saving throws made to resist being {@condition charmed} or {@condition frightened}."
          ]
        },
        {
          "name": "Summer",
          "type": "entries",
          "entries": [
            "The target has resistance to fire damage."
          ]
        }
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or 3rd level, you can maintain your concentration on the spell for up to 1 hour. When you use a spell slot of 4th level or higher, you can maintain your concentration on the spell for up to 8 hours."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Poseidon's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 500
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a wave of immeasurable force in a 500-foot-high, 500-foot-long, 100-foot-thick. Every creature and object in the area makes a Strength saving throw. On a failed save, every creature takes {@damage 12d10} bludgeoning damage and {@damage 12d10} cold damage and are knocked {@condition prone} and pushed to the end of the wave. Objects take twice the amount of damage and automatically fail the save. Creatures that save take only half damage and are pushed only half the distance they normally would be pushed and are not knocked {@condition prone}.",
        "Magical and non-magical fire in the area is immediately extinguished and creatures who took the damage from this spell gains resistance to fire damage for the next minute. Spells that set creatures on fire and persist immediately end on affected creatures.",
        "The area affected is not flooded, as the water dissipates after the spell takes effect."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Primordial Mark",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body and weapons you are holding. Choose from acid, cold, fire, lightning, or thunder. Until the spell ends, your weapon attacks deal an extra {@dice 1d4}  damage of the chosen type on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Reveal/Conceal",
      "source": "TACS",
      "level": 2,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pair of glass lenses with drops of spring water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "permanent",
          "ends": [
            "dispel"
          ]
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "For the duration, you can reveal or conceal the presence of magic on objects within range. Choose reveal or conceal and apply the appropriate effect:",
        {
          "type": "entries",
          "name": "Reveal",
          "entries": [
            "You can emanate an aura that reveals whether or not there is magic on every object within range. A magical mark appears on the object if it is magical. The mark that appears resembles the school of magic the object is affected by, otherwise a generic mark is created if there is no specified school of magic. The mark remains so long as it is within range of the aura.",
            "If the object is under the conceal effects of this spell, it is suppressed while it is within range of the aura. If the object is being protected by divination magic, like being under the effects of the {@spell nondetection} spell, make an ability check using your spellcasting ability. The DC equals 10 + the level spell that was used to protect it. If a spell was not used to protect it, the DM determines an appropriate DC. On a successful check, the effect is suppressed while the object is within range of the aura.",
            "You can also reveal a message being hidden by magic, such as from the {@spell illusory script} or the conceal effects of this spell. The message is revealed in a language you understand."
          ]
        },
        {
          "type": "entries",
          "name": "Conceal",
          "entries": [
            "Choose any number of objects within range, if the chosen objects are magical, they become hidden from divination magic. The objects can't be targeted by any divination magic, perceived through magical scrying sensors, and the magic on them cannot be revealed by the effects of divination magic, such as the {@spell detect magic} spell, except by the reveal effects of this spell.",
            "You can also choose to hide text from a non-magical object. Whether this text is written, carved, or magically scribed onto the object, the text becomes {@condition invisible} or is re-written in symbols that have no real meaning.",
            "Any of these effects remains on the objects until dispelled."
          ]
        },
        "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
      ],
      "areaTags": [
        "MT",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Rock Slide",
      "source": "TACS",
      "level": 1,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small rock"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a series of falling rocks at a point you can see within range in a 15-foot tall, 15-foot-long, and 5-foot-wide line. Every creature in the line makes a Dexterity saving throw, taking {@damage 3d6} bludgeoning damage and fall {@condition prone} on a failed save, or half as much on a success and are not knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "dexterity"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "L"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Scholar's Armament",
      "source": "TACS",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "s": true,
        "m": "A gemstone worth at least 50 gp and a martial or simple weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You imbue magical power into a weapon you are holding. The weapon must have the required gemstone fashioned onto it in some way, whether it is on the pommel or on the blade of the weapon itself. For the duration, you can use your spellcasting ability instead of Strength or Dexterity for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage becomes {@dice 1d4} plus your spellcasting modifier. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "The weapon's damage die becomes a {@dice d6} when you reach 5th level, a {@dice d8} at 11th level, and a {@dice d10} at 17th level."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Shielding Vitality",
      "source": "TACS",
      "level": 2,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you or a creature within range would take damage"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You can prevent harm from coming to you or your allies. As a reaction when you or a friendly creature who doesn't have all of its hit points would take damage within range, you can reduce the damage that creature would take by {@damage 1d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Slipstream",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a few drops of oil and water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "entries": [
        "You create a low-cresting wave of water that carries the target along the surface of water or the ground. The target's walking speed is increased by 20 feet until the spell ends. In addition, swimming does not cost the target any additional movement. If the target had a swim speed, it is increased by 30 feet until the spell ends."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Courage",
      "source": "TACS",
      "level": 1,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 20
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power to rally you and your allies within range with courage. For the duration, you and every willing ally within range that is not {@condition deafened} has advantage on saving throws made to avoid or end the {@condition frightened} condition, also they gain a +1 bonus to attack rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the bonus increases to +2, creatures within range are immune to being {@condition frightened}, and their weapon attacks are treated as magical if they weren't already. When you use a spell slot of 5th level or higher, the bonus increases to +3 and creatures within range are immune to being {@condition charmed}."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Misdirection",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power that misdirects your enemies and forces them to focus their attention toward yourself or another creature. Choose a creature within range that you can see (you can choose yourself), up to three creatures you choose within 20 feet of the initial target must make a Wisdom saving throw, regarding the initial target as hostile and the most dangerous threat on a failed save. If the initial target was well-known or friendly to the chosen creatures affected by the spell, they have advantage on the save.",
        "While under the effects of the spell, they are compelled to target the chosen creature with any and all attacks and spells they can utilize. An example of the compulsion could be that they believe that the target has a bounty on their head with a very high reward, but it is up to the DM to determine a proper reason why they would be compelled by the spell. At the end of an affected creature's turn, they can repeat their Wisdom save, ending the effect on a success. The spell ends early if the initial target is reduced to 0 hit points or dies.",
        "A creature is immune to the effects of the spell if they are immune to being {@condition charmed}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can choose one additional creature to make a save against the spell for each slot level above 2nd. When you cast this spell using a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. Using a spell slot of 8th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Static Discharge",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        },
        {
          "number": 1,
          "unit": "round"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 15
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a copper rod"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Electric energy builds up within you and you release it outward in a powerful burst of energy. Each creature (except yourself) within range makes a Dexterity saving throw, taking {@damage 3d8} lightning damage  and is {@condition stunned} until the end of your next turn on a failed save, or half as much on a success and is not {@condition stunned}.",
        "Rather than using it's normal casting time, you can instead spend your entire turn building up energy and cast it immediately at the start of your next turn, taking up your action for your next turn. When you do so, creatures have disadvantage on the saving throw and you add two additional damage dice. In addition, the radius is increased by an additional 5 feet. See 'Longer Casting Times' on page 202 of the Player's Handbook for reference on casting a spell for longer than 1 action.",
        "Charging the spell leaves you fatigued for a time. You gain one level of {@condition exhaustion} for {@dice 1d4} rounds."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Static Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The first time you hit with a melee weapon attack during this spell's duration, your weapon crackles with electricity, and the attack deals an extra {@damage 1d10} lightning damage. Additionally, if the target is a creature, it must succeed a Constitution saving throw or be {@condition incapacitated} until the start of your next turn."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "incapacitated"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Suffocating Sphere",
      "source": "TACS",
      "level": 8,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "special"
        }
      ],
      "entries": [
        "You attempt to draw the air out of a creature you can see within range. A creature is unaffected by the spell if it does not need to breathe. The creature makes a Constitution saving throw. On a failed save, the creature immediately starts to suffocate and begins choking. It can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). After the previously mentioned rounds have passed, at the start of its next turn, it drops to 0 hit points and is dying, and it can't regain hit points or be stabilized until it can breathe again.",
        "At the end of every round before it is reduced to 0 hit points, the creature can repeat its Constitution saving throw, ending the spell on a success. Once the creature is reduced to 0 hit points, you concentrate on the spell until the creature dies or until the duration ends."
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Summon Vengeful Spirit",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 90
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "humanoid blood inside a precious diamond worth at least 600 gp",
          "cost": 60000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You call forth a vengeful spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Vengeance Spirit stat block. When you cast the spell, choose Slain, Cursed, or Betrayed. The creature resembles a vengeful spirit of the chosen type, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.",
        "The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the {@action Dodge} action and uses its move to avoid danger."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell's level appears in the stat block."
          ]
        }
      ],
      "miscTags": [
        "SGT",
        "SMN"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Symphony of Law and Chaos",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "m": "A musical instrument with clockwork and gears on it worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You begin performing a powerful symphony which empowers you with the planes of law or chaos (your choice), your movements as rhythmic as clockwork. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "Your walking speed increases by 30 feet.",
            "You are immune to poison damage  and have immunity to the {@condition poisoned} condition.",
            "Clockwork wings appear on your back, giving you a flying speed of 50 feet and you can hover.",
            "You are immune to the {@condition paralyzed}, {@condition stunned}, {@condition grappled}, and {@condition restrained} conditions (Chaos) or when you deal damage with a weapon or spell, that creature is also {@condition restrained} by clockwork contraptions until the end of your next turn (Law).",
            "When you deal damage to a creature with a weapon or a spell, you can deal an additional {@damage 2d10} psychic damage to one of the damage rolls (Chaos) or an additional {@damage 2d10} force damage to one of the damage rolls (Law)."
          ]
        }
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Thunderstomp",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You stomp your foot or strike your weapon against the ground, creating a ripple of power that you can use to knock down your foes. Choose a creature within range, that creature must make a Strength saving throw or fall {@condition prone} and take {@damage 4d6} thunder damage, or half as much on a success and are not knocked {@condition prone}. You and the creature must be on the same solid surface, otherwise the spell fails."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Unseelie Moon",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "teardrops of a fey from the unseelie court"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You create a small moon, which hovers around you, that emanates a dark blue hue. When you cast the spell, and as an action on subsequent turns, you can launch a freezing ray of light from the moon toward a creature you can see within range. Make a ranged spell attack. On hit, the ray deals {@damage 4d8} cold damage and the target's speed is reduced by 10 feet until the start of your next turn.",
        "While the moon hovers around you, magical darkness within the area of the spell is treated as regular darkness."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, you can fire an additional ray from the moon for every two slot levels above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Vile Mark",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of humanoid blood"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You bestow a vile curse onto a creature you can see within range, making them more susceptible to damage for the duration of the spell. The affected creature is {@condition poisoned} and once every turn, whenever an affected creature takes damage, they take an additional {@damage 2d4} necrotic damage to one of the damage rolls of the source. A creature still suffers the damage even if they are immune to being {@condition poisoned}.",
        "An affected creature can make a Constitution saving throw at the end of each of their turns, ending the spell on a success. The spell can also be ended early with a {@spell Remove Curse}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for every two slot levels above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "poisoned"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ward of Vitality",
      "source": "TACS",
      "level": 4,
      "school": "A",
      "time": [
        {
          "number": 10,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a trinket or holy symbol made of gold or silver worth 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "For the duration, up to eight willing creatures gain 20 temporary hit points. If any of these remain when the spell ends, they are lost. While they have these temporary hit points, they have advantage on Constitution and Wisdom saving throws and their hit point maximum cannot be reduced."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the temporary hit points gained is increased by 10 for each slot level above 4th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Warding Mark",
      "source": "TACS",
      "level": 0,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You create a small rune which emits a barrier which can potentially protect you from a single attack. Until the start of your next turn, you have +1 bonus to your AC against the next attack targeted at you."
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Water Splash",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Each creature in a 5-foot radius of a point you choose within range makes a Strength saving throw. On a failed save, they take {@damage 1d4} bludgeoning damage and are pushed 5 feet away from the center.",
        "This spell's damage increases by {@dice 1d4} when you reach 5th level ({@dice 2d4}), 11th level ({@dice 3d4}), and 17th level ({@dice 4d4})."
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Water Whack",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a cup of water"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Water wraps around your hand and you wave it at a creature, slamming it into them. Make a melee spell attack against a creature within range. On hit, the target takes {@damage 2d10} bludgeoning damage and makes a Strength saving throw. On a failed save, they pushed back 5 feet and are knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Weightless Form",
      "source": "TACS",
      "level": 4,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny feather"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You become lighter than a feather. You and everything you are wearing and carrying become completely weightless, removing your tether from gravity. If you stop wearing or carrying an object, they regain their weight.",
        "For the duration, you have a magical flying speed equal to your walking speed and can hover. In addition, you are immune to being {@condition prone} as you float back onto your feet at the cost of no movement and take no damage as a result from falling. Anytime you are hit by an attack, you are pushed back 10 feet away from the attacker.",
        "If you are still flying when the spell ends, you safely descend at a rate of 60 feet per round until you touch the ground."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Whelm",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A vile filled with water from a waterfall"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You conjure an overwhelming amount of water that crashes onto a creature you can see within range with crushing force. That creature must make a Strength saving throw, or fall {@condition prone} and are {@condition restrained}. A flying creature is forced to the ground, but only takes half the normal amount of fall damage they would have received. At the start of each of the target's turns it takes {@dice 1d10} points of bludgeoning damage. At the end of the creature's turns it can repeat its saving throw, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Winter's Grasp",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a frozen monster claw"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Ice encrusts the ground radiating a powerful cold energy in a 15 foot radius, making it hard for creatures to maintain their balance. This icy ground is treated as difficult terrain. A creature that begins its turn in the affected area takes {@damage 2d6} cold damage and makes a dexterity saving throw. On a failed save, they fall {@condition prone}. At the end of their turns, they make a constitution saving throw. On a successful save, they become immune to the spell's effects.",
        "The cold freezes nonmagical liquids in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@damage 1d6} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "dexterity",
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Yeti's Chilling Gaze",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "Choose a creature that you can see within range. The target must succeed on a Constitution saving throw or take {@damage 3d6} cold damage and is {@condition paralyzed} for the duration, unless the target is resistant or immune to cold damage. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target. If a creature passes their save against this spell, they are immune to its effects for 1 hour."
      ],
      "damageInflict": [
        "cold"
      ],
      "conditionInflict": [
        "paralyzed"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    }
  ]
}