{
  "_meta": {
    "sources": [
      {
        "convertedBy": [
          "Erikku Blade"
        ],
        "authors": [
          "Erikku Blade"
        ],
        "dependencies": {
          "class": [
            "PHB"
          ],
          "classFeature": [
            "PHB",
            "TCE"
          ]
        },
        "url": "",
        "full": "The Adventures of Torrin Campaign Setting",
        "abbreviation": "AOTC",
        "json": "TACS",
        "color": "f1c232"
      }
    ],
    "dateAdded": 1638480074,
    "dateLastModified": 1638480074,
    "internalCopies": [
      "item",
      "background"
    ]
  },
  "class": [
    {
      "name": "Paladin",
      "source": "TACS",
      "page": null,
      "srd": false,
      "hd": {
        "number": 1,
        "faces": 10
      },
      "proficiency": [
        "wis",
        "cha"
      ],
      "spellcastingAbility": "cha",
      "casterProgression": "1/2",
      "preparedSpells": "<$level$> / 2 + <$cha_mod$>",
      "optionalfeatureProgression": [
        {
          "name": "Fighting Style",
          "featureType": [
            "FS:P"
          ],
          "progression": {
            "2": 1
          }
        }
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          "heavy",
          "{@item shield|phb|shields}"
        ],
        "weapons": [
          "simple",
          "martial"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "athletics",
                "insight",
                "intimidation",
                "medicine",
                "persuasion",
                "religion"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a {@filter martial weapon|items|source=phb|category=basic|type=martial weapon} and a {@item shield|phb} or (b) two {@filter martial weapons|items|source=phb|category=basic|type=martial weapon}",
          "(a) five {@item javelin|phb|javelins} or (b) any {@filter simple melee weapon|items|source=phb|category=basic|type=simple weapon;melee weapon=sand}",
          "(a) a {@item priest's pack|phb} or (b) an {@item explorer's pack|phb}",
          "{@item Chain mail|phb} and a {@item holy symbol|phb}"
        ],
        "goldAlternative": "{@dice 5d4 × 10|5d4 × 10|Starting Gold}",
        "defaultData": [
          {
            "a": [
              {
                "equipmentType": "weaponMartial"
              },
              "shield|phb"
            ],
            "b": [
              {
                "equipmentType": "weaponMartial",
                "quantity": 2
              }
            ]
          },
          {
            "a": [
              {
                "item": "javelin|phb",
                "quantity": 5
              }
            ],
            "b": [
              {
                "equipmentType": "weaponSimpleMelee"
              }
            ]
          },
          {
            "a": [
              "priest's pack|phb"
            ],
            "b": [
              "explorer's pack|phb"
            ]
          },
          {
            "_": [
              "Chain mail|phb",
              "holy symbol|phb"
            ]
          }
        ]
      },
      "multiclassing": {
        "requirements": {
          "or": [
            {
              "str": 13,
              "dex": 13
            }
          ],
          "cha": 13
        },
        "proficienciesGained": {
          "armor": [
            "light",
            "medium",
            "{@item shield|phb|shields}"
          ],
          "weapons": [
            "simple",
            "martial"
          ]
        }
      },
      "classTableGroups": [
        {
          "title": "Spell Slots per Spell Level",
          "colLabels": [
            "{@filter 1st|spells|level=1|class=Paladin}",
            "{@filter 2nd|spells|level=2|class=Paladin}",
            "{@filter 3rd|spells|level=3|class=Paladin}",
            "{@filter 4th|spells|level=4|class=Paladin}",
            "{@filter 5th|spells|level=5|class=Paladin}"
          ],
          "rowsSpellProgression": [
            [
              0,
              0,
              0,
              0,
              0
            ],
            [
              2,
              0,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0,
              0
            ],
            [
              4,
              3,
              3,
              0,
              0
            ],
            [
              4,
              3,
              3,
              0,
              0
            ],
            [
              4,
              3,
              3,
              1,
              0
            ],
            [
              4,
              3,
              3,
              1,
              0
            ],
            [
              4,
              3,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              3,
              2
            ],
            [
              4,
              3,
              3,
              3,
              2
            ]
          ]
        }
      ],
      "classFeatures": [
        "Divine Sense|Paladin|TACS|1",
        "Lay on Hands|Paladin|TACS|1",
        "Divine Smite|Paladin|TACS|2",
        "Fighting Style|Paladin|TACS|2",
        "Spellcasting|Paladin|TACS|2",
        "Divine Health|Paladin|TACS|3",
        "Channel Divinity: Channel Warrior's Resolve|Paladin|TACS|3",
        {
          "classFeature": "Sacred Oath|Paladin|TACS|3",
          "gainSubclassFeature": true,
          "gainSubclassFeatureHasContent": true
        },
        "Ability Score Improvement|Paladin|TACS|4",
        "Martial Versatility|Paladin|TACS|4|TCE",
        "Extra Attack|Paladin|TACS|5",
        "Channel Divinity: Channel Smite|Paladin|TACS|6",
        "Aura of Protection|Paladin|TACS|6",
        {
          "classFeature": "Sacred Oath feature|Paladin|TACS|7",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Paladin|TACS|8",
        "Channel Divinity: Urgent Prayer|Paladin|TACS|9",
        "Aura of Courage|Paladin|TACS|10",
        "Improved Divine Smite|Paladin|TACS|11",
        "Ability Score Improvement|Paladin|TACS|12",
        "Cleansing Touch|Paladin|TACS|14",
        {
          "classFeature": "Sacred Oath feature|Paladin|TACS|15",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Paladin|TACS|16",
        "Aura improvements|Paladin|TACS|18",
        "Ability Score Improvement|Paladin|TACS|19",
        {
          "classFeature": "Sacred Oath feature|Paladin|TACS|20",
          "gainSubclassFeature": true
        }
      ],
      "subclassTitle": "Sacred Oath",
      "fluff": [
        {
          "name": "Paladin",
          "type": "section",
          "entries": [
            "Clad in plate armor that gleams in the sunlight despite the dust and grime of long travel, a human lays down her sword and shield and places her hands on a mortally wounded man. Divine radiance shines from her hands, the man's wounds knit closed, and his eyes open wide with amazement.",
            "A dwarf crouches behind an outcrop, his black cloak making him nearly invisible in the night, and watches an orc war band celebrating its recent victory. Silently, he stalks into their midst and whispers an oath, and two orcs are dead before they even realize he is there.",
            "Silver hair shining in a shaft of light that seems to illuminate only him, an elf laughs with exultation. His spear flashes like his eyes as he jabs again and again at a twisted giant, until at last his light overcomes its hideous darkness.",
            "Whatever their origin and their mission, paladins are united by their oaths to stand against the forces of evil. Whether sworn before a god's altar and the witness of a priest, in a sacred glade before nature spirits and fey beings, or in a moment of desperation and grief with the dead as the only witness, a paladin's oath is a powerful bond. It is a source of power that turns a devout warrior into a blessed champion.",
            {
              "type": "entries",
              "name": "The Cause of Righteousness",
              "entries": [
                "A paladin swears to uphold justice and righteousness, to stand with the good things of the world against the encroaching darkness, and to hunt the forces of evil wherever they lurk. Different paladins focus on various aspects of the cause of righteousness, but all are bound by the oaths that grant them power to do their sacred work. Although many paladins are devoted to gods of good, a paladin's power comes as much from a commitment to justice itself as it does from a god.",
                "Paladins train for years to learn the skills of combat, mastering a variety of weapons and armor. Even so, their martial skills are secondary to the magical power they wield: power to heal the sick and injured, to smite the wicked and the undead, and to protect the innocent and those who join them in the fight for justice."
              ]
            },
            {
              "type": "entries",
              "name": "Beyond the Mundane Life",
              "entries": [
                "Almost by definition, the life of a paladin is an adventuring life. Unless a lasting injury has taken him or her away from adventuring for a time, every paladin lives on the front lines of the cosmic struggle against evil. Fighters are rare enough among the ranks of the militias and armies of the world, but even fewer people can claim the true calling of a paladin. When they do receive the call, these warriors turn from their former occupations and take up arms to fight evil. Sometimes their oaths lead them into the service of the crown as leaders of elite groups of knights, but even then their loyalty is first to the cause of righteousness, not to crown and country.",
                "Adventuring paladins take their work seriously. A delve into an ancient ruin or dusty crypt can be a quest driven by a higher purpose than the acquisition of treasure. Evil lurks in dungeons and primeval forests, and even the smallest victory against it can tilt the cosmic balance away from oblivion."
              ]
            },
            {
              "type": "entries",
              "name": "Creating a Paladin",
              "entries": [
                "The most important aspect of a paladin character is the nature of his or her holy quest. Although the class features related to your oath don't appear until you reach 3rd level, plan ahead for that choice by reading the oath descriptions at the end of the class. Are you a devoted servant of good, loyal to the gods of justice and honor, a holy knight in shining armor venturing forth to smite evil? Are you a glorious champion of the light, cherishing everything beautiful that stands against the shadow, a knight whose oath descends from traditions older than many of the gods? Or are you an embittered loner sworn to take vengeance on those who have done great evil, sent as an angel of death by the gods or driven by your need for revenge? Appendix B lists many deities worshiped by paladins throughout the multiverse, such as Torm, Tyr, Heironeous, Paladine, Kiri-Jolith, Dol Arrah, the Silver Flame, Bahamut, Athena, Re-Horakhty, and Heimdall.",
                "How did you experience your call to serve as a paladin? Did you hear a whisper from an unseen god or angel while you were at prayer? Did another paladin sense the potential within you and decide to train you as a squire? Or did some terrible event—the destruction of your home, perhaps—drive you to your quests? Perhaps you stumbled into a sacred grove or a hidden elven enclave and found yourself called to protect all such refuges of goodness and beauty. Or you might have known from your earliest memories that the paladin's life was your calling, almost as if you had been sent into the world with that purpose stamped on your soul.",
                "As guardians against the forces of wickedness, paladins are rarely of any evil alignment. Most of them walk the paths of charity and justice. Consider how your alignment colors the way you pursue your holy quest and the manner in which you conduct yourself before gods and mortals. Your oath and alignment might be in harmony, or your oath might represent standards of behavior that you have not yet attained.",
                {
                  "type": "entries",
                  "name": "Quick Build",
                  "entries": [
                    "You can make a paladin quickly by following these suggestions. First, Strength should be your highest ability score, followed by Charisma. Second, choose the {@background noble} background."
                  ]
                }
              ]
            }
          ],
          "page": null,
          "source": "TACS"
        },
        {
          "type": "section",
          "entries": [
            {
              "type": "quote",
              "entries": [
                "The true worth of a paladin is measured not in foes defeated or dungeons plundered. It is measured in lives saved and hearts turned to the causes of mercy and justice."
              ],
              "by": "Isteval"
            },
            "A paladin is a living embodiment of an oath—a promise or a vow made manifest in the person of a holy warrior who has the skill and the determination to see the cause through to the end. Some paladins devote themselves expressly to protecting the innocent and spreading justice in the world, while others resolve to attain that goal by conquering those who stand defiant and bringing them under the rule of law.",
            "Although no paladin in the world could be described as typical, a number of them are narrow-minded do-gooders who refuse to tolerate even the smallest deviation from their own outlook. Paladins who take up the adventuring life, however, rarely remain so rigid in their attitudes—if only to keep from alienating their companions.",
            "You can flesh out your paladin character by using the suggestions below. It's important to keep in mind that most paladins aren't robots. They have doubts and prejudices and harbor contradictory thoughts just as any other character does. Some are compelled by an internal motivation that might sometimes be at odds with the principles of their oaths.",
            {
              "type": "entries",
              "name": "Personal Goal",
              "entries": [
                "The precepts of a paladin's oath provide purpose to the character and dictate an ultimate goal or an overall intent that the paladin abides by and advances. Aside from that, some paladins are driven by a personal goal that either complements or transcends the dictates of their oaths. Paladins who swear different oaths might have the same personal goal, differing only in how they apply that goal to their actions when upholding their oaths.",
                "If your paladin character has a personal goal, it might be drawn from some life event and thus not directly tied to the oath.",
                {
                  "type": "table",
                  "caption": "Personal Goal",
                  "colLabels": [
                    "{@dice d6}",
                    "Personal Goal"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Peace. You fight so that future generations will not have to."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Revenge. Your oath is the vehicle through which you will right an ancient wrong."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Duty. You will live up to what you have sworn to do, or die trying."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "Leadership. You will win a great battle that bards will sing about, and in so doing, you will become an example to inspire others."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Faith. You know your path is righteous, or else the gods would not have set you upon it."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "Glory. You will lead the world into a grand new era, one that will be branded with your name."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Symbol",
              "entries": [
                "Paladins are mindful of the influence of symbols, and many of them adopt or design an artistic device that bears a distinctive image. Your symbol exemplifies the oath you have taken and communicates that message to those around you, friend and foe alike.",
                "Your symbol might be displayed on a banner, a flag, or your clothing for all to see. Or it could be less obvious, such as a trinket or a token that you carry concealed on your person.",
                {
                  "type": "table",
                  "caption": "Symbol",
                  "colLabels": [
                    "{@dice d6}",
                    "Symbol"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "A dragon, emblematic of your nobility in peace and your ferocity in combat"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "A clenched fist, because you are always ready to fight for your beliefs"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "An upraised open hand, indicating your preference for diplomacy over combat"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "A red heart, showing the world your commitment to justice"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "A black heart, signifying that emotions such as pity do not sway your dedication to your oath"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "An unblinking eye, meaning that you are ever alert to all threats against your cause"
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Nemesis",
              "entries": [
                "Their adherence to a sacred oath demands that paladins take an active stance in carrying their beliefs into the world. This activity naturally leads to conflict with creatures or entities that oppose those beliefs. Among those opponents, one often stands out as a paladin's most persistent or most formidable foe—a nemesis whose presence or influence is a constant factor in a paladin's life.",
                "Your paladin character might have an enemy that dates from the days before you took up your path. Or you could be a target because when you became a paladin, you immediately attracted the attention of those that would do you in. If you have a nemesis, who or what is it? Whom among your enemies do you consider to be the biggest threat to achieving your goals?",
                {
                  "type": "table",
                  "caption": "Nemesis",
                  "colLabels": [
                    "{@dice d6}",
                    "Nemesis"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "A mighty orc war chief who threatens to overrun and destroy everything you hold sacred"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "A fiend or a celestial, the agent of a power of the Outer Planes, who has been charged with corrupting or redeeming you, as appropriate"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "A dragon whose servants dog your steps"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "A high priest who sees you as a misguided fool and wants you to abandon your religion"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "A rival paladin who trained with you but became an oath-breaker and holds you responsible"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "A vampire who has sworn revenge against all paladins after being defeated by one"
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Temptation",
              "entries": [
                "Although paladins are dedicated to their oaths, they are mortals, and thus they are flawed. Many of them exhibit a type of behavior or hold to an attitude that is not in keeping with the highest ideals of their calling.",
                "What is the temptation that your character succumbs to or finds it difficult to resist?",
                {
                  "type": "table",
                  "caption": "Temptation",
                  "colLabels": [
                    "{@dice d6}",
                    "Temptation"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Fury. When your anger is roused, you have trouble thinking straight, and you fear you might do something you'll regret."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Pride. Your deeds are noteworthy, and no one takes note of them more often than you."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Lust. You can't resist an attractive face and a pleasant smile."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "Envy. You are mindful of what some famous folk have accomplished, and you feel inadequate when your deeds don't compare to theirs."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Despair. You consider the great strength of the enemies you must defeat, and at times you see no way to achieve final victory."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "Greed. Regardless of how much glory and treasure you amass, it's never enough for you."
                    ]
                  ]
                }
              ]
            }
          ],
          "source": "TACS",
          "page": 36
        }
      ]
    }
  ],
  "subclass": [
    {
      "name": "Oath of Devotion",
      "shortName": "Devotion",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "srd": false,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "protection from evil and good",
              "sanctuary"
            ],
            "5": [
              "lesser restoration",
              "zone of truth"
            ],
            "9": [
              "beacon of hope",
              "dispel magic"
            ],
            "13": [
              "freedom of movement",
              "guardian of faith"
            ],
            "17": [
              "commune",
              "flame strike"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Devotion|Paladin|TACS|Devotion|TACS|3",
        "Aura of Devotion|Paladin|TACS|Devotion|TACS|7",
        "Purity of Spirit|Paladin|TACS|Devotion|TACS|15",
        "Holy Nimbus|Paladin|TACS|Devotion|TACS|20"
      ]
    },
    {
      "name": "Oath of the Ancients",
      "shortName": "Ancients",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "ensnaring strike",
              "speak with animals"
            ],
            "5": [
              "moonbeam",
              "misty step"
            ],
            "9": [
              "plant growth",
              "protection from energy"
            ],
            "13": [
              "ice storm",
              "stoneskin"
            ],
            "17": [
              "commune with nature",
              "tree stride"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of the Ancients|Paladin|TACS|Ancients|TACS|3",
        "Aura of Warding|Paladin|TACS|Ancients|TACS|7",
        "Undying Sentinel|Paladin|TACS|Ancients|TACS|15",
        "Elder Champion|Paladin|TACS|Ancients|TACS|20"
      ]
    },
    {
      "name": "Oath of Vengeance",
      "shortName": "Vengeance",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "bane",
              "hunter's mark"
            ],
            "5": [
              "hold person",
              "misty step"
            ],
            "9": [
              "haste",
              "protection from energy"
            ],
            "13": [
              "banishment",
              "dimension door"
            ],
            "17": [
              "hold monster",
              "scrying"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Vengeance|Paladin|TACS|Vengeance|TACS|3",
        "Relentless Avenger|Paladin|TACS|Vengeance|TACS|7",
        "Soul of Vengeance|Paladin|TACS|Vengeance|TACS|15",
        "Avenging Angel|Paladin|TACS|Vengeance|TACS|20"
      ]
    },
    {
      "name": "Oath of the Crown",
      "shortName": "Crown",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "command",
              "compelled duel"
            ],
            "5": [
              "warding bond",
              "zone of truth"
            ],
            "9": [
              "aura of vitality",
              "spirit guardians"
            ],
            "13": [
              "banishment",
              "guardian of faith"
            ],
            "17": [
              "circle of power",
              "geas"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of the Crown|Paladin|TACS|Crown|TACS|3",
        "Divine Allegiance|Paladin|TACS|Crown|TACS|7",
        "Unyielding Spirit|Paladin|TACS|Crown|TACS|15",
        "Exalted Champion|Paladin|TACS|Crown|TACS|20"
      ]
    },
    {
      "name": "Oath of Conquest",
      "shortName": "Conquest",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "armor of Agathys",
              "command"
            ],
            "5": [
              "hold person",
              "spiritual weapon"
            ],
            "9": [
              "bestow curse",
              "fear"
            ],
            "13": [
              "dominate beast",
              "stoneskin"
            ],
            "17": [
              "cloudkill",
              "dominate person"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Conquest|Paladin|TACS|Conquest|TACS|3",
        "Aura of Conquest|Paladin|TACS|Conquest|TACS|7",
        "Scornful Rebuke|Paladin|TACS|Conquest|TACS|15",
        "Invincible Conqueror|Paladin|TACS|Conquest|TACS|20"
      ]
    },
    {
      "name": "Oath of Redemption",
      "shortName": "Redemption",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "sanctuary",
              "sleep"
            ],
            "5": [
              "calm emotions",
              "hold person"
            ],
            "9": [
              "counterspell",
              "hypnotic pattern"
            ],
            "13": [
              "Otiluke's resilient sphere",
              "stoneskin"
            ],
            "17": [
              "hold monster",
              "wall of force"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Redemption|Paladin|TACS|Redemption|TACS|3",
        "Aura of the Guardian|Paladin|TACS|Redemption|TACS|7",
        "Protective Spirit|Paladin|TACS|Redemption|TACS|15",
        "Emissary of Redemption|Paladin|TACS|Redemption|TACS|20"
      ]
    },
    {
      "name": "Oath of Glory",
      "shortName": "Glory",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "guiding bolt",
              "heroism"
            ],
            "5": [
              "enhance ability",
              "magic weapon"
            ],
            "9": [
              "haste",
              "protection from energy"
            ],
            "13": [
              "compulsion",
              "freedom of movement"
            ],
            "17": [
              "commune",
              "flame strike"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Glory|Paladin|TACS|Glory|TACS|3",
        "Aura of Alacrity|Paladin|TACS|Glory|TACS|7",
        "Glorious Defense|Paladin|TACS|Glory|TACS|15",
        "Living Legend|Paladin|TACS|Glory|TACS|20"
      ]
    },
    {
      "name": "Oath of the Watchers",
      "shortName": "Watchers",
      "source": "TACS",
      "className": "Paladin",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "alarm",
              "detect magic"
            ],
            "5": [
              "moonbeam",
              "see invisibility"
            ],
            "9": [
              "counterspell",
              "nondetection"
            ],
            "13": [
              "aura of purity",
              "banishment"
            ],
            "17": [
              "hold monster",
              "scrying"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of the Watchers|Paladin|TACS|Watchers|TACS|3",
        "Aura of the Sentinel|Paladin|TACS|Watchers|TACS|7",
        "Vigilant Rebuke|Paladin|TACS|Watchers|TACS|15",
        "Mortal Bulwark|Paladin|TACS|Watchers|TACS|20"
      ]
    },
    {
      "name": "Oath of The Truth Seeker",
      "source": "TACS",
      "shortName": "Truth Seeker",
      "className": "Paladin",
      "classSource": "TACS",
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "comprehend languages",
              "guiding bolt"
            ],
            "5": [
              "augury",
              "reveal/conceal|TACS"
            ],
            "9": [
              "clairvoyance",
              "tongues"
            ],
            "13": [
              "divination",
              "Mordenkainen's faithful hound"
            ],
            "17": [
              "legend lore",
              "teleportation circle"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of The Truth Seeker|Paladin|TACS|Truth Seeker|TACS|3",
        "Aura of Truth|Paladin|TACS|Truth Seeker|TACS|7",
        "Guiding Sword|Paladin|TACS|Truth Seeker|TACS|15",
        "Champion of Truth|Paladin|TACS|Truth Seeker|TACS|20"
      ]
    },
    {
      "name": "Oath of Charity",
      "source": "TACS",
      "shortName": "Charity",
      "className": "Paladin",
      "classSource": "TACS",
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "healing word",
              "shield of faith"
            ],
            "5": [
              "healing spirit|XGE",
              "shielding vitality|TACS"
            ],
            "9": [
              "create food and water",
              "life transference|XGE"
            ],
            "13": [
              "aura of life",
              "ward of vitality|TACS"
            ],
            "17": [
              "greater restoration",
              "mass cure wounds"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Oath of Charity|Paladin|TACS|Charity|TACS|3",
        "Aura of Regeneration|Paladin|TACS|Charity|TACS|7",
        "Shield the Wounded|Paladin|TACS|Charity|TACS|15",
        "Giver of Life|Paladin|TACS|Charity|TACS|20"
      ]
    }
  ],
  "classFeature": [
    {
      "name": "Divine Sense",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the {@spell hallow} spell.",
        "You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
      ]
    },
    {
      "name": "Lay on Hands",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.",
        "As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.",
        "Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.",
        "This feature has no effect on undead and constructs."
      ]
    },
    {
      "name": "Divine Smite",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is {@dice 2d8} for a 1st-level spell slot, plus {@dice 1d8} for each spell level higher than 1st, to a maximum of {@dice 5d8}. The damage increases by {@dice 1d8} if the target is an undead or a fiend, to a maximum of {@dice 6d8}."
      ]
    },
    {
      "name": "Fighting Style",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take the same Fighting Style option more than once, even if you get to choose again.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Defense"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Dueling"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Great Weapon Fighting"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Protection"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Blessed Warrior|TCE"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Blind Fighting|TCE"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Interception|TCE"
            }
          ]
        }
      ]
    },
    {
      "name": "Spellcasting",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for the {@filter paladin spell list|spells|class=paladin}.",
        {
          "type": "entries",
          "name": "Preparing and Casting Spells",
          "entries": [
            "The Paladin table shows how many spell slots you have to cast your {@filter paladin spells|spells|class=paladin}. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
            "You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
            "For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd-level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
            "You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Ability",
          "entries": [
            "Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.",
            {
              "type": "abilityDc",
              "name": "Spell",
              "attributes": [
                "cha"
              ]
            },
            {
              "type": "abilityAttackMod",
              "name": "Spell",
              "attributes": [
                "cha"
              ]
            }
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Focus",
          "entries": [
            "You can use a {@item holy symbol|phb} as a spellcasting focus for your paladin spells."
          ]
        }
      ]
    },
    {
      "name": "Channel Divinity",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.",
        "When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.",
        "Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."
      ]
    },
    {
      "name": "Channel Divinity: Harness Divine Power",
      "source": "TCE",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 3,
      "isClassFeatureVariant": true,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "{@i 3rd-level paladin {@variantrule optional class features|tce|optional feature}}",
        "You can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 3rd level, once; 7th level, twice; and 15th level, thrice. You regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Channel Divinity: Channel Warrior's Resolve",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 3,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "At 3rd level, you can harness divine power within yourself to keep your resolve strong. As a bonus action, you can roll a number of {@dice d10}s equal to your proficiency bonus and add your Charisma modifier to the roll. You gain temporary hit points equal to the total."
      ]
    },
    {
      "name": "Divine Health",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "By 3rd level, the divine magic flowing through you makes you immune to disease."
      ]
    },
    {
      "name": "Sacred Oath",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose from the list of available oaths.",
        "Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.",
        {
          "name": "Oath Spells",
          "type": "entries",
          "entries": [
            "Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.",
            "If you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you."
          ]
        },
        {
          "type": "refClassFeature",
          "classFeature": "Channel Divinity|Paladin|TACS|3"
        },
        {
          "type": "refClassFeature",
          "classFeature": "Channel Divinity: Harness Divine Power|Paladin|TACS|3|TCE"
        },
        {
          "name": "Breaking Your Oath",
          "type": "inset",
          "entries": [
            "A paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.",
            "A paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-denial. After a rite of confession and forgiveness, the paladin starts fresh.",
            "If a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the DM's discretion, an impenitent paladin might be forced to abandon this class and adopt another."
          ]
        }
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 4,
      "entries": [
        "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Martial Versatility",
      "source": "TCE",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 4,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 4th-level paladin {@variantrule optional class features|tce|optional feature}}",
        "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace a {@filter fighting style|optionalfeatures|feature type=FS:P} you know with another fighting style available to paladins. This replacement represents a shift of focus in your martial practice."
      ]
    },
    {
      "name": "Extra Attack",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 5,
      "entries": [
        "Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn."
      ]
    },
    {
      "name": "Aura of Protection",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 6,
      "entries": [
        "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Channel Divinity: Channel Smite",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 6,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "At 6th level, you can harness divine power in a wave of energy that radiates from you and your allies' next strike. As a bonus action, you can roll a number of {@dice d8}s equal to your proficiency bonus. You and each creature you choose within range of one of your paladin auras gains a bonus to the next damage roll they make with a weapon attack equal to the total. The bonus damage is radiant damage."
      ]
    },
    {
      "name": "Sacred Oath feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 7,
      "entries": [
        "At 7th level, you gain a feature granted to you by your Sacred Oath."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Channel Divinity: Urgent Prayer",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 9,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "At 9th level, you can hold your holy symbol and utter a 10-minute prayer, allowing you to swap a paladin spell you have prepared for another one you don’t have prepared. If you do not have a spell slot of a level high enough to cast the chosen spell, you regain one spell slot of the lowest level needed to cast it.",
        "Once you’ve used this feature, you cannot use it again until you finish a long rest."
      ]
    },
    {
      "name": "Aura of Courage",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 10,
      "entries": [
        "Starting at 10th level, you and friendly creatures within 10 feet of you can't be {@condition frightened} while you are conscious.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Improved Divine Smite",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 11,
      "entries": [
        "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra {@damage 1d8} radiant damage."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 12,
      "entries": [
        "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Cleansing Touch",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 14,
      "entries": [
        "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.",
        "You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Sacred Oath feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 15,
      "entries": [
        "At 15th level, you gain a feature granted to you by your Sacred Oath."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 16,
      "entries": [
        "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Aura improvements",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 18,
      "entries": [
        "At 18th level, the range of your Aura of Protection increases to 30 feet."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 19,
      "entries": [
        "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Sacred Oath feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "level": 20,
      "entries": [
        "At 20th level, you gain a feature granted to you by your Sacred Oath."
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "Oath of the Ancients",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of the Ancients is as old as the race of elves and the rituals of the druids. Sometimes called fey knights, green knights, or horned knights, paladins who swear this oath cast their lot with the side of the light in the cosmic struggle against darkness because they love the beautiful and life-giving things of the world, not necessarily because they believe in principles of honor, courage, and justice. They adorn their armor and clothing with images of growing things—leaves, antlers, or flowers—to reflect their commitment to preserving life and light in the world.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of the Ancients|Paladin|TACS|Ancients|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Ancients|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Nature's Wrath|Paladin|TACS|Ancients|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Turn the Faithless|Paladin|TACS|Ancients|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Nature's Wrath",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to invoke primeval forces to ensnare a foe. As an action, you can cause spectral vines to spring up and reach for a creature within 10 feet of you that you can see. The creature must succeed on a Strength or Dexterity saving throw (its choice) or be {@condition restrained}. While {@condition restrained} by the vines, the creature repeats the saving throw at the end of each of its turns. On a success, it frees itself and the vines vanish."
      ]
    },
    {
      "name": "Channel Divinity: Turn the Faithless",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to utter ancient words that are painful for fey and fiends to hear. As an action, you present your holy symbol, and each fey or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage.",
        "A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the {@action Dodge} action.",
        "If the creature's true form is concealed by an illusion, shapeshifting, or other effect, that form is revealed while it is turned."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of the Ancients Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell ensnaring strike}, {@spell speak with animals}"
            ],
            [
              "5th",
              "{@spell moonbeam}, {@spell misty step}"
            ],
            [
              "9th",
              "{@spell plant growth}, {@spell protection from energy}"
            ],
            [
              "13th",
              "{@spell ice storm}, {@spell stoneskin}"
            ],
            [
              "17th",
              "{@spell commune with nature}, {@spell tree stride}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of the Ancients",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "The tenets of the Oath of the Ancients have been preserved for uncounted centuries. This oath emphasizes the principles of good above any concerns of law or chaos. Its four central principles are simple.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Kindle the Light",
              "entries": [
                "Through your acts of mercy, kindness, and forgiveness, kindle the light of hope in the world, beating back despair."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Shelter the Light",
              "entries": [
                "Where there is good, beauty, love, and laughter in the world, stand against the wickedness that would swallow it. Where life flourishes, stand against the forces that would render it barren."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Preserve Your Own Light",
              "entries": [
                "Delight in song and laughter, in beauty and art. If you allow the light to die in your own heart, you can't preserve it in the world."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Be the Light",
              "entries": [
                "Be a glorious beacon for all who live in despair. Let the light of your joy and courage shine forth in all your deeds."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Aura of Warding",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Beginning at 7th level, ancient magic lies so heavily upon you that it forms an eldritch ward. You and friendly creatures within 10 feet of you have resistance to damage from spells.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Undying Sentinel",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, when you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can't use it again until you finish a long rest.",
        "Additionally, you suffer none of the drawbacks of old age, and you can't be aged magically."
      ]
    },
    {
      "name": "Elder Champion",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Ancients",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, you can assume the form of an ancient force of nature, taking on an appearance you choose. For example, your skin might turn green or take on a bark-like texture, your hair might become leafy or mosslike, or you might sprout antlers or a lion-like mane.",
        "Using your action, you undergo a transformation. For 1 minute, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "At the start of each of your turns, you regain 10 hit points.",
            "Whenever you cast a paladin spell that has a casting time of 1 action, you can cast it using your bonus action instead.",
            "Enemy creatures within 10 feet of you have disadvantage on saving throws against your paladin spells and Channel Divinity options."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Oath of Devotion",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Devotion|Paladin|TACS|Devotion|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Devotion|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Sacred Weapon|Paladin|TACS|Devotion|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Turn the Unholy|Paladin|TACS|Devotion|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Sacred Weapon",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.",
        "You can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall {@condition unconscious}, this effect ends."
      ]
    },
    {
      "name": "Channel Divinity: Turn the Unholy",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.",
        "A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the {@action Dodge} action."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of Devotion Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell protection from evil and good}, {@spell sanctuary}"
            ],
            [
              "5th",
              "{@spell lesser restoration}, {@spell zone of truth}"
            ],
            [
              "9th",
              "{@spell beacon of hope}, {@spell dispel magic}"
            ],
            [
              "13th",
              "{@spell freedom of movement}, {@spell guardian of faith}"
            ],
            [
              "17th",
              "{@spell commune}, {@spell flame strike}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of Devotion",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Though the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Honesty",
              "entries": [
                "Don't lie or cheat. Let your word be your promise."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Courage",
              "entries": [
                "Never fear to act, though caution is wise."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Compassion",
              "entries": [
                "Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Honor",
              "entries": [
                "Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Duty",
              "entries": [
                "Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Aura of Devotion",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, you and friendly creatures within 10 feet of you can't be {@condition charmed} while you are conscious.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Purity of Spirit",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Beginning at 15th level, you are always under the effects of a {@spell protection from evil and good} spell."
      ]
    },
    {
      "name": "Holy Nimbus",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Devotion",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.",
        "Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.",
        "In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Oath of Vengeance",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of Vengeance is a solemn commitment to punish those who have committed a grievous sin. When evil forces slaughter helpless villagers, when an entire people turns against the will of the gods, when a thieves' guild grows too violent and powerful, when a dragon rampages through the countryside—at times like these, paladins arise and swear an Oath of Vengeance to set right that which has gone wrong. To these paladins—sometimes called avengers or dark knights—their own purity is not as important as delivering justice.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Vengeance|Paladin|TACS|Vengeance|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Vengeance|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Abjure Enemy|Paladin|TACS|Vengeance|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Vow of Enmity|Paladin|TACS|Vengeance|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Abjure Enemy",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As an action, you present your holy symbol and speak a prayer of denunciation, using your Channel Divinity. Choose one creature within 60 feet of you that you can see. That creature must make a Wisdom saving throw, unless it is immune to being {@condition frightened}. Fiends and undead have disadvantage on this saving throw.",
        "On a failed save, the creature is {@condition frightened} for 1 minute or until it takes any damage. While {@condition frightened}, the creature's speed is 0, and it can't benefit from any bonus to its speed.",
        "On a successful save, the creature's speed is halved for 1 minute or until the creature takes any damage."
      ]
    },
    {
      "name": "Channel Divinity: Vow of Enmity",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As a bonus action, you can utter a vow of enmity against a creature you can see within 10 feet of you, using your Channel Divinity. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls {@condition unconscious}."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of Vengeance Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell bane}, {@spell hunter's mark}"
            ],
            [
              "5th",
              "{@spell hold person}, {@spell misty step}"
            ],
            [
              "9th",
              "{@spell haste}, {@spell protection from energy}"
            ],
            [
              "13th",
              "{@spell banishment}, {@spell dimension door}"
            ],
            [
              "17th",
              "{@spell hold monster}, {@spell scrying}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of Vengeance",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "The tenets of the Oath of Vengeance vary by paladin, but all the tenets revolve around punishing wrongdoers by any means necessary. Paladins who uphold these tenets are willing to sacrifice even their own righteousness to mete out justice upon those who do evil, so the paladins are often neutral or lawful neutral in alignment. The core principles of the tenets are brutally simple.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Fight the Greater Evil",
              "entries": [
                "Faced with a choice of fighting my sworn foes or combating a lesser evil, I choose the greater evil."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "No Mercy for the Wicked",
              "entries": [
                "Ordinary foes might win my mercy, but my sworn enemies do not."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "By Any Means Necessary",
              "entries": [
                "My qualms can't get in the way of exterminating my foes."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Restitution",
              "entries": [
                "If my foes wreak ruin on the world, it is because I failed to stop them. I must help those harmed by their misdeeds."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Relentless Avenger",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "By 7th level, your supernatural focus helps you close off a foe's retreat. When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction. This movement doesn't provoke opportunity attacks."
      ]
    },
    {
      "name": "Soul of Vengeance",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, the authority with which you speak your Vow of Enmity gives you greater power over your foe. When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range."
      ]
    },
    {
      "name": "Avenging Angel",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Vengeance",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, you can assume the form of an angelic avenger. Using your action, you undergo a transformation. For 1 hour, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Wings sprout from your back and grant you a flying speed of 60 feet.",
            "You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeed on a Wisdom saving throw or become {@condition frightened} of you for 1 minute or until it takes any damage. {@action Attack} rolls against the {@condition frightened} creature have advantage."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Oath of the Crown",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of the Crown is sworn to the ideals of civilization, be it the spirit of a nation, fealty to a sovereign, or service to a deity of law and rulership. The paladins who swear this oath dedicate themselves to serving society and, in particular, the laws that hold society together. These paladins are the watchful guardians on the walls, standing against the chaotic tides of barbarism that threaten to tear down all that civilization has built, and are commonly known as guardians, exemplars, or sentinels. Often, paladins who swear this oath are members of an order of knighthood in service to a nation or sovereign, and undergo their oath as part of their admission to the order's ranks.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of the Crown|Paladin|TACS|Crown|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Crown|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Champion Challenge|Paladin|TACS|Crown|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Turn the Tide|Paladin|TACS|Crown|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Champion Challenge",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As a bonus action, you issue a challenge that compels other creatures to do battle with you. Each creature of your choice that you can see within 30 feet of you must make a Wisdom saving throw. On a failed save, a creature can't willingly move more than 30 feet away from you. This effect ends on the creature if you are {@condition incapacitated} or die or if the creature is more than 30 feet away from you."
      ]
    },
    {
      "name": "Channel Divinity: Turn the Tide",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "As a bonus action, you can bolster injured creatures with your Channel Divinity. Each creature of your choice that can hear you within 30 feet of you regains hit points equal to {@dice 1d6} + your Charisma modifier (minimum of 1) if it has no more than half of its hit points."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of the Crown Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell command}, {@spell compelled duel}"
            ],
            [
              "5th",
              "{@spell warding bond}, {@spell zone of truth}"
            ],
            [
              "9th",
              "{@spell aura of vitality}, {@spell spirit guardians}"
            ],
            [
              "13th",
              "{@spell banishment}, {@spell guardian of faith}"
            ],
            [
              "17th",
              "{@spell circle of power}, {@spell geas}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of the Crown",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "The tenets of the Oath of the Crown are often set by the sovereign to which their oath is sworn, but generally emphasize the following tenets.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Law",
              "entries": [
                "The law is paramount. It is the mortar that holds the stones of civilization together, and it must be respected."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Loyalty",
              "entries": [
                "Your word is your bond. Without loyalty, oaths and laws are meaningless."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Courage",
              "entries": [
                "You must be willing to do what needs to be done for the sake of order, even in the face of overwhelming odds. If you don't act, then who will?"
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Responsibility",
              "entries": [
                "You must deal with the consequences of your actions, and you are responsible for fulfilling your duties and obligations."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Divine Allegiance",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, when a creature within 5 feet of you takes damage, you can use your reaction to magically substitute your own health for that of the target creature, causing that creature not to take the damage. Instead, you take the damage. This damage to you can't be reduced or prevented in any way."
      ]
    },
    {
      "name": "Unyielding Spirit",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, you have advantage on saving throws to avoid becoming {@condition paralyzed} or {@condition stunned}."
      ]
    },
    {
      "name": "Exalted Champion",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Crown",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, your presence on the field of battle is an inspiration to those dedicated to your cause. You can use your action to gain the following benefits for 1 hour:",
        {
          "type": "list",
          "items": [
            "You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
            "Your allies have advantage on death saving throws while within 30 feet of you.",
            "You have advantage on Wisdom saving throws, as do your allies within 30 feet of you."
          ]
        },
        "This effect ends early if you are {@condition incapacitated} or die. Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Oath of Glory",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "Paladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions so they're all ready when destiny calls.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Glory|Paladin|TACS|Glory|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Glory|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity|Paladin|TACS|Glory|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "{@i 3rd-level Oath of Glory feature}",
        "You gain the following two Channel Divinity options. See the Sacred Oath class feature for how Channel Divinity works.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Peerless Athlete|Paladin|TACS|Glory|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Inspiring Smite|Paladin|TACS|Glory|TACS|3"
        }
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Oath of Glory feature}",
        "You gain oath spells at the paladin levels listed in the Oath of Glory Spells table. See the Sacred Oath class feature for how oath spells work.",
        {
          "type": "table",
          "caption": "Oath of Glory Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell guiding bolt}, {@spell heroism}"
            ],
            [
              "5th",
              "{@spell enhance ability}, {@spell magic weapon}"
            ],
            [
              "9th",
              "{@spell haste}, {@spell protection from energy}"
            ],
            [
              "13th",
              "{@spell compulsion}, {@spell freedom of movement}"
            ],
            [
              "17th",
              "{@spell commune}, {@spell flame strike}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of Glory",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "The tenets of the Oath of Glory drive a paladin to attempt heroics that might one day shine in legend.",
        {
          "type": "entries",
          "name": "Actions over Words",
          "entries": [
            "Strive to be known by glorious deeds, not words."
          ]
        },
        {
          "type": "entries",
          "name": "Challenges Are but Tests",
          "entries": [
            "Face hardships with courage, and encourage your allies to face them with you."
          ]
        },
        {
          "type": "entries",
          "name": "Hone the Body",
          "entries": [
            "Like raw stone, your body must be worked so its potential can be realized."
          ]
        },
        {
          "type": "entries",
          "name": "Discipline the Soul",
          "entries": [
            "You must marshal the discipline to overcome failings within yourself that threaten to dim the glory of you and your friends."
          ]
        }
      ]
    },
    {
      "name": "Channel Divinity: Inspiring Smite",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2,
      "entries": [
        "Immediately after you deal damage to a creature with your Divine Smite feature, you can use your Channel Divinity as a bonus action and distribute temporary hit points to creatures of your choice within 30 feet of you, which can include you. The total number of temporary hit points equals {@dice 2d8} + your level in this class, divided among the chosen creatures however you like."
      ]
    },
    {
      "name": "Channel Divinity: Peerless Athlete",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2,
      "entries": [
        "As a bonus action, you can use your Channel Divinity to augment your athleticism. For the next 10 minutes, you have advantage on Strength ({@skill Athletics}) and Dexterity ({@skill Acrobatics}) checks; you can carry, push, drag, and lift twice as much weight as normal; and the distance of your long and high jumps increases by 10 feet (this extra distance costs movement as normal)."
      ]
    },
    {
      "name": "Aura of Alacrity",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "{@i 7th-level Oath of Glory feature}",
        "You emanate an aura that fills you and your companions with supernatural speed, allowing you to race across a battlefield in formation. Your walking speed increases by 10 feet. In addition, if you aren't {@condition incapacitated}, the walking speed of any ally who starts their turn within 5 feet of you increases by 10 feet until the end of that turn.",
        "When you reach 18th level in this class, the range of the aura increases to 10 feet."
      ]
    },
    {
      "name": "Glorious Defense",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Oath of Glory feature}",
        "You can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can use your reaction to grant a bonus to the target's AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one weapon attack against the attacker as part of this reaction, provided the attacker is within your weapon's range.",
        "You can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Living Legend",
      "source": "TACS",
      "page": null,
      "otherSources": [
        {
          "source": "MOT",
          "page": 29
        }
      ],
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Glory",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "{@i 20th-level Oath of Glory feature}",
        "You can empower yourself with the legends—whether true or exaggerated—of your great deeds. As a bonus action, you gain the following benefits for 1 minute:",
        {
          "type": "list",
          "items": [
            "You are blessed with an otherworldly presence, gaining advantage on all Charisma checks.",
            "Once on each of your turns when you make a weapon attack and miss, you can cause that attack to hit instead.",
            "If you fail a saving throw, you can use your reaction to reroll it. You must use this new roll."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."
      ]
    },
    {
      "name": "Oath of the Watchers",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 3,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "The Oath of the Watchers binds paladins to protect mortal realms from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats.",
        "Paladins who follow the Watchers' oath are ever vigilant in spotting the influence of extraplanar forces, often establishing a network of spies and informants to gather information on suspected cults. To a Watcher, keeping a healthy suspicion and awareness about one's surroundings is as natural as wearing armor in battle.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of the Watchers|Paladin|TACS|Watchers|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Watchers|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity|Paladin|TACS|Watchers|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "{@i 3rd-level Oath of the Watchers feature}",
        "You gain the following Channel Divinity options. See the Sacred Oath class feature for how Channel Divinity works.",
        {
          "type": "entries",
          "name": "Watcher's Will",
          "entries": [
            "You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you can choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, you and the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws."
          ]
        },
        {
          "type": "entries",
          "name": "Abjure the Extraplanar",
          "entries": [
            "You can use your Channel Divinity to castigate unworldly beings. As an action, you present your holy symbol and each aberration, celestial, elemental, fey, or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage.",
            "A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly end its move in a space within 30 feet of you. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can take the {@action Dodge} action."
          ]
        }
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Oath of the Watchers feature}",
        "You gain oath spells at the paladin levels listed in the Oath of the Watchers table. See the Sacred Oath class feature for how oath spells work.",
        {
          "type": "table",
          "caption": "Oath of the Watchers Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell alarm}, {@spell detect magic}"
            ],
            [
              "5th",
              "{@spell moonbeam}, {@spell see invisibility}"
            ],
            [
              "9th",
              "{@spell counterspell}, {@spell nondetection}"
            ],
            [
              "13th",
              "{@spell aura of purity}, {@spell banishment}"
            ],
            [
              "17th",
              "{@spell hold monster}, {@spell scrying}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of the Watchers",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "A paladin who assumes the Oath of the Watchers swears to safeguard mortal realms from otherworldly threats.",
        {
          "type": "entries",
          "name": "Vigilance",
          "entries": [
            "The threats you face are cunning, powerful, and subversive. Be ever alert for their corruption."
          ]
        },
        {
          "type": "entries",
          "name": "Loyalty",
          "entries": [
            "Never accept gifts or favors from fiends or those who truck with them. Stay true to your order, your comrades, and your duty."
          ]
        },
        {
          "type": "entries",
          "name": "Discipline",
          "entries": [
            "You are the shield against the endless terrors that lie beyond the stars. Your blade must be forever sharp and your mind keen to survive what lies beyond."
          ]
        }
      ]
    },
    {
      "name": "Aura of the Sentinel",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "{@i 7th-level Oath of the Watchers feature}",
        "You emit an aura of alertness while you aren't {@condition incapacitated}. When you and any creatures of your choice within 10 feet of you roll initiative, you all gain a bonus to initiative equal to your proficiency bonus.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Vigilant Rebuke",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Oath of the Watchers feature}",
        "You've learned how to chastise anyone who dares wield beguilements against you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on an Intelligence, a Wisdom, or a Charisma saving throw, you can use your reaction to deal {@damage 2d8} + your Charisma modifier force damage to the creature that forced the saving throw."
      ]
    },
    {
      "name": "Mortal Bulwark",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Watchers",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "{@i 20th-level Oath of the Watchers feature}",
        "You manifest a spark of divine power in defense of the mortal realms. As a bonus action, you gain the following benefits for 1 minute:",
        {
          "type": "list",
          "items": [
            "You gain {@sense truesight} with a range of 120 feet.",
            "You have advantage on attack rolls against aberrations, celestials, elementals, fey, and fiends.",
            "When you hit a creature with an attack roll and deal damage to it, you can also force it to make a Charisma saving throw against your spell save DC. On a failed save, the creature is magically banished to its native plane of existence if it's currently not there. On a successful save, the creature can't be banished by this feature for 24 hours."
          ]
        },
        "Once you use this bonus action, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."
      ]
    },
    {
      "name": "Oath of Conquest",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of Conquest calls to paladins who seek glory in battle and the subjugation of their enemies. It isn't enough for these paladins to establish order. They must crush the forces of chaos. Sometimes called knight tyrants or iron mongers, those who swear this oath gather into grim orders that serve gods or philosophies of war and well-ordered might.",
        "Some of these paladins go so far as to consort with the powers of the Nine Hells, valuing the rule of law over the balm of mercy. The archdevil Bel, warlord of Avernus, counts many of these paladins—called hell knights—as his most ardent supporters. Hell knights cover their armor with trophies taken from fallen enemies, a grim warning to any who dare oppose them and the decrees of their lords. These knights are often most fiercely resisted by other paladins of this oath, who believe that the hell knights have wandered too far into darkness.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Conquest|Paladin|TACS|Conquest|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Conquest|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Conquering Presence|Paladin|TACS|Conquest|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Guided Strike|Paladin|TACS|Conquest|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Conquering Presence",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to exude a terrifying presence. As an action, you force each creature of your choice that you can see within 30 feet of you to make a Wisdom saving throw. On a failed save, a creature becomes {@condition frightened} of you for 1 minute. The {@condition frightened} creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    },
    {
      "name": "Channel Divinity: Guided Strike",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of Conquest Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell armor of Agathys}, {@spell command}"
            ],
            [
              "5th",
              "{@spell hold person}, {@spell spiritual weapon}"
            ],
            [
              "9th",
              "{@spell bestow curse}, {@spell fear}"
            ],
            [
              "13th",
              "{@spell dominate beast}, {@spell stoneskin}"
            ],
            [
              "17th",
              "{@spell cloudkill}, {@spell dominate person}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of Conquest",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "A paladin who takes this oath has the tenets of conquest seared on the upper arm.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Douse the Flame of Hope",
              "entries": [
                "It is not enough to merely defeat an enemy in battle. Your victory must be so overwhelming that your enemies' will to fight is shattered forever. A blade can end a life. Fear can end an empire."
              ]
            },
            {
              "type": "entries",
              "name": "Rule with an Iron Fist",
              "entries": [
                "Once you have conquered, tolerate no dissent. Your word is law. Those who obey it shall be favored. Those who defy it shall be punished as an example to all who might follow."
              ]
            },
            {
              "type": "entries",
              "name": "Strength Above All",
              "entries": [
                "You shall rule until a stronger one arises. Then you must grow mightier and meet the challenge, or fall to your own ruin."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Aura of Conquest",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, you constantly emanate a menacing aura while you're not {@condition incapacitated}. The aura extends 10 feet from you in every direction, but not through total cover.",
        "If a creature is {@condition frightened} of you, its speed is reduced to 0 while in the aura, and that creature takes psychic damage equal to half your paladin level if it starts its turn there.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Scornful Rebuke",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, those who dare to strike you are psychically punished for their audacity. Whenever a creature hits you with an attack, that creature takes psychic damage equal to your Charisma modifier (minimum of 1) if you're not {@condition incapacitated}."
      ]
    },
    {
      "name": "Invincible Conqueror",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Conquest",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, you gain the ability to harness extraordinary martial prowess. As an action, you can magically become an avatar of conquest, gaining the following benefits for 1 minute:",
        {
          "type": "list",
          "items": [
            "You have resistance to all damage.",
            "When you take the {@action Attack} action on your turn, you can make one additional attack as part of that action.",
            "Your melee weapon attacks score a critical hit on a roll of 19 or 20 on the {@dice d20}."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "Oath of Redemption",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Oath of Redemption sets a paladin on a difficult path, one that requires a holy warrior to use violence only as a last resort. Paladins who dedicate themselves to this oath believe that any person can be redeemed and that the path of benevolence and justice is one that anyone can walk. These paladins face evil creatures in the hope of turning their foes to the light, and they slay their enemies only when such a deed will clearly save other lives. Paladins who follow this path are known as redeemers.",
        "While redeemers are idealists, they are no fools. Redeemers know that undead, demons, devils, and other supernatural threats can be inherently evil. Against such foes, paladins who swear this oath bring the full wrath of their weapons and spells to bear. Yet the redeemers still pray that, one day, even creatures of wickedness will invite their own redemption.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Redemption|Paladin|TACS|Redemption|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Redemption|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Emissary of Peace|Paladin|TACS|Redemption|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Rebuke the Violent|Paladin|TACS|Redemption|TACS|3"
        }
      ]
    },
    {
      "name": "Channel Divinity: Emissary of Peace",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to augment your presence with divine power. As a bonus action, you grant yourself a +5 bonus to Charisma ({@skill Persuasion}) checks for the next 10 minutes."
      ]
    },
    {
      "name": "Channel Divinity: Rebuke the Violent",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "consumes": {
        "name": "Channel Divinity"
      },
      "entries": [
        "You can use your Channel Divinity to rebuke those who use violence. Immediately after an attacker within 30 feet of you deals damage with an attack against a creature other than you, you can use your reaction to force the attacker to make a Wisdom saving throw. On a failed save, the attacker takes radiant damage equal to the damage it just dealt. On a successful save, it takes half as much damage."
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of Redemption Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell sanctuary}, {@spell sleep}"
            ],
            [
              "5th",
              "{@spell calm emotions}, {@spell hold person}"
            ],
            [
              "9th",
              "{@spell counterspell}, {@spell hypnotic pattern}"
            ],
            [
              "13th",
              "{@spell Otiluke's resilient sphere}, {@spell stoneskin}"
            ],
            [
              "17th",
              "{@spell hold monster}, {@spell wall of force}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Tenets of Redemption",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "The tenets of the Oath of Redemption hold a paladin to a high standard of peace and justice.",
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Peace",
              "entries": [
                "Violence is a weapon of last resort. Diplomacy and understanding are the paths to long-lasting peace."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Innocence",
              "entries": [
                "All people begin life in an innocent state, and it is their environment or the influence of dark forces that drives them to evil. By setting the proper example, and working to heal the wounds of a deeply flawed world, you can set anyone on a righteous path."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Patience",
              "entries": [
                "Change takes time. Those who have walked the path of the wicked must be given reminders to keep them honest and true. Once you have planted the seed of righteousness in a creature, you must work day after day to allow that seed to survive and flourish."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "entries": [
            {
              "type": "entries",
              "name": "Wisdom",
              "entries": [
                "Your heart and mind must stay clear, for eventually you will be forced to admit defeat. While every creature can be redeemed, some are so far along the path of evil that you have no choice but to end their lives for the greater good. Any such action must be carefully weighed and the consequences fully understood, but once you have made the decision, follow through with it knowing your path is just."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Aura of the Guardian",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, you can shield others from harm at the cost of your own health. When a creature within 10 feet of you takes damage, you can use your reaction to magically take that damage, instead of that creature taking it. This feature doesn't transfer any other effects that might accompany the damage, and this damage can't be reduced in any way.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Protective Spirit",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, a holy presence mends your wounds in battle. You regain hit points equal to {@dice 1d6} + half your paladin level if you end your turn in combat with fewer than half of your hit points remaining and you aren't {@condition incapacitated}."
      ]
    },
    {
      "name": "Emissary of Redemption",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Redemption",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level, you become an avatar of peace, which gives you two benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to all damage dealt by other creatures (their attacks, spells, and other effects).",
            "Whenever a creature hits you with an attack, it takes radiant damage equal to half the damage you take from the attack."
          ]
        },
        "If you attack a creature, cast a spell on it, or deal damage to it by any means but this feature, neither benefit works against that creature until you finish a long rest."
      ]
    },
    {
      "name": "Oath of The Truth Seeker",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "This oath is taken by paladins who do not know who or what they want to be. Their paths everchanging, but their choices are always theirs to make. By binding themselves to this oath, a paladin swears that through their travels they will find themselves and forge their own destinies, as well as the destinies of others.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of The Truth Seeker|Paladin|TACS|Truth Seeker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Truth Seeker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Traveler's Step|Paladin|TACS|Truth Seeker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Reveal the Truth|Paladin|TACS|Truth Seeker|TACS|3"
        }
      ]
    },
    {
      "name": "Tenets of The Truth Seeker",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i Though the exact words and strictures of the Oath of The Truth Seeker vary, paladins of this oath share these tenets.}",
        {
          "entries": [
            {
              "type": "entries",
              "name": "Truth",
              "entries": [
                "Stay true to yourself, let yourself be free of the fear of judgment and always seek the truth."
              ]
            },
            {
              "type": "entries",
              "name": "Destiny",
              "entries": [
                "Everyone has their own path, but it’s up to you to forge your destiny."
              ]
            },
            {
              "type": "entries",
              "name": "Guide The Lost",
              "entries": [
                "As you aim to follow your own path, always lend a helping hand to those who are lost themselves."
              ]
            },
            {
              "type": "entries",
              "name": "Confidence",
              "entries": [
                "Douse the flames of doubt, believe in yourself and those around you."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of The Truth Seeker Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9"
          ],
          "rows": [
            [
              "3rd",
              "{@spell comprehend languages}, {@spell guiding bolt}"
            ],
            [
              "5th",
              "{@spell augury}, {@spell reveal/conceal|TACS}"
            ],
            [
              "9th",
              "{@spell clairvoyance}, {@spell tongues}"
            ],
            [
              "13th",
              "{@spell divination}, {@spell Mordenkainen's faithful hound}"
            ],
            [
              "17th",
              "{@spell legend lore}, {@spell teleportation circle}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Channel Divinity: Traveler's Step",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "By using your channel divinity you can empower your ability to move and allow yourself to step between planes momentarily. For the next minute, as a bonus action on your turn you can teleport to an unoccupied space within 30 feet of you. You do not have to see the space in order to teleport there."
      ]
    },
    {
      "name": "Channel Divinity: Reveal the Truth",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You can use your channel divinity to peer into a creature's truths. If you have been speaking to a creature for at least a minute, you can use your channel divinity to force that creature to make a Charisma saving throw. On a failed save, you learn their alignment and whether or not they are speaking truthfully. You also learn that creature's type and whether or not their current form is their true form."
      ]
    },
    {
      "name": "Aura of Truth",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, you emanate an aura of revealing truths. You and your allies gain a bonus to Wisdom ({@skill Insight}) and Intelligence ({@skill Investigation}) checks equal to your Charisma modifier  (with a minimum bonus of +1), provided you are not incapacitated.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Guiding Sword",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "At 15th level, being unable to see a creature does not impose disadvantage on your attack rolls, nor does it give them advantage on attack rolls against you. In battle, you can always determine which direction a hostile creature is in if they have made an attack against you or one of your allies in your Aura of Truth within the past minute."
      ]
    },
    {
      "name": "Champion of Truth",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Truth Seeker",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level you can channel your divine power to invoke powerful abilities. As a bonus action, you gain the following benefits for 1 minute:",
        {
          "type": "list",
          "items": [
            "Your movement speed is doubled and you can make one additional weapon attack when you take the {@action Attack} action.",
            "You can always determine whether a creature is lying. When you use this feature, you can retain this benefit for up to 1 hour past the duration.",
            "Each time a hostile creature hits you with an attack or casts a spell on you, they must make a Wisdom saving throw against your spell save DC. On a failed save, they take {@dice 2d10} psychic damage."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."
      ]
    },
    {
      "name": "Oath of Charity",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The oath of charity binds a paladin to the greatest ideals of sacrifice, good will, giving to those in need, and protecting those who need aid. These are warriors who focus their efforts on healing just as much as they do fighting. They hold themselves to never give in to selfish desires, to offer a healing hand to the injured, and to give to those who will not just take.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tenets of Charity|Paladin|TACS|Charity|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Oath Spells|Paladin|TACS|Charity|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Mend the Wounded|Paladin|TACS|Charity|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Channel Divinity: Protect the Weak|Paladin|TACS|Charity|TACS|3"
        }
      ]
    },
    {
      "name": "Tenets of Charity",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i Though the exact words and strictures of the Oath of Charity vary, paladins of this oath share these tenets.}",
        {
          "entries": [
            {
              "type": "entries",
              "name": "Charity",
              "entries": [
                "Give to the poor, especially when you have plenty to make do with."
              ]
            },
            {
              "type": "entries",
              "name": "Sacrifice",
              "entries": [
                "Always be willing to pay the ultimate price for the benefit of others."
              ]
            },
            {
              "type": "entries",
              "name": "Tempered",
              "entries": [
                "Stay true to your emotions, but never let them consume you. "
              ]
            },
            {
              "type": "entries",
              "name": "Heal and Protect",
              "entries": [
                "Heal the weakened innocents, and ensure they are not harmed again."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Oath Spells",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain oath spells at the paladin levels listed.",
        {
          "type": "table",
          "caption": "Oath of Charity Spells",
          "colLabels": [
            "Paladin Level",
            "Spells"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9"
          ],
          "rows": [
            [
              "3rd",
              "{@spell healing word}, {@spell shield of faith}"
            ],
            [
              "5th",
              "{@spell healing spirit|XGE}, {@spell shielding vitality|TACS}"
            ],
            [
              "9th",
              "{@spell create food and water}, {@spell life transference|XGE}"
            ],
            [
              "13th",
              "{@spell aura of life}, {@spell ward of vitality|TACS}"
            ],
            [
              "17th",
              "{@spell greater restoration}, {@spell mass cure wounds}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Channel Divinity: Mend the Wounded",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You can hasten your efforts to heal a wounded creature using your channel divinity. For the next minute, you can use your Lay on Hands feature as a bonus action rather than an action. Also for the duration, when you restore hit points to a creature using a spell of 1st level or higher, you can add a bonus to the roll equal to your proficiency bonus."
      ]
    },
    {
      "name": "Channel Divinity: Protect the Weak",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You can use your channel divinity to protect an ally from the jaws of defeat. When a creature you can see within 60 feet of you would be reduced to 0 hit points, you can use your reaction to have them be reduced to 1 hit point instead."
      ]
    },
    {
      "name": "Aura of Regeneration",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Starting at 7th level, you can keep others alive when they are struggling through the midst of battle. When a creature (other than yourself) with less than half of their maximum hit points starts their turn within 10 feet of you, they regain a number of hit points equal to your Charisma modifier.",
        "At 18th level, the range of this aura increases to 30 feet."
      ]
    },
    {
      "name": "Shield the Wounded",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "At 15th level, you can use a bonus action to choose a creature you can see within 60 feet of you that doesn’t have all of their hit points. Until the start of your next turn, creatures have disadvantage on attack rolls against the chosen creature.",
        "You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Giver of Life",
      "source": "TACS",
      "page": null,
      "className": "Paladin",
      "classSource": "TACS",
      "subclassShortName": "Charity",
      "subclassSource": "TACS",
      "level": 20,
      "header": 2,
      "entries": [
        "At 20th level you can channel your divine power to invoke powerful healing abilities. As a bonus action, you gain the following benefits for 1 minute:",
        {
          "type": "list",
          "items": [
            "When you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die.",
            "When you cast a spell that restores hit points using a 1st-level spell slot or higher, the spell is treated as if it were one level higher than the expended slot.",
            "If a creature within 30 feet of you fails a saving throw, you can spend your reaction and a 1st-level or higher spell slot to have them re-roll. They must use the new result."
          ]
        },
        "Once you use this feature, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."
      ]
    }
  ],
  "spell": [
    {
      "name": "Air Promenade",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform elegant and rhythmic movements to allow yourself to dance through the air effortlessly as powerful winds lift you off the ground. For the duration, you have a flying speed equal to your walking speed and can hover, but you cannot ascend any higher than 10 feet off the ground. ",
        "When the spell ends, you safely descend to the ground, provided you are no higher than 20 feet. If you are higher than 20 feet when the spell ends, you fall at a normal rate."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 4th level or higher, the duration is 8 hours. If you use a spell slot of 6th level or higher, the duration is 24 hours. Using a spell slot of 4th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Aquarius's Veil",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A gilded gemstone worth 500 gp filled with ocean water",
          "cost": 50000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You don yourself with a veil of watery armor. Until the spell ends, you have the following benefits:",
        {
          "type": "list",
          "items": [
            "You have immunity to fire damage and resistance to cold damage.",
            "You have a swim speed of 80 feet and can breathe underwater as you do air.",
            "While you're not wearing armor, your armor class becomes 14 + your Dexterity modifier and you have advantage on Strength and Dexterity saving throws.",
            "You have advantage on attack rolls made with daggers, javelins, shortswords, spears, or tridents and you can use your spellcasting ability for the attack and damage rolls made with such weapons in place of Strength or Dexterity.",
            "You gain 60 temporary hit points. If any of these remain when the spell ends, they are lost."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Fiery Earth",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and fire, syncing together in a perfect harmony. Until the spell ends, the target is wreathed in magical flames that retaliate against creatures that hit them with melee attacks, dealing {@damage 1d8} fire damage to the attacker.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of earth and the elemental plane of fire. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} fire or poison damage.",
        "Also, whenever a creature under the effects of this spell heals a creature with a spell, they can add {@dice 1d8} healing to one of the rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire",
        "poison"
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Flowing Life",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and water, syncing together in a perfect harmony. Until the spell ends, the target has a swim and climb speed of 60 feet and do not suffer penalties to their speed while traversing through difficult terrain.",
        "In addition, the target can empower their ability to heal immensely by channeling both of the primordial energies of the elemental plane of earth and the elemental plane of water. Whenever they heal a creature with a spell, they can add an additional {@dice 2d8} healing to one of the rolls from the spell.",
        "In addition, when they heal a creature with a spell, they can remove any one condition or disease, or they can remove one level of {@condition exhaustion}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Storms",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of air and water, syncing together in a perfect harmony. Until the spell ends, the target has a flying speed of 60 feet and can hover.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of air and the elemental plane of water. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} lightning or thunder damage and creatures who take this damage are pushed up to 10 feet away from the attacker or source of the spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "lightning",
        "thunder"
      ],
      "miscTags": [
        "FMV"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Blade of Frost",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "sphere",
        "distance": {
          "type": "feet",
          "amount": 5
        }
      },
      "components": {
        "s": true,
        "m": "a melee weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You brandish the weapon used in the spell's casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack's normal effects and then ice begins to creep from the point of impact. The target's speed is reduced by 10 feet until the start of your next turn.",
        "This spell's damage increases when you reach certain levels. At 5th level, the melee attack deals an extra {@damage 1d8} cold damage to the target on a hit. The extra damage increases by {@dice 1d8} at 11th level ({@dice 2d8}) and again at 17th level ({@dice 3d8})."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Blustering Winds",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You extend your hands and gales of wind blows around you in a 10 foot radius centered on you. Creatures within range make a strength saving throw. On a failed save, the creature takes {@damage 1d10} bludgeoning damage and is pushed 10 feet back and knocked {@condition prone}. On a success, they take half damage and suffers no additional effects."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Boulder Bash",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a giant rock and throw it in a 5-foot-wide 30-foot-long line. Each creature within range must make a Dexterity saving throw, taking {@damage 3d10} bludgeoning damage and is knocked {@condition prone} on a failed save or half as much on a success and is not knocked {@condition prone}. When the rock reaches the end of its range, or if it hits a wall, the rock vanishes. If it hits a wall, the wall automatically takes damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd"
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Burning Touch",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You ignite your hands with red hot flames and attempt to burn a creature. Make a melee spell attack, on hit it takes {@damage 2d8} fire damage and must make a Constitution saving throw. On a failed save, they are caught on fire and takes an additional {@damage 1d8} fire damage at the start of each of their turns for the duration. A creature can use its action to put out the flames, or at the end of each of the affected creature's turn it can repeat its Constitution save, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "spellAttack": [
        "M"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Charity",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You touch a creature and imbue them with a small pool of your magical power, which can restore them in two different ways. If the target is a spellcaster, you can have it regain one of its expended spell slots of 2nd level or lower. If the target is not a spellcaster, or if it chooses not to regain a spell slot, it instead regains a number of hit points equal to {@dice 4d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the maximum expended slot level that can be regained increases by 1 and the healing increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Chilling Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The next time you hit with a melee weapon attack during this spell's duration, your weapon is freezing cold to the touch, and the attack deals an extra {@damage 1d8} cold damage. If the target is a creature, at the start of its next turn it must succeed a Constitution saving throw or have their movement speed cut in half until the spell ends. The creature may repeat its save at the start of each of its turns until the spell ends, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cold Snap",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You snap your fingers and a burst of cold energy cracks at a point you choose within range. Each creature in a 15-foot-radius sphere centered on that point must make a Constitution saving throw. A target takes {@damage 6d6} cold damage and their movement is reduced to 0 until the start of your next turn on a failed save, or half as much damage on a successful one and their speed is not reduced.",
        "The cold vapors spread around corners. It freezes non-magical objects and liquid in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@damage 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Contact Ancient Spirits",
      "source": "TACS",
      "level": 3,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny statue made of gold or silver worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "You reach out to the great beyond to call upon the wisdom of ancient souls of long dead scholars. Three tiny sized spirits which take the forms of balls of light float around you within range of the spell. You can ask each of the spirits a single question, which they must answer truthfully. After a spirit has answered your question, it disappears. You must ask your questions before the spell ends.",
        "Each spirit has a +10 to any Intelligence ability check, though depending on the question, a check may or may not be required (DM's choice). If a check is required, the DM determines the DC based on the rarity of the answer, the rarest resulting in a DC 30, whereas an uncommon answer results in a DC 15. The spirit takes the form of a creature who may know the answer to your question when it is asked. The creature does not have to be humanoid. A failed check results in the spirit being unable to answer the question, and disappears out of embarrassment or prideful arrogance.",
        "The spell fails if you have cast it within the last 24 hours."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Counterspell",
      "source": "TACS",
      "otherSources": [
        {
          "source": "PHB",
          "page": 228
        }
      ],
      "level": 3,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a creature within 60 feet of you casting a spell and you are not casting a spell."
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You attempt to interrupt a creature in the process of casting a spell. Make an ability check using your spellcasting ability and add your proficiency bonus to the roll. The DC equals the caster’s spell save DC. On a success, its spell fails and has no effect.",
        "On a failure, their spell succeeds but its effects are dampened as your spell acts as a buffer for its effects. The spell’s damage, healing, range, and duration is halved. If there was nothing to halve, this spell simply has no effect. If your check fails by 5 or more, this spell also has no effect.",
        "An astute caster can recognize when their spell is about to fail and attempt to reinforce it with their own magic. A creature with proficiency in arcana can use their reaction to add to the DC equal to the level they are casting their own spell at."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, you can add a +1 bonus to  your spellcasting ability check used for the spell for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ],
        "fromSubclass": [
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption (UA)",
              "source": "UAATrioOfSubclasses"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption",
              "source": "XGE"
            }
          },
          {
            "class": {
              "name": "Sorcerer",
              "source": "PHB"
            },
            "subclass": {
              "name": "Clockwork Soul (UA)",
              "source": "UA2020SubclassesPt2"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers (UA)",
              "source": "UA2020SubclassesPt1"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers",
              "source": "TCE"
            }
          }
        ]
      },
      "races": [
        {
          "name": "Human (Mark of Sentinel)",
          "source": "ERLW",
          "baseName": "Human",
          "baseSource": "PHB"
        }
      ],
      "backgrounds": [
        {
          "name": "Azorius Functionary",
          "source": "GGR"
        }
      ]
    },
    {
      "name": "Creeping Cold",
      "source": "TACS",
      "level": 5,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pinch of powdered snow"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You choose a creature within range that you can see and mark them with a freezing cold brand. Ice begins to slowly creep from the ground beneath their feet to the tip of their head, covering the body with ice. The creature must make a Constitution saving throw. On a failed save, they take {@damage 6d6} cold damage and is {@condition restrained} as they are frozen to the ground. If the creature is airborne, a pillar of ice is made between the creature and the ground. The ice occupies the spaces in between it and the ground and the creature's elevation remains the same. The spell fails if the creature is more than 30 feet off the ground. On a successful save, the creature takes half damage and isn't affected. A creature is also unaffected by the spell if it has immunity to cold damage or being {@condition petrified} and a creature with resistance to cold damage has advantage on its saves against the spell.",
        "A creature affected by the spell must make another Constitution saving throw at the end of each of its turns. On a failed save, it takes an additional {@damage 2d6} cold damage or half as much on a success. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to a frozen statue and subjected to the {@condition petrified} condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.",
        "A creature may use its action to break off a piece of the ice. Doing so counts as one successful save for the purposes of the spell. Every time the creature takes any amount of piercing or fire damage counts as one successful save."
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cutting Wind",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "Magical winds build up in your hands and launch out to a creature within range. Make a ranged spell attack. On hit, the target takes {@damage 1d6} slashing damage and are left scarred with magic. Until the start of your next turn, the next weapon attack that hits the target deals an additional {@damage 1d6} damage of the weapon's type.",
        "This spell's damage increases when you reach certain levels. At 5th level, the attack's damage increases by {@damage 1d6} ({@dice 2d6}). Both damage rolls increase by {@dice 1d6} at 11th level ({@dice 3d6} and {@dice 2d6}) and the attack again increases by {@dice 1d6} at 17th level ({@dice 4d6} and {@dice 2d6})."
      ],
      "damageInflict": [
        "slashing"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cyclone",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You summon a brief powerful windstorm to launch your enemies into the air. Choose a point within range, you summon a swirling windstorm in a 20-foot tall 20-foot radius cylinder. Every creature within the cylinder makes a Strength saving throw. On a failed save, they take {@damage 6d6} bludgeoning damage and are pulled to the top of the cylinder toward the center, falling to the ground afterward. On a success they take half as much and are not pulled."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Destruct Riff",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A musical instrument worth at least 1 sp"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You play a quick and powerful musical performance. Make a ranged spell attack against a creature or object to assail it with the rupturing power of song. On a hit, the target takes {@damage 1d8} thunder damage and are pushed 5 feet away from you.",
        "If you hit a construct target, it also has disadvantage on attack rolls against you until the end of your next turn.",
        "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), and 17th level ({@dice 4d8})."
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "FMV"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine Avatar",
      "source": "TACS",
      "level": 12,
      "school": "T",
      "subschools": [
        "epic spell"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A crystal or gem containing the soul of a dead god worth at least 100,000 gp"
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You assume the form of a god of your choosing. You become an avatar of said god, using an appropriate statblock. If one is not otherwise provided, you use the Divine Avatar statblock and if you do, choose from one of the listed domains: Arcana, Death, Forge, Grave, Knowledge, Life, Light, Nature, Order, Peace, Tempest, Trickery, Twilight, or War. You gain certain statistics depending on the domain you chose.",
        "You maintain this form for the duration, until your hit points is reduced to 0 in that form, or until you dismiss the spell as an action. Becoming even the avatar of a god, even for a moment, is a taxing endeavor. You gain three levels of {@condition exhaustion}, which cannot be recovered until you complete a long rest for each individual {@condition exhaustion} level. In addition, you lose the ability to cast spells until you finish a long rest."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Fiery Chains",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You launch outward a chain of fire that wraps around a target of your choice that you can see within range. Three additional chains then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the chains.",
        "A target must make a Dexterity saving throw. The target takes {@damage 6d6} fire damage and is {@condition restrained} on a failed save, or half as much damage and is not {@condition restrained} on a success.",
        "A {@condition restrained} creature takes {@damage 2d6} fire damage at the start of its turns and can use its action to attempt to break out of the chains by making a successful Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, one additional chain leaps from the first target to another target for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Flames of Life or Death",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "A wave of fiery energy washes out from a point centered on yourself. Choose either life or death. You can expend one of your Hit Dice and make three rolls using the size of the chosen Hit Die. You take damage equal to the total number rolled as burns envelop your body and your constitution is used to fuel the spell. You then apply one of the following effects depending on what you chose:",
        "{@b Death.} Every other creature in that area needs to make a Dexterity saving throw, taking fire damage equal to the total number rolled plus your spellcasting ability modifier on a failed save, or half as much on a success.",
        "{@b Life.} Every other creature you choose in that area regains hit points equal to the total number rolled plus your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, the number of dice rolled increases by one for each slot level above 6th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Encore",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a spell being cast"
        }
      ],
      "range": {
        "type": "special"
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "special"
        }
      ],
      "entries": [
        "When you see a 2nd level or lower spell being cast, you can immediately use your reaction to cast that spell, using its range and duration for this spell's. If you do not meet the requirements of the spell, such as having costly material components or a specific prerequisite listed in the spell, the spell fails. The spell also fails if the casting time is not an action or bonus action.",
        "When you cast that spell in this way, it is cast at its lowest level, but uses your spellcasting ability for it."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the level of spell you can encore can be one level higher for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fairy Fun",
      "source": "TACS",
      "level": 1,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You summon forth the mischief of the fey and implore various pranks and tricks onto a creature, causing them one of varying effects. Choose a creature that you can see within range, they suffer one of the following effects of your choosing for the duration, or until you end the spell as a bonus action.",
        {
          "type": "entries",
          "name": "Hallucinations",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, they have disadvantage on {@skill Perception} checks that rely on sight, as colorful and misty visions of various fey creatures cloud their vision. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Tumbling Fool",
          "entries": [
            "The target makes a Dexterity saving throw. On a failed save, they have disadvantage on Dexterity-based attack rolls and Dexterity ability checks, as they begin to tumble and fool around. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Babble of Doom",
          "entries": [
            "The target makes a Charisma saving throw. On a failed save, they have disadvantage on Charisma ability checks as they begin to babbling over their words like a fool. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Forgetful Idiot",
          "entries": [
            "The target makes an Intelligence saving throw. On a failed save, they struggle to recall specific details on anything, such as a name, yet they always have that feeling of familiarity as if the information is constantly on the tip of their tongue. They have disadvantage on Intelligence ability checks. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Beware the Bear",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, everyone in their vision appears as a giant, terrifying bear that fills them with a magical fear. The target is {@condition frightened} for the duration. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Why is it Always Chickens?!",
          "entries": [
            "The target makes a Strength saving throw. On a failed save, countless chickens flock from out of nowhere and bombard the target, causing them to fall {@condition prone}. This effect repeats at the end of each of the target's turns, until they succeed against it three times, ending the effect."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fey Transformation",
      "source": "TACS",
      "level": 3,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a gilded flower from the feywild worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with an iridescent aura that allows you to take the visage of a creature from the feywild. When you cast the spell, you choose one of the following forms to assume: Fuming, Mirthful, or Tricksy.",
        {
          "type": "entries",
          "name": "Fuming",
          "entries": [
            "Your iridescent aura becomes a fiery aura which empowers you with the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "Your weapon and spell attacks deal an additional {@damage 1d6} fire damage on hit.",
            "You emit bright light out to a range of 30 feet and dim light for an additional 30 feet.",
            "Creatures that hit you with melee attacks take {@damage 1d6} fire damage."
          ]
        },
        {
          "type": "entries",
          "name": "Mirthful",
          "entries": [
            "Your iridescent aura becomes a shimmering sparkle that makes you more appealing, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You have advantage on Charisma ({@skill Persuasion}) checks.",
            "Creatures you choose that can hear you speak must make a Wisdom saving throw or become {@condition charmed} by you until the spell ends, or until you or your allies do something hostile toward them after they were {@condition charmed}.",
            "You have advantage on Charisma saving throws and are immune to being {@condition charmed}."
          ]
        },
        {
          "type": "entries",
          "name": "Tricksy",
          "entries": [
            "Your iridescent aura becomes a shadowy veil, protecting you from sight, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You become {@condition invisible} until the spell ends, or until you make an attack or cast a spell. At the start of each of your turns, you become {@condition invisible} again if you weren't already.",
            "You have advantage on Dexterity and Intelligence saving throws.",
            "If you make an attack roll with advantage, you deal an additional {@damage 1d6} psychic damage on hit."
          ]
        },
        "As a bonus action on your turn, you can shift your form to a different one, losing the previous benefits and gaining the new ones until the spell ends. Doing so halves the current duration of the spell."
      ],
      "conditionInflict": [
        "charmed"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Flames of Avernus",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "cone",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "A wave of heat bursts out of your hands originating from the nine hells, incinerating creatures in a 120-foot cone of fire. Each creature within range makes a Constitution saving throw. On a failed save they take {@damage 20d6} fire damage and are lit on fire for the duration. Creatures who failed take {@damage 5d6} fire damage at the start of each of their turns. As an action, a creature can attempt to put out the flames with a Dexterity ability check against your spell save DC. A creature that attempts this, pass or fail, takes {@damage 2d6} fire damage. On a success, the flames are put out and its effects no longer persist. On a fail, the flames and the spell persists.",
        "On a successful save, the creatures take half the initial damage and are not lit on fire.",
        "A creature who dies while under the effects of the spell has their body immediately turned to scorched ash, leaving behind only any magical items they had in their possession."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Transformation",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A chunk of rare precious metal worth 1000 gp infused with magical moss, which the spell consumes",
          "consumed": true,
          "cost": 100000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You assume a magical form by mimicking the powers of Gaia. Your body becomes stone and moss forms randomly around your body. Choose either Guardian or Warrior. You gain the following benefits depending on what you chose when you cast the spell:",
        {
          "type": "list",
          "items": [
            "You are immune to poison; bludgeoning, piercing, and slashing damage from non-magical weapons that are not adamantine. You have resistance to slashing, piercing, and bludgeoning damage regardless of the source.",
            "You are immune to the {@condition poisoned} and {@condition petrified} conditions.",
            "Your size becomes one size category larger. If you were gargantuan, you become twice as large. As a result, you deal twice as much damage with weapons against objects.",
            "You have a burrow speed of 40 feet and can move through solid stone effortlessly, leaving the earth untampered with as you pass by.",
            "You have a +2 bonus to AC (Guardian), or you have a +2 bonus to Strength, Dexterity, and Constitution saving throws (Warrior).",
            "All your weapon attacks are magical, and when you make a weapon attack, you can use your spellcasting ability modifier, instead of Strength or Dexterity, for the attack and damage rolls.",
            "You gain 100 temporary hit points (Guardian) or you gain 50 temporary hit points (Warrior). If any of these remain when the spell ends, they are lost.",
            "Your weapon attacks deal an additional {@damage 2d10} bludgeoning damage (Warrior) or when you're not wearing armor, your AC becomes 20. You can still gain the benefits of a shield while under the effects of this spell (Guardian).",
            "(Warrior) You can attack twice, instead of once, when you take the {@action Attack} action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that lets you attack more than once when you take the Attack action on your turn; (Guardian) or you can use your action to form a protective barrier on any number of allies within 30 feet of you, protecting them from damage from one source reducing that damage to 0 (such as a weapon, spell, a dragon's breath weapon, etc.). This barrier lasts until the start of your next turn."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 300
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small chunk of a meteorite"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a large object made of stone which appears 200 feet above the point you choose. The stone can take any shape or appearance, so long as it is purely made of a form of earth. The object crashes directly onto the point you choose and creates. Each creature within a 60-foot radius makes a dexterity saving throw or takes {@damage 40d6} bludgeoning damage from the debris, or half as much on a success. ",
        "Objects in the area automatically take twice as much damage. ",
        "A 60-foot radius and 30-foot deep creator is left in the wake of the object, with the object completely destroyed and gravel fills the area, making it difficult terrain"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gale of The Primordials",
      "source": "TACS",
      "level": 9,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a wing from a powerful creature, such as an angel or winged beast from the elemental plane of air"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "A powerful wind builds up from your feet, granting you unmatched flight. You gain a flying speed of 150 feet for the duration. You take no damage as a result of falling and are immune to being {@condition grappled} or {@condition restrained} as wind rushes from you, preventing anything from keeping hold of you.",
        "Ranged attacks made against you have disadvantage and automatically miss if you are within their long range distance."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Giant's Strength",
      "source": "TACS",
      "level": 2,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a piece of mithral or adamantine worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body, empowering you with the might of giants. If your Strength score is lower than 19, it becomes 19 for the duration. If your strength score is being reduced by any effect, the reduction is still applied."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, your Strength score increases by 2 for every two slot levels above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Glacial Grip",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You release a magical hand made of freezing cold ice toward a creature you can see. Make a ranged spell attack against that creature. On a hit, the hand grasps onto the target and it takes {@damage 1d8} cold damage, and on each of your turns for the duration, you can use a bonus action to deal {@damage 1d8} cold damage to the target automatically, except the turn you cast the spell. Each time the target takes damage from the spell, its speed is reduced by 10 feet. The creature makes a constitution saving throw at the end of each of its turns, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by {@damage 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT",
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guided Hand",
      "source": "TACS",
      "level": 1,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You touch a creature, granting them the ability to strike true. Once before the spell ends, the target can give themself advantage on one weapon attack roll on their turn, as a spectral hand from a comforting source guides their attack. That attack deals an extra {@damage 1d6} radiant or necrotic damage on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Guise of The Blood Witch",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a vile of humanoid blood engraved with arcane sigils worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Uttering an incantation, you draw on the magic of the blood witch to transform yourself. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "You are immune to being {@condition charmed} and have advantage on saving throws against enchantment spells.",
            "Whenever you take damage from a spell or effect originating from yourself, you can choose to not take damage once on each of your turns.",
            "You have a magical flying speed of 30 feet and you can hover.",
            "You gain 30 temporary hit points. If any of these remain when the spell ends, they are lost.",
            "You can use a bonus action on each of your turns to turn your gaze to a creature you can see within 60 feet. That creature makes a wisdom saving throw or takes {@damage 4d6} necrotic damage and is {@condition frightened} until the spell ends. They take half damage and are not {@condition frightened} on a successful save."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guise of the Haunted Fey",
      "source": "TACS",
      "level": 0,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with haunting lights and illusory sounds, making you look and sound like a horrifying fey creature from the Unseelie court. For the duration, you have advantage on Charisma ({@skill Intimidation}) checks."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Heart Sunder",
      "source": "TACS",
      "level": 4,
      "school": "N",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of blood from a humanoid"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You fill a creature you choose within range that you can see with necrotic energy. You cause their heart to beat rapidly and then stop momentarily. The creature makes a constitution saving throw taking {@damage 8d6} necrotic damage and is {@condition stunned} until the start of your next turn on a failed save, or half as much and is not {@condition stunned} on a success. Undead and Constructs automatically pass the saving throw of this spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 and the duration increases by 1 additional round for each slot level above 4th."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "stunned"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Investiture of Water",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Until the spell ends, your body takes a watery appearance, and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to cold; bludgeoning, piercing, and slashing damage from non-magical attacks.",
            "You have a swim speed of 60 feet and can breathe underwater as you do air.",
            "You are always treated as if you were submerged underwater.",
            "You can use your action to create a 10 foot long whip made of water. You can use a bonus action to attack with the whip. When you do, make a melee spell attack with a range of 10 feet. On hit, the water whip deals {@dice 2d4} plus your spellcasting ability modifier bludgeoning damage and the target makes a Strength saving throw. On a failed save, they are knocked {@condition prone}.",
            "You can use your action to control nearby water to snare your enemies. Choose a creature within 30 feet of a pool of water that is within 120 feet of you. That creature must make a Dexterity saving throw or be {@condition restrained}. You can use a bonus action to drag a creature {@condition restrained} in this way 10 feet closer to the pool. Once the creature is close enough, it can be dragged underneath the pool of water. A creature can use an action to repeat its Strength save, ending the {@condition restrained} effect on a success."
          ]
        }
      ],
      "damageResist": [
        "fire"
      ],
      "damageImmune": [
        "cold"
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "N",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Lightning Spear",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "an electrified twig"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You create a bolt of lightning in your hand and throw it at a creature you can see within range. Make a ranged spell attack, on hit you deal {@damage 3d10} lightning damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d10} for each slot level above 2nd. When you cast this spell using a spell slot of 4th level or higher, you can create one additional bolt and throw it at another creature or the same creature, but it only deals {@damage 2d10} lightning damage on hit. When you cast this spell using a spell slot of 7th level or higher, the second bolt increases to {@damage 4d10} damage."
          ]
        }
      ],
      "damageInflict": [
        "lightning"
      ],
      "spellAttack": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      },
      "fluff": {
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://img.game8.co/3498526/93b71a6524daa52afd9d3c4c8136a857.png/show"
            }
          }
        ]
      }
    },
    {
      "name": "Lightning Whip",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You evoke an electrifying whip in your free hand. It is similar in size and shape to an actual whip, and it lasts for the duration. It has the light and reach properties. If you let go of the whip, it disappears, but you can evoke the whip again as a bonus action.",
        "You can use your action to make a melee spell attack with the lightning whip. On a hit, the target takes {@damage 3d4} lightning damage and it must succeed on a Strength saving throw. On a fail, the target is knocked {@condition prone}.",
        "In addition, you can use your bonus action to make a melee spell attack with the lightning whip, however it instead deals {@damage 1d4} lightning damage on hit instead of {@dice 3d4}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d4} for every two slot levels above 2nd."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Metronome",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You point at a creature you can see within range and use rhythmic movements to build up momentum and damage them. The target makes a Dexterity saving throw, taking {@damage 6d6} force damage and is marked by the spell on a failed save, or half as much on a success and are not marked. ",
        "While marked, you can use an action or a bonus action to deal {@damage 2d6} force damage to them, but you can only do so once per round and not on the turn you cast the spell. Each time the target takes this damage, they can repeat their save, ending the effect on a success.",
        "After the first round you cast the spell, if you do not use your action or bonus action to deal damage to the target with this spell, your concentration ends early."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ode of Seasons",
      "source": "TACS",
      "level": 1,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 50 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a magical song that empowers a target within range (you can choose yourself). Choose from Autumn, Winter, Spring, or Summer. The target gains the following benefits depending on what you chose:",
        {
          "name": "Autumn",
          "type": "entries",
          "entries": [
            "The target has advantage on Charisma ability checks."
          ]
        },
        {
          "name": "Winter",
          "type": "entries",
          "entries": [
            "The target has resistance to cold damage."
          ]
        },
        {
          "name": "Spring",
          "type": "entries",
          "entries": [
            "The target has advantage on saving throws made to resist being {@condition charmed} or {@condition frightened}."
          ]
        },
        {
          "name": "Summer",
          "type": "entries",
          "entries": [
            "The target has resistance to fire damage."
          ]
        }
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or 3rd level, you can maintain your concentration on the spell for up to 1 hour. When you use a spell slot of 4th level or higher, you can maintain your concentration on the spell for up to 8 hours."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Poseidon's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 500
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a wave of immeasurable force in a 500-foot-high, 500-foot-long, 100-foot-thick. Every creature and object in the area makes a Strength saving throw. On a failed save, every creature takes {@damage 12d10} bludgeoning damage and {@damage 12d10} cold damage and are knocked {@condition prone} and pushed to the end of the wave. Objects take twice the amount of damage and automatically fail the save. Creatures that save take only half damage and are pushed only half the distance they normally would be pushed and are not knocked {@condition prone}.",
        "Magical and non-magical fire in the area is immediately extinguished and creatures who took the damage from this spell gains resistance to fire damage for the next minute. Spells that set creatures on fire and persist immediately end on affected creatures.",
        "The area affected is not flooded, as the water dissipates after the spell takes effect."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Primordial Mark",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body and weapons you are holding. Choose from acid, cold, fire, lightning, or thunder. Until the spell ends, your weapon attacks deal an extra {@dice 1d4}  damage of the chosen type on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Reveal/Conceal",
      "source": "TACS",
      "level": 2,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pair of glass lenses with drops of spring water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "permanent",
          "ends": [
            "dispel"
          ]
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "For the duration, you can reveal or conceal the presence of magic on objects within range. Choose reveal or conceal and apply the appropriate effect:",
        {
          "type": "entries",
          "name": "Reveal",
          "entries": [
            "You can emanate an aura that reveals whether or not there is magic on every object within range. A magical mark appears on the object if it is magical. The mark that appears resembles the school of magic the object is affected by, otherwise a generic mark is created if there is no specified school of magic. The mark remains so long as it is within range of the aura.",
            "If the object is under the conceal effects of this spell, it is suppressed while it is within range of the aura. If the object is being protected by divination magic, like being under the effects of the {@spell nondetection} spell, make an ability check using your spellcasting ability. The DC equals 10 + the level spell that was used to protect it. If a spell was not used to protect it, the DM determines an appropriate DC. On a successful check, the effect is suppressed while the object is within range of the aura.",
            "You can also reveal a message being hidden by magic, such as from the {@spell illusory script} or the conceal effects of this spell. The message is revealed in a language you understand."
          ]
        },
        {
          "type": "entries",
          "name": "Conceal",
          "entries": [
            "Choose any number of objects within range, if the chosen objects are magical, they become hidden from divination magic. The objects can't be targeted by any divination magic, perceived through magical scrying sensors, and the magic on them cannot be revealed by the effects of divination magic, such as the {@spell detect magic} spell, except by the reveal effects of this spell.",
            "You can also choose to hide text from a non-magical object. Whether this text is written, carved, or magically scribed onto the object, the text becomes {@condition invisible} or is re-written in symbols that have no real meaning.",
            "Any of these effects remains on the objects until dispelled."
          ]
        },
        "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
      ],
      "areaTags": [
        "MT",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Rock Slide",
      "source": "TACS",
      "level": 1,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small rock"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a series of falling rocks at a point you can see within range in a 15-foot tall, 15-foot-long, and 5-foot-wide line. Every creature in the line makes a Dexterity saving throw, taking {@damage 3d6} bludgeoning damage and fall {@condition prone} on a failed save, or half as much on a success and are not knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "dexterity"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "L"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Scholar's Armament",
      "source": "TACS",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "s": true,
        "m": "A gemstone worth at least 50 gp and a martial or simple weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You imbue magical power into a weapon you are holding. The weapon must have the required gemstone fashioned onto it in some way, whether it is on the pommel or on the blade of the weapon itself. For the duration, you can use your spellcasting ability instead of Strength or Dexterity for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage becomes {@dice 1d4} plus your spellcasting modifier. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "The weapon's damage die becomes a {@dice d6} when you reach 5th level, a {@dice d8} at 11th level, and a {@dice d10} at 17th level."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Shielding Vitality",
      "source": "TACS",
      "level": 2,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you or a creature within range would take damage"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You can prevent harm from coming to you or your allies. As a reaction when you or a friendly creature who doesn't have all of its hit points would take damage within range, you can reduce the damage that creature would take by {@damage 1d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Slipstream",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a few drops of oil and water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "entries": [
        "You create a low-cresting wave of water that carries the target along the surface of water or the ground. The target's walking speed is increased by 20 feet until the spell ends. In addition, swimming does not cost the target any additional movement. If the target had a swim speed, it is increased by 30 feet until the spell ends."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Courage",
      "source": "TACS",
      "level": 1,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 20
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power to rally you and your allies within range with courage. For the duration, you and every willing ally within range that is not {@condition deafened} has advantage on saving throws made to avoid or end the {@condition frightened} condition, also they gain a +1 bonus to attack rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the bonus increases to +2, creatures within range are immune to being {@condition frightened}, and their weapon attacks are treated as magical if they weren't already. When you use a spell slot of 5th level or higher, the bonus increases to +3 and creatures within range are immune to being {@condition charmed}."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Misdirection",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power that misdirects your enemies and forces them to focus their attention toward yourself or another creature. Choose a creature within range that you can see (you can choose yourself), up to three creatures you choose within 20 feet of the initial target must make a Wisdom saving throw, regarding the initial target as hostile and the most dangerous threat on a failed save. If the initial target was well-known or friendly to the chosen creatures affected by the spell, they have advantage on the save.",
        "While under the effects of the spell, they are compelled to target the chosen creature with any and all attacks and spells they can utilize. An example of the compulsion could be that they believe that the target has a bounty on their head with a very high reward, but it is up to the DM to determine a proper reason why they would be compelled by the spell. At the end of an affected creature's turn, they can repeat their Wisdom save, ending the effect on a success. The spell ends early if the initial target is reduced to 0 hit points or dies.",
        "A creature is immune to the effects of the spell if they are immune to being {@condition charmed}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can choose one additional creature to make a save against the spell for each slot level above 2nd. When you cast this spell using a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. Using a spell slot of 8th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Static Discharge",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        },
        {
          "number": 1,
          "unit": "round"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 15
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a copper rod"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Electric energy builds up within you and you release it outward in a powerful burst of energy. Each creature (except yourself) within range makes a Dexterity saving throw, taking {@damage 3d8} lightning damage  and is {@condition stunned} until the end of your next turn on a failed save, or half as much on a success and is not {@condition stunned}.",
        "Rather than using it's normal casting time, you can instead spend your entire turn building up energy and cast it immediately at the start of your next turn, taking up your action for your next turn. When you do so, creatures have disadvantage on the saving throw and you add two additional damage dice. In addition, the radius is increased by an additional 5 feet. See 'Longer Casting Times' on page 202 of the Player's Handbook for reference on casting a spell for longer than 1 action.",
        "Charging the spell leaves you fatigued for a time. You gain one level of {@condition exhaustion} for {@dice 1d4} rounds."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Static Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The first time you hit with a melee weapon attack during this spell's duration, your weapon crackles with electricity, and the attack deals an extra {@damage 1d10} lightning damage. Additionally, if the target is a creature, it must succeed a Constitution saving throw or be {@condition incapacitated} until the start of your next turn."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "incapacitated"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Suffocating Sphere",
      "source": "TACS",
      "level": 8,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "special"
        }
      ],
      "entries": [
        "You attempt to draw the air out of a creature you can see within range. A creature is unaffected by the spell if it does not need to breathe. The creature makes a Constitution saving throw. On a failed save, the creature immediately starts to suffocate and begins choking. It can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). After the previously mentioned rounds have passed, at the start of its next turn, it drops to 0 hit points and is dying, and it can't regain hit points or be stabilized until it can breathe again.",
        "At the end of every round before it is reduced to 0 hit points, the creature can repeat its Constitution saving throw, ending the spell on a success. Once the creature is reduced to 0 hit points, you concentrate on the spell until the creature dies or until the duration ends."
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Summon Vengeful Spirit",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 90
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "humanoid blood inside a precious diamond worth at least 600 gp",
          "cost": 60000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You call forth a vengeful spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Vengeance Spirit stat block. When you cast the spell, choose Slain, Cursed, or Betrayed. The creature resembles a vengeful spirit of the chosen type, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.",
        "The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the {@action Dodge} action and uses its move to avoid danger."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell's level appears in the stat block."
          ]
        }
      ],
      "miscTags": [
        "SGT",
        "SMN"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Symphony of Law and Chaos",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "m": "A musical instrument with clockwork and gears on it worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You begin performing a powerful symphony which empowers you with the planes of law or chaos (your choice), your movements as rhythmic as clockwork. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "Your walking speed increases by 30 feet.",
            "You are immune to poison damage  and have immunity to the {@condition poisoned} condition.",
            "Clockwork wings appear on your back, giving you a flying speed of 50 feet and you can hover.",
            "You are immune to the {@condition paralyzed}, {@condition stunned}, {@condition grappled}, and {@condition restrained} conditions (Chaos) or when you deal damage with a weapon or spell, that creature is also {@condition restrained} by clockwork contraptions until the end of your next turn (Law).",
            "When you deal damage to a creature with a weapon or a spell, you can deal an additional {@damage 2d10} psychic damage to one of the damage rolls (Chaos) or an additional {@damage 2d10} force damage to one of the damage rolls (Law)."
          ]
        }
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Thunderstomp",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You stomp your foot or strike your weapon against the ground, creating a ripple of power that you can use to knock down your foes. Choose a creature within range, that creature must make a Strength saving throw or fall {@condition prone} and take {@damage 4d6} thunder damage, or half as much on a success and are not knocked {@condition prone}. You and the creature must be on the same solid surface, otherwise the spell fails."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Unseelie Moon",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "teardrops of a fey from the unseelie court"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You create a small moon, which hovers around you, that emanates a dark blue hue. When you cast the spell, and as an action on subsequent turns, you can launch a freezing ray of light from the moon toward a creature you can see within range. Make a ranged spell attack. On hit, the ray deals {@damage 4d8} cold damage and the target's speed is reduced by 10 feet until the start of your next turn.",
        "While the moon hovers around you, magical darkness within the area of the spell is treated as regular darkness."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, you can fire an additional ray from the moon for every two slot levels above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Vile Mark",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of humanoid blood"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You bestow a vile curse onto a creature you can see within range, making them more susceptible to damage for the duration of the spell. The affected creature is {@condition poisoned} and once every turn, whenever an affected creature takes damage, they take an additional {@damage 2d4} necrotic damage to one of the damage rolls of the source. A creature still suffers the damage even if they are immune to being {@condition poisoned}.",
        "An affected creature can make a Constitution saving throw at the end of each of their turns, ending the spell on a success. The spell can also be ended early with a {@spell Remove Curse}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for every two slot levels above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "poisoned"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ward of Vitality",
      "source": "TACS",
      "level": 4,
      "school": "A",
      "time": [
        {
          "number": 10,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a trinket or holy symbol made of gold or silver worth 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "For the duration, up to eight willing creatures gain 20 temporary hit points. If any of these remain when the spell ends, they are lost. While they have these temporary hit points, they have advantage on Constitution and Wisdom saving throws and their hit point maximum cannot be reduced."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the temporary hit points gained is increased by 10 for each slot level above 4th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Warding Mark",
      "source": "TACS",
      "level": 0,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You create a small rune which emits a barrier which can potentially protect you from a single attack. Until the start of your next turn, you have +1 bonus to your AC against the next attack targeted at you."
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Water Splash",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Each creature in a 5-foot radius of a point you choose within range makes a Strength saving throw. On a failed save, they take {@damage 1d4} bludgeoning damage and are pushed 5 feet away from the center.",
        "This spell's damage increases by {@dice 1d4} when you reach 5th level ({@dice 2d4}), 11th level ({@dice 3d4}), and 17th level ({@dice 4d4})."
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Water Whack",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a cup of water"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Water wraps around your hand and you wave it at a creature, slamming it into them. Make a melee spell attack against a creature within range. On hit, the target takes {@damage 2d10} bludgeoning damage and makes a Strength saving throw. On a failed save, they pushed back 5 feet and are knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Weightless Form",
      "source": "TACS",
      "level": 4,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny feather"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You become lighter than a feather. You and everything you are wearing and carrying become completely weightless, removing your tether from gravity. If you stop wearing or carrying an object, they regain their weight.",
        "For the duration, you have a magical flying speed equal to your walking speed and can hover. In addition, you are immune to being {@condition prone} as you float back onto your feet at the cost of no movement and take no damage as a result from falling. Anytime you are hit by an attack, you are pushed back 10 feet away from the attacker.",
        "If you are still flying when the spell ends, you safely descend at a rate of 60 feet per round until you touch the ground."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Whelm",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A vile filled with water from a waterfall"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You conjure an overwhelming amount of water that crashes onto a creature you can see within range with crushing force. That creature must make a Strength saving throw, or fall {@condition prone} and are {@condition restrained}. A flying creature is forced to the ground, but only takes half the normal amount of fall damage they would have received. At the start of each of the target's turns it takes {@dice 1d10} points of bludgeoning damage. At the end of the creature's turns it can repeat its saving throw, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Winter's Grasp",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a frozen monster claw"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Ice encrusts the ground radiating a powerful cold energy in a 15 foot radius, making it hard for creatures to maintain their balance. This icy ground is treated as difficult terrain. A creature that begins its turn in the affected area takes {@damage 2d6} cold damage and makes a dexterity saving throw. On a failed save, they fall {@condition prone}. At the end of their turns, they make a constitution saving throw. On a successful save, they become immune to the spell's effects.",
        "The cold freezes nonmagical liquids in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@damage 1d6} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "dexterity",
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Yeti's Chilling Gaze",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "Choose a creature that you can see within range. The target must succeed on a Constitution saving throw or take {@damage 3d6} cold damage and is {@condition paralyzed} for the duration, unless the target is resistant or immune to cold damage. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target. If a creature passes their save against this spell, they are immune to its effects for 1 hour."
      ],
      "damageInflict": [
        "cold"
      ],
      "conditionInflict": [
        "paralyzed"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    }
  ]
}