{
  "_meta": {
    "sources": [
      {
        "convertedBy": [
          "Erikku Blade"
        ],
        "authors": [
          "Erikku Blade"
        ],
        "dependencies": {
          "class": [
            "PHB"
          ],
          "classFeature": [
            "PHB",
            "TCE"
          ]
        },
        "url": "",
        "full": "The Adventures of Torrin Campaign Setting",
        "abbreviation": "AOTC",
        "json": "TACS",
        "color": "f1c232"
      }
    ],
    "dateAdded": 1638480074,
    "dateLastModified": 1638480074,
    "internalCopies": [
      "item",
      "background"
    ]
  },
  "class": [
    {
      "name": "Ranger",
      "source": "TACS",
      "page": null,
      "srd": false,
      "hd": {
        "number": 1,
        "faces": 10
      },
      "proficiency": [
        "str",
        "dex"
      ],
      "spellcastingAbility": "wis",
      "casterProgression": "1/2",
      "spellsKnownProgression": [
        0,
        2,
        3,
        3,
        4,
        4,
        5,
        5,
        6,
        6,
        7,
        7,
        8,
        8,
        9,
        9,
        10,
        10,
        11,
        11
      ],
      "optionalfeatureProgression": [
        {
          "name": "Fighting Style",
          "featureType": [
            "FS:R"
          ],
          "progression": {
            "2": 1
          }
        }
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          "{@item shield|phb|shields}"
        ],
        "weapons": [
          "simple",
          "martial"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "animal handling",
                "athletics",
                "insight",
                "investigation",
                "nature",
                "perception",
                "stealth",
                "survival"
              ],
              "count": 3
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) {@item scale mail|phb} or (b) {@item leather armor|phb}",
          "(a) two {@item shortsword|phb|shortswords} or (b) two {@filter simple melee weapons|items|source=phb|category=basic|type=simple weapon;melee weapon=sand}",
          "(a) a {@item dungeoneer's pack|phb} or (b) an {@item explorer's pack|phb}",
          "A {@item longbow|phb} and a {@item quiver|phb} of {@item arrows (20)|phb|20 arrows}"
        ],
        "goldAlternative": "{@dice 5d4 × 10|5d4 × 10|Starting Gold}",
        "defaultData": [
          {
            "a": [
              "scale mail|phb"
            ],
            "b": [
              "leather armor|phb"
            ]
          },
          {
            "a": [
              {
                "item": "shortsword|phb",
                "quantity": 2
              }
            ],
            "b": [
              {
                "equipmentType": "weaponSimpleMelee",
                "quantity": 2
              }
            ]
          },
          {
            "a": [
              "dungeoneer's pack|phb"
            ],
            "b": [
              "explorer's pack|phb"
            ]
          },
          {
            "_": [
              "longbow|phb",
              "arrows (20)|phb"
            ]
          }
        ]
      },
      "multiclassing": {
        "requirements": {
          "dex": 13,
          "wis": 13
        },
        "proficienciesGained": {
          "armor": [
            "light",
            "medium",
            "{@item shield|phb|shields}"
          ],
          "skills": [
            {
              "choose": {
                "from": [
                  "animal handling",
                  "athletics",
                  "insight",
                  "investigation",
                  "nature",
                  "perception",
                  "stealth",
                  "survival"
                ],
                "count": 1
              }
            }
          ],
          "weapons": [
            "simple",
            "martial"
          ]
        }
      },
      "classTableGroups": [
        {
          "colLabels": [
            "{@filter Spells Known|spells|class=ranger}"
          ],
          "rows": [
            [
              0
            ],
            [
              2
            ],
            [
              3
            ],
            [
              3
            ],
            [
              4
            ],
            [
              4
            ],
            [
              5
            ],
            [
              5
            ],
            [
              6
            ],
            [
              6
            ],
            [
              7
            ],
            [
              7
            ],
            [
              8
            ],
            [
              8
            ],
            [
              9
            ],
            [
              9
            ],
            [
              10
            ],
            [
              10
            ],
            [
              11
            ],
            [
              11
            ]
          ]
        },
        {
          "title": "Spell Slots per Spell Level",
          "colLabels": [
            "{@filter 1st|spells|level=1|class=Ranger}",
            "{@filter 2nd|spells|level=2|class=Ranger}",
            "{@filter 3rd|spells|level=3|class=Ranger}",
            "{@filter 4th|spells|level=4|class=Ranger}",
            "{@filter 5th|spells|level=5|class=Ranger}"
          ],
          "rowsSpellProgression": [
            [
              0,
              0,
              0,
              0,
              0
            ],
            [
              2,
              0,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0,
              0
            ],
            [
              3,
              0,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0,
              0
            ],
            [
              4,
              2,
              0,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0,
              0
            ],
            [
              4,
              3,
              0,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0,
              0
            ],
            [
              4,
              3,
              2,
              0,
              0
            ],
            [
              4,
              3,
              3,
              0,
              0
            ],
            [
              4,
              3,
              3,
              0,
              0
            ],
            [
              4,
              3,
              3,
              1,
              0
            ],
            [
              4,
              3,
              3,
              1,
              0
            ],
            [
              4,
              3,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              2,
              0
            ],
            [
              4,
              3,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              3,
              1
            ],
            [
              4,
              3,
              3,
              3,
              2
            ],
            [
              4,
              3,
              3,
              3,
              2
            ]
          ]
        }
      ],
      "classFeatures": [
        "Favored Enemy|Ranger|TACS|1",
        "Favored Foe|Ranger|TACS|1|TCE",
        "Natural Explorer|Ranger|TACS|1",
        "Deft Explorer|Ranger|TACS|1|TCE",
        "Fighting Style|Ranger|TACS|2",
        "Spellcasting|Ranger|TACS|2",
        {
          "classFeature": "Ranger Archetype|Ranger|TACS|3",
          "gainSubclassFeature": true
        },
        "Primeval Awareness|Ranger|TACS|3",
        "Primal Awareness|Ranger|TACS|3|TCE",
        "Ability Score Improvement|Ranger|TACS|4",
        "Martial Versatility|Ranger|TACS|4|TCE",
        "Extra Attack|Ranger|TACS|5",
        "Favored Enemy and Natural Explorer improvements|Ranger|TACS|6",
        "Deft Explorer Improvement|Ranger|TACS|6|TCE",
        {
          "classFeature": "Ranger Archetype feature|Ranger|TACS|7",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Ranger|TACS|8",
        "Land's Stride|Ranger|TACS|8",
        "Vital Strike|Ranger|TACS|9",
        "Hide in Plain Sight|Ranger|TACS|10",
        "Nature's Veil|Ranger|TACS|10|TCE",
        "Natural Explorer improvement|Ranger|TACS|10",
        "Deft Explorer Improvement|Ranger|TACS|10|TCE",
        {
          "classFeature": "Ranger Archetype feature|Ranger|TACS|11",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Ranger|TACS|12",
        "Vanish|Ranger|TACS|14",
        "Favored Enemy improvement|Ranger|TACS|14",
        {
          "classFeature": "Ranger Archetype feature|Ranger|TACS|15",
          "gainSubclassFeature": true
        },
        "Ability Score Improvement|Ranger|TACS|16",
        "Feral Senses|Ranger|TACS|18",
        "Ability Score Improvement|Ranger|TACS|19",
        "Foe Slayer|Ranger|TACS|20"
      ],
      "subclassTitle": "Ranger Archetype",
      "fluff": [
        {
          "name": "Ranger",
          "type": "section",
          "entries": [
            "Rough and wild looking, a human stalks alone through the shadows of trees, hunting the orcs he knows are planning a raid on a nearby farm. Clutching a shortsword in each hand, he becomes a whirlwind of steel, cutting down one enemy after another.",
            "After tumbling away from a cone of freezing air, an elf finds her feet and draws back her bow to loose an arrow at the white dragon. Shrugging off the wave of fear that emanates from the dragon like the cold of its breath, she sends one arrow after another to find the gaps between the dragon's thick scales.",
            "Holding his hand high, a half-elf whistles to the hawk that circles high above him, calling the bird back to his side. Whispering instructions in Elvish, he points to the owlbear he's been tracking and sends the hawk to distract the creature while he readies his bow.",
            "Far from the bustle of cities and towns, past the hedges that shelter the most distant farms from the terrors of the wild, amid the dense-packed trees of trackless forests and across wide and empty plains, rangers keep their unending watch.",
            {
              "type": "entries",
              "name": "Deadly Hunters",
              "entries": [
                "Warriors of the wilderness, rangers specialize in hunting the monsters that threaten the edges of civilization—humanoid raiders, rampaging beasts and monstrosities, terrible giants, and deadly dragons. They learn to track their quarry as a predator does, moving stealthily through the wilds and hiding themselves in brush and rubble. Rangers focus their combat training on techniques that are particularly useful against their specific favored foes.",
                "Thanks to their familiarity with the wilds, rangers acquire the ability to cast spells that harness nature's power, much as a druid does. Their spells, like their combat abilities, emphasize speed, stealth, and the hunt. A ranger's talents and abilities are honed with deadly focus on the grim task of protecting the borderlands."
              ]
            },
            {
              "type": "entries",
              "name": "Independent Adventurers",
              "entries": [
                "Though a ranger might make a living as a hunter, a guide, or a tracker, a ranger's true calling is to defend the outskirts of civilization from the ravages of monsters and humanoid hordes that press in from the wild. In some places, rangers gather in secretive orders or join forces with druidic circles. Many rangers, though, are independent almost to a fault, knowing that, when a dragon or a band of orcs attacks, a ranger might be the first—and possibly the last—line of defense.",
                "This fierce independence makes rangers well suited to adventuring, since they are accustomed to life far from the comforts of a dry bed and a hot bath. Faced with city-bred adventurers who grouse and whine about the hardships of the wild, rangers respond with some mixture of amusement, frustration, and compassion. But they quickly learn that other adventurers who can carry their own weight in a fight against civilization's foes are worth any extra burden. Coddled city folk might not know how to feed themselves or find fresh water in the wild, but they make up for it in other ways."
              ]
            },
            {
              "type": "entries",
              "name": "Creating a Ranger",
              "entries": [
                "As you create your ranger character, consider the nature of the training that gave you your particular capabilities. Did you train with a single mentor, wandering the wilds together until you mastered the ranger's ways? Did you leave your apprenticeship, or was your mentor slain—perhaps by the same kind of monster that became your favored enemy? Or perhaps you learned your skills as part of a band of rangers affiliated with a druidic circle, trained in mystic paths as well as wilderness lore. You might be self-taught, a recluse who learned combat skills, tracking, and even a magical connection to nature through the necessity of surviving in the wilds.",
                "What's the source of your particular hatred of a certain kind of enemy? Did a monster kill someone you loved or destroy your home village? Or did you see too much of the destruction these monsters cause and commit yourself to reining in their depredations? Is your adventuring career a continuation of your work in protecting the borderlands, or a significant change? What made you join up with a band of adventurers? Do you find it challenging to teach new allies the ways of the wild, or do you welcome the relief from solitude that they offer?",
                {
                  "type": "entries",
                  "name": "Quick Build",
                  "entries": [
                    "You can make a ranger quickly by following these suggestions. First, make Dexterity your highest ability score, followed by Wisdom. (Some rangers who focus on two-weapon fighting make Strength higher than Dexterity.) Second, choose the {@background outlander} background."
                  ]
                }
              ]
            }
          ],
          "source": "TACS",
          "page": null
        },
        {
          "type": "section",
          "entries": [
            {
              "type": "quote",
              "entries": [
                "I spend a lot of my life away from civilization, keeping to its fringes to protect it. Don't assume that because I don't bend the knee to your king that I haven't done more to protect him than all his knights put together."
              ],
              "by": "Soveliss"
            },
            "Rangers are free-minded wanderers and seekers who patrol the edges of civilized territory, turning back the denizens of the wild lands beyond. It is a thankless job, since their efforts are rarely understood and almost never rewarded. Yet rangers persist in their duties, never doubting that their work makes the world a safer place.",
            "A relationship with civilization informs every ranger's personality and history. Some rangers see themselves as enforcers of the law and bringers of justice on civilization's frontier, answering to no sovereign power. Others are survivalists who eschew civilization altogether. They vanquish monsters to keep themselves safe while they live in and travel through the perilous wild areas of the world. If their efforts also benefit the kingdoms and other civilized realms that they avoid, so be it.",
            "If you're creating or playing a ranger character, the following sections offer ideas for embellishing the character and enhancing your roleplaying experience.",
            {
              "type": "entries",
              "name": "View of the World",
              "entries": [
                "A ranger's view of the world begins (and sometimes ends) with that character's outlook toward civilized folk and the places they occupy. Some rangers have an attitude toward civilization that's deeply rooted in disdain, while others pity the people they have sworn to protect—though on the battlefield, it's impossible to tell the difference between one ranger and another. Indeed, to those who have seen them operate and been the beneficiaries of their prowess, it scarcely matters why rangers do what they do. That said, no two rangers are likely to express their opinions on any matter in the same way.",
                "If you haven't yet thought about the details of your character's worldview, consider putting a finer point on things by summarizing that viewpoint in a short statement (such as the entries on the following table). How might that feeling affect the way you conduct yourself?",
                {
                  "type": "table",
                  "caption": "View of the World",
                  "colLabels": [
                    "{@dice d6}",
                    "View"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Towns and cities are the best places for those who can't survive on their own."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "The advancement of civilization is the best way to thwart chaos, but its reach must be monitored."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Towns and cities are a necessary evil, but once the wilderness is purged of supernatural threats, we will need them no more."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "Walls are for cowards, who huddle behind them while others do the work of making the world safe."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Visiting a town is not unpleasant, but after a few days I feel the irresistible call to return to the wild."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "Cities breed weakness by isolating folk from the harsh lessons of the wild."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Homelands",
              "entries": [
                "All rangers, regardless of how they came to take up the profession, have a strong connection to the natural world and its various terrains. For some rangers, the wilderness is where they grew up, either as a result of being born there or moving there at a young age. For other rangers, civilization was originally home, but the wilderness became a second homeland.",
                "Think of your character's backstory and decide what terrain feels most like home, whether or not you were born there. What does that terrain say about your personality? Does it influence which spells you choose to learn? Have your experiences there shaped who your favored enemies are?",
                {
                  "type": "table",
                  "caption": "Homelands",
                  "colLabels": [
                    "{@dice d6}",
                    "Homeland"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "You patrolled an ancient forest, darkened and corrupted by several crossings to the Shadowfell."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "As part of a group of nomads, you acquired the skills for surviving in the desert."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Your early life in the Underdark prepared you for the challenges of combating its denizens."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "You dwelled on the edge of a swamp, in an area imperiled by land creatures as well as aquatic ones."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Because you grew up among the peaks, finding the best path through the mountains is second nature to you."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "You wandered the far north, learning how to protect yourself and prosper in a realm overrun by ice."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Sworn Enemy",
              "entries": [
                "Every ranger begins with a favored enemy (or two). The determination of a favored enemy might be tied to a specific event in the character's early life, or it might be entirely a matter of choice.",
                "What spurred your character to select a particular enemy? Was the choice made because of tradition or curiosity, or do you have a grudge to settle?",
                {
                  "type": "table",
                  "caption": "Sworn Enemies",
                  "colLabels": [
                    "{@dice d6}",
                    "Enemy"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "You seek revenge on nature's behalf for the great transgressions your foe has committed."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Your forebears or predecessors fought these creatures, and so shall you."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "You bear no enmity toward your foe. You stalk such creatures as a hunter tracks down a wild animal."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "You find your foe fascinating, and you collect books of tales and history concerning it."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "You collect tokens of your fallen enemies to remind you of each kill."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "You respect your chosen enemy, and you see your battles as a test of respective skills."
                    ]
                  ]
                }
              ]
            }
          ],
          "page": null,
          "source": "TACS"
        }
      ]
    }
  ],
  "subclass": [
    {
      "name": "Beast Master",
      "shortName": "Beast Master",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "subclassFeatures": [
        "Beast Master|Ranger|TACS|Beast Master|TACS|3",
        "Exceptional Training|Ranger|TACS|Beast Master|TACS|7",
        "Bestial Fury|Ranger|TACS|Beast Master|TACS|11",
        "Share Spells|Ranger|TACS|Beast Master|TACS|15"
      ]
    },
    {
      "name": "Hunter",
      "shortName": "Hunter",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "srd": false,
      "subclassFeatures": [
        "Hunter|Ranger|TACS|Hunter|TACS|3",
        "Defensive Tactics|Ranger|TACS|Hunter|TACS|7",
        "Multiattack|Ranger|TACS|Hunter|TACS|11",
        "Superior Hunter's Defense|Ranger|TACS|Hunter|TACS|15"
      ]
    },
    {
      "name": "Gloom Stalker",
      "shortName": "Gloom Stalker",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "disguise self"
            ],
            "5": [
              "rope trick"
            ],
            "9": [
              "fear"
            ],
            "13": [
              "greater invisibility"
            ],
            "17": [
              "seeming"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Gloom Stalker|Ranger|TACS|Gloom Stalker|TACS|3",
        "Iron Mind|Ranger|TACS|Gloom Stalker|TACS|7",
        "Stalker's Flurry|Ranger|TACS|Gloom Stalker|TACS|11",
        "Shadowy Dodge|Ranger|TACS|Gloom Stalker|TACS|15"
      ]
    },
    {
      "name": "Monster Slayer",
      "shortName": "Monster Slayer",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "protection from evil and good"
            ],
            "5": [
              "zone of truth"
            ],
            "9": [
              "magic circle"
            ],
            "13": [
              "banishment"
            ],
            "17": [
              "hold monster"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Monster Slayer|Ranger|TACS|Monster Slayer|TACS|3",
        "Supernatural Defense|Ranger|TACS|Monster Slayer|TACS|7",
        "Magic-User's Nemesis|Ranger|TACS|Monster Slayer|TACS|11",
        "Slayer's Counter|Ranger|TACS|Monster Slayer|TACS|15"
      ]
    },
    {
      "name": "Fey Wanderer",
      "shortName": "Fey Wanderer",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "charm person"
            ],
            "5": [
              "misty step"
            ],
            "9": [
              "dispel magic"
            ],
            "13": [
              "dimension door"
            ],
            "17": [
              "mislead"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Fey Wanderer|Ranger|TACS|Fey Wanderer|TACS|3",
        "Beguiling Twist|Ranger|TACS|Fey Wanderer|TACS|7",
        "Fey Reinforcements|Ranger|TACS|Fey Wanderer|TACS|11",
        "Misty Wanderer|Ranger|TACS|Fey Wanderer|TACS|15"
      ]
    },
    {
      "name": "Swarmkeeper",
      "shortName": "Swarmkeeper",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "mage hand#c",
              "faerie fire"
            ],
            "5": [
              "web"
            ],
            "9": [
              "gaseous form"
            ],
            "13": [
              "arcane eye"
            ],
            "17": [
              "insect plague"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Swarmkeeper|Ranger|TACS|Swarmkeeper|TACS|3",
        "Writhing Tide|Ranger|TACS|Swarmkeeper|TACS|7",
        "Mighty Swarm|Ranger|TACS|Swarmkeeper|TACS|11",
        "Swarming Dispersal|Ranger|TACS|Swarmkeeper|TACS|15"
      ]
    },
    {
      "name": "Drakewarden",
      "shortName": "Drakewarden",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "thaumaturgy#c"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Drakewarden|Ranger|TACS|Drakewarden|TACS|3",
        "Bond of Fang and Scale|Ranger|TACS|Drakewarden|TACS|7",
        "Drake's Breath|Ranger|TACS|Drakewarden|TACS|11",
        "Perfected Bond|Ranger|TACS|Drakewarden|TACS|15"
      ]
    },
    {
      "name": "Horizon Walker",
      "shortName": "Horizon Walker",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "3": [
              "protection from evil and good"
            ],
            "5": [
              "misty step"
            ],
            "9": [
              "haste"
            ],
            "13": [
              "banishment"
            ],
            "17": [
              "teleportation circle"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "Horizon Walker|Ranger|TACS|Horizon Walker|TACS|3",
        "Ethereal Step|Ranger|TACS|Horizon Walker|TACS|7",
        "Distant Strike|Ranger|TACS|Horizon Walker|TACS|11",
        "Spectral Defense|Ranger|TACS|Horizon Walker|TACS|15"
      ]
    },
    {
      "name": "Winter Walker Ranger Conclave",
      "source": "TACS",
      "subclassFeatures": [
        "Winter Walker|Ranger|TACS|Winter Walker|TACS|3",
        "Warden of Winter|Ranger|TACS|Winter Walker|TACS|7",
        "Frozen Sentinel|Ranger|TACS|Winter Walker|TACS|11",
        "Preserving Ward|Ranger|TACS|Winter Walker|TACS|15"
      ],
      "subclassSpells": [
        "glacial grip|TACS",
        "winter's grasp|TACS",
        "sleet storm",
        "ice storm",
        "cone of cold"
      ],
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "glacial grip|TACS"
            ],
            "5": [
              "Winter's Grasp|TACS"
            ],
            "9": [
              "sleet storm"
            ],
            "13": [
              "Ice Storm"
            ],
            "17": [
              "Cone of Cold"
            ]
          }
        }
      ],
      "shortName": "Winter Walker",
      "className": "Ranger",
      "classSource": "TACS"
    },
    {
      "name": "The Lore Hunter Conclave",
      "source": "TACS",
      "subclassFeatures": [
        "The Lore Hunter|Ranger|TACS|Lore Hunter|TACS|3",
        "Ritual Master|Ranger|TACS|Lore Hunter|TACS|7",
        "Detect Dungeon|Ranger|TACS|Lore Hunter|TACS|7",
        "Ancient Wisdom|Ranger|TACS|Lore Hunter|TACS|11",
        "Relics of The Past|Ranger|TACS|Lore Hunter|TACS|15"
      ],
      "subclassSpells": [
        "identify",
        "borrowed knowledge|SCC",
        "glyph of warding",
        "death ward",
        "legend lore"
      ],
      "additionalSpells": [
        {
          "prepared": {
            "3": [
              "identify"
            ],
            "5": [
              "borrowed knowledge|SCC"
            ],
            "9": [
              "glyph of warding"
            ],
            "13": [
              "death ward"
            ],
            "17": [
              "legend lore"
            ]
          }
        }
      ],
      "shortName": "Lore Hunter",
      "className": "Ranger",
      "classSource": "TACS"
    }
  ],
  "classFeature": [
    {
      "name": "Deft Explorer",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 1,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 1st-level ranger {@variantrule optional class features|TACS|optional feature}, which replaces the Natural Explorer feature}",
        "You are an unsurpassed explorer and survivor, both in the wilderness and in dealing with others on your travels. You gain the Canny benefit below, and you gain an additional benefit below when you reach 6th level and 10th level in this class.",
        {
          "name": "Canny",
          "type": "entries",
          "entries": [
            "Choose one of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses the chosen skill.",
            "You can also speak, read, and write two additional languages of your choice."
          ]
        }
      ]
    },
    {
      "name": "Favored Enemy",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.",
        "Choose a type of favored enemy: {@filter aberrations|bestiary|type=aberration}, {@filter beasts|bestiary|type=beast}, {@filter celestials|bestiary|type=celestial}, {@filter constructs|bestiary|type=construct}, {@filter dragons|bestiary|type=dragon}, {@filter elementals|bestiary|type=elemental}, {@filter fey|bestiary|type=fey}, {@filter fiends|bestiary|type=fiend}, {@filter giants|bestiary|type=giant}, {@filter monstrosities|bestiary|type=monstrosity}, {@filter oozes|bestiary|type=ooze}, {@filter plants|bestiary|type=plant}, or {@filter undead|bestiary|type=undead}. Alternatively, you can select two races of {@filter humanoid|bestiary|type=humanoid} (such as {@creature gnoll|mm|gnolls} and {@creature orc|mm|orcs}) as favored enemies.",
        "You have advantage on Wisdom ({@skill Survival}) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.",
        "When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.",
        "You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures."
      ]
    },
    {
      "name": "Favored Foe",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 1,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 1st-level ranger {@variantrule optional class features|TCE|optional feature}, which replaces the Favored Enemy feature and works with the Foe Slayer feature}",
        "When you hit a creature with an attack roll, you can call on your mystical bond with nature to mark the target as your favored enemy for 1 minute or until you lose your concentration (as if you were concentrating on a spell).",
        "The first time on each of your turns that you hit the favored enemy and deal damage to it, including when you mark it, you can increase that damage by {@dice 1d4}.",
        "You can use this feature to mark a favored enemy a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
        "This feature's extra damage increases when you reach certain levels in this class: to {@dice 1d6} at 6th level and to {@dice 1d8} at 14th level."
      ]
    },
    {
      "name": "Natural Explorer",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in.",
        "While traveling for an hour or more in your favored terrain, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Difficult terrain doesn't slow your group's travel.",
            "Your group can't become lost except by magical means.",
            "Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.",
            "If you are traveling alone, you can move stealthily at a normal pace.",
            "When you forage, you find twice as much food as you normally would.",
            "While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
          ]
        },
        "You choose additional favored terrain types at 6th and 10th level."
      ]
    },
    {
      "name": "Fighting Style",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Archery"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Defense"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Dueling"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Dual Fighting|TACS"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Blind Fighting|TCE"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Druidic Warrior|TCE"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Thrown Weapon Fighting|TCE"
            }
          ]
        }
      ]
    },
    {
      "name": "Spellcasting",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See {@book chapter 10|TACS|10} for the general rules of spellcasting and {@book chapter 11|phb|11} for the {@filter ranger spell list|spells|class=ranger}.",
        {
          "type": "entries",
          "name": "Spell Slots",
          "entries": [
            "The Ranger table shows how many spell slots you have to cast your {@filter ranger spells|spells|class=ranger} of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
            "For example, if you know the 1st-level spell {@spell animal friendship} and have a 1st-level and a 2nd-level spell slot available, you can cast {@spell animal friendship} using either slot."
          ]
        },
        {
          "type": "entries",
          "name": "Spells Known of 1st Level and Higher",
          "entries": [
            "You know two 1st-level spells of your choice from the ranger spell list.",
            "The Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.",
            "Additionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots."
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Ability",
          "entries": [
            "Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.",
            {
              "type": "abilityDc",
              "name": "Spell",
              "attributes": [
                "wis"
              ]
            },
            {
              "type": "abilityAttackMod",
              "name": "Spell",
              "attributes": [
                "wis"
              ]
            }
          ]
        },
        {
          "name": "Spellcasting Focus",
          "type": "entries",
          "entries": [
            "You can use a {@item druid focus|phb} as a spellcasting focus for your Ranger spells. You can also use a ranged weapon you are holding as a spellcasting focus, such as a {@item longbow|phb}."
          ]
        }
      ]
    },
    {
      "name": "Primal Awareness",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 3,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 3rd-level ranger {@variantrule optional class features|TCE|optional feature}, which replaces the Primeval Awareness feature}",
        "You can focus your awareness through the interconnections of nature: you learn additional spells when you reach certain levels in this class if you don't already know them, as shown in the Primal Awareness Spells table. These spells don't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Primal Awareness Spells",
          "colLabels": [
            "Ranger Level",
            "Spell"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell speak with animals}"
            ],
            [
              "5th",
              "{@spell beast sense}"
            ],
            [
              "9th",
              "{@spell speak with plants}"
            ],
            [
              "13th",
              "{@spell locate creature}"
            ],
            [
              "17th",
              "{@spell commune with nature}"
            ]
          ]
        },
        "You can cast each of these spells once without expending a spell slot. Once you cast a spell in this way, you can't do so again until you finish a long rest."
      ]
    },
    {
      "name": "Primeval Awareness",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number."
      ]
    },
    {
      "name": "Ranger Archetype",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "At 3rd level, you choose an archetype that you strive to emulate from the list of available archetypes. Your choice grants features at 3rd level, and again at 7th, 11th, and 15th level."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 4,
      "entries": [
        "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Martial Versatility",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 4,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 4th-level ranger {@variantrule optional class features|TCE|optional feature}}",
        "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace a fighting style you know with another fighting style available to rangers. This replacement represents a shift of focus in your martial practice."
      ]
    },
    {
      "name": "Extra Attack",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 5,
      "entries": [
        "Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn."
      ]
    },
    {
      "name": "Deft Explorer Improvement",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 6,
      "isClassFeatureVariant": true,
      "entries": [
        "You gain an additional benefit when you reach 6th level in this class.",
        {
          "type": "entries",
          "name": "Roving",
          "entries": [
            "Your walking speed increases by 5, and you gain a climbing speed and a swimming speed equal to your walking speed."
          ]
        }
      ]
    },
    {
      "name": "Favored Enemy and Natural Explorer improvements",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 6,
      "entries": [
        "At 6th level, you gain an additional favored terrain.",
        "At 6th level, you choose one additional favored enemy, as well as an associated language. Your choice should reflect the types of monsters you have encountered on your adventures."
      ]
    },
    {
      "name": "Ranger Archetype feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 7,
      "entries": [
        "At 7th level, you gain a feature granted to you by your Ranger Archetype."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Land's Stride",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "Starting at 8th level, moving through nonmagical {@quickref difficult terrain|phb|3} costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
        "In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the {@spell entangle} spell."
      ]
    },
    {
      "name": "Vital Strike",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 9,
      "entries": [
        "Starting at 9th level, you can strike a creature with a single deadly and precise strike. At 9th level, when you hit with a weapon attack, you can forgo any additional attacks when you take the {@action Attack} action, either from Extra Attack, engaging in two-weapon fighting, or any similar feature, to add an additional three weapon damage dice to the damage roll. You can only use this feature once per round. The number of extra dice becomes four when you reach 18th level.",
        "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), regaining all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Deft Explorer Improvement",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 10,
      "isClassFeatureVariant": true,
      "entries": [
        "You gain an additional benefit when you reach 10th level in this class.",
        {
          "type": "entries",
          "name": "Tireless",
          "entries": [
            "As an action, you can give yourself a number of temporary hit points equal to {@dice 1d8} + your Wisdom modifier (minimum of 1 temporary hit point). You can use this action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
            "In addition, whenever you finish a short rest, your {@condition exhaustion} level, if any, is decreased by 1."
          ]
        }
      ]
    },
    {
      "name": "Hide in Plain Sight",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 10,
      "entries": [
        "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.",
        "Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
      ]
    },
    {
      "name": "Natural Explorer improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 10,
      "entries": [
        "You gain an additional favored terrain."
      ]
    },
    {
      "name": "Nature's Veil",
      "source": "TCE",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 10,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 10th-level ranger {@variantrule optional class features|TCE|optional feature}, which replaces the Hide in Plain Sight feature}",
        "You draw on the powers of nature to hide yourself from view briefly. As a bonus action, you can magically become {@condition invisible}, along with any equipment you are wearing or carrying, until the start of your next turn.",
        "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Ranger Archetype feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 11,
      "entries": [
        "At 11th level, you gain a feature granted to you by your Ranger Archetype."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 12,
      "entries": [
        "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Favored Enemy improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 14,
      "entries": [
        "At 14th level, you choose one additional favored enemy, as well as an associated language. Your choice should reflect the types of monsters you have encountered on your adventures."
      ]
    },
    {
      "name": "Vanish",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 14,
      "entries": [
        "Starting at 14th level, you can use the {@action Hide} action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
      ]
    },
    {
      "name": "Ranger Archetype feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 15,
      "entries": [
        "At 15th level, you gain a feature granted to you by your Ranger Archetype."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 16,
      "entries": [
        "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Feral Senses",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 18,
      "entries": [
        "At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any {@condition invisible} creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't {@condition blinded} or {@condition deafened}."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 19,
      "entries": [
        "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Foe Slayer",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "level": 20,
      "entries": [
        "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "Drakewarden",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "Your connection to the natural world takes the form of a draconic spirit, which can manifest in physical form as a drake. As your powers grow, your drake grows as well, blossoming from a small four-legged companion to a majestic winged creature large and strong enough for you to ride. Along the way, you gain an increasing share of the awe-inspiring power of dragons.",
        "Consider the source of the draconic spirit you have bonded with. The Drakewarden Origin table offers examples.",
        {
          "type": "table",
          "caption": "Drakewarden Origin",
          "colLabels": [
            "d6",
            "Origin"
          ],
          "colStyles": [
            "col-1 text-center",
            "col-11"
          ],
          "rows": [
            [
              "1",
              "You studied a dragon's scale or claw, or a trinket from a dragon's hoard, creating your bond through that token's lingering draconic magic."
            ],
            [
              "2",
              "A secret order of rangers who collect and guard draconic lore taught you their ways."
            ],
            [
              "3",
              "A dragon gave you a geode or gemstone to care for. To your surprise, the drake hatched from that stone."
            ],
            [
              "4",
              "You ingested a few drops of dragon blood, forever infusing your nature magic with draconic power."
            ],
            [
              "5",
              "An ancient Draconic inscription on a standing stone empowered you when you read it aloud."
            ],
            [
              "6",
              "You had a vivid dream of a mysterious figure accompanied by seven yellow canaries, who warned you of impending doom. When you awoke, your drake was there, watching you."
            ]
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Draconic Gift|Ranger|TACS|Drakewarden|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Drake Companion|Ranger|TACS|Drakewarden|TACS|3"
        }
      ]
    },
    {
      "name": "Draconic Gift",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Drakewarden feature}",
        "The bond you share with your drake creates a connection to dragonkind, granting you understanding and empowering your presence. You gain the following benefits:",
        {
          "type": "list",
          "style": "list-hang-notitle",
          "items": [
            {
              "type": "item",
              "name": "Thaumaturgy",
              "entry": "You learn the {@spell thaumaturgy} cantrip, which is a ranger spell for you."
            },
            {
              "type": "item",
              "name": "Tongue of Dragons",
              "entry": "You learn to speak, read, and write Draconic or one other language of your choice."
            }
          ]
        }
      ]
    },
    {
      "name": "Drake Companion",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Drakewarden feature}",
        "As an action, you can magically summon the drake that is bound to you. It appears in an unoccupied space of your choice within 30 feet of you.",
        "The drake is friendly to you and your companions, and it obeys your commands. See its game statistics in the accompanying {@creature Drake Companion|FTD} stat block, which uses your proficiency bonus (PB) in several places. Whenever you summon the drake, choose a damage type listed in its Draconic Essence trait. You can determine the cosmetic characteristics of the drake, such as its color, its scale texture, or any visible effect of its Draconic Essence; your choice has no effect on its game statistics.",
        "In combat, the drake shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the {@action Dodge} action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are {@condition incapacitated}, the drake can take any action of its choice, not just {@action Dodge}.",
        "The drake remains until it is reduced to 0 hit points, until you use this feature to summon the drake again, or until you die. Anything the drake was wearing or carrying is left behind when the drake vanishes.",
        "Once you summon the drake, you can't do so again until you finish a long rest, unless you expend a spell slot of 1st level or higher to summon it."
      ]
    },
    {
      "name": "Bond of Fang and Scale",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "{@i 7th-level Drakewarden feature}",
        "The bond you share with your drake intensifies, protecting you and stoking the drake's fury. When you summon your drake, it grows wings on its back and gains a flying speed equal to its walking speed.",
        "In addition, while your drake is summoned, you and the drake gain the following benefits:",
        {
          "type": "list",
          "style": "list-hang-notitle",
          "items": [
            {
              "type": "item",
              "name": "Drake Mount",
              "entries": [
                "The drake grows to Medium size. Reflecting your special bond, you can use the drake as a mount if your size is Medium or smaller. While you are riding your drake, it can't use the flying speed of this feature."
              ]
            },
            {
              "type": "item",
              "name": "Magic Fang",
              "entries": [
                "The drake's Bite attack deals an extra {@damage 1d6} damage of the type chosen for the drake's Draconic Essence."
              ]
            },
            {
              "type": "item",
              "name": "Resistance",
              "entries": [
                "You gain resistance to the damage type chosen for the drake's Draconic Essence."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Drake's Breath",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "{@i 11th-level Drakewarden feature}",
        "As an action, you can exhale a 30-foot cone of damaging breath or cause your drake to exhale it. Choose acid, cold, fire, lightning, or poison damage (your choice doesn't have to match your drake's Draconic Essence). Each creature in the cone must make a Dexterity saving throw against your spell save DC, taking {@damage 8d6} damage on a failed save, or half as much damage on a successful one.",
        "This damage increases to {@dice 10d6} when you reach 15th level in this class.",
        "Once you use this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 3rd level or higher to use it again."
      ]
    },
    {
      "name": "Perfected Bond",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Drakewarden",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Drakewarden feature}",
        "Your bond to your drake reaches the pinnacle of its power. While your drake is summoned, you and the drake gain the following benefits:",
        {
          "type": "list",
          "style": "list-hang-notitle",
          "items": [
            {
              "type": "item",
              "name": "Empowered Bite",
              "entries": [
                "The drake's Bite attack deals an extra {@damage 1d6} damage of the type chosen for its Draconic Essence (for a total of {@damage 2d6} extra damage)."
              ]
            },
            {
              "type": "item",
              "name": "Large Drake",
              "entries": [
                "The drake grows to Large size. When you ride your drake, it is no longer prohibited from using the flying speed of Bond of Fang and Scale."
              ]
            },
            {
              "type": "item",
              "name": "Reflexive Resistance",
              "entries": [
                "When either you or the drake takes damage while you're within 30 feet of each other, you can use your reaction to give yourself or the drake resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Beast Master",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "The Beast Master archetype embodies a friendship between the civilized races and the beasts of the world. United in focus, beast and ranger work as one to fight the monstrous foes that threaten civilization and the wilderness alike. Emulating the Beast Master archetype means committing yourself to this ideal, working in partnership with an animal as its companion and friend.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Ranger's Companion|Ranger|TACS|Beast Master|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Primal Companion|Ranger|TACS|Beast Master|TACS|3"
        }
      ]
    },
    {
      "name": "Primal Companion",
      "source": "TACS",
      "page": 61,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 3,
      "isClassFeatureVariant": true,
      "header": 1,
      "entries": [
        "{@i 3rd-level Beast Master variant feature, which replaces the Ranger's Companion feature}",
        "You magically summon a primal beast, which draws strength from your bond with nature. The beast is friendly to you and your companions and obeys your commands. Choose its stat block—{@creature Beast of the Land|TCE}, {@creature Beast of the Sea|TCE}, or {@creature Beast of the Sky|TCE}—which uses your proficiency bonus (PB) in several places. You also determine the kind of animal the beast is, choosing a kind appropriate for the stat block. Whatever kind you choose, the beast bears primal markings, indicating its mystical origin.",
        "In combat, the beast acts during your turn. It can move and use its reaction on its own, but the only action it takes is the {@action Dodge} action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. You can also sacrifice one of your attacks when you take the {@action Attack} action to command the beast to take the {@action Attack} action. If you are {@condition incapacitated}, the beast can take any action of its choice, not just {@action Dodge}.",
        "If the beast has died within the last hour, you can use your action to touch it and expend a spell slot of 1st level or higher. The beast returns to life after 1 minute with all its hit points restored.",
        "When you finish a long rest, you can summon a different primal beast. The new beast appears in an unoccupied space within 5 feet of you, and you choose its stat block and appearance. If you already have a beast from this feature, it vanishes when the new beast appears. The beast also vanishes if you die."
      ]
    },
    {
      "name": "Ranger's Companion",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "You gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a {@filter beast that is no larger than Medium and that has a challenge rating of 1/4 or lower|bestiary|challenge rating=[&0;&1/4]|type=beast|size=f;d;t;s;m|miscellaneous=!swarm}. Add your proficiency bonus to the beast's AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. Its hit point maximum equals its normal maximum or four times your ranger level, whichever is higher. Like any creature, the beast can spend Hit Dice during a short rest.",
        "The beast obeys your commands as best as it can. It takes its turn on your initiative. On your turn, you can verbally command the beast where to move (no action required by you). You can use your action to verbally command it to take the {@action Attack}, {@action Dash}, {@action Disengage}, or {@action Help} action. If you don't issue a command, the beast takes the {@action Dodge} action. Once you have the Extra Attack feature, you can make one weapon attack yourself when you command the beast to take the {@action Attack} action.",
        "If you are {@condition incapacitated} or absent, your beast companion acts on its own, focusing on protecting you and itself. It never requires your command to use its reaction, such as when making an opportunity attack.",
        "While traveling through your favored terrain with only the beast, you can move stealthily at a normal pace.",
        "If the beast dies, you can obtain another one by spending 8 hours magically bonding with another beast that isn't hostile to you, either the same type of beast as before or a different one."
      ]
    },
    {
      "name": "Exceptional Training",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Beginning at 7th level, on any of your turns when your beast companion doesn't attack, you can use a bonus action to command the beast to take the {@action Dash}, {@action Disengage}, or {@action Help} action on its turn. In addition, the beast's attacks now count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
      ]
    },
    {
      "name": "Bestial Fury",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "Starting at 11th level, when you command your beast companion to take the {@action Attack} action, the beast can make two attacks, or it can take the Multiattack action if it has that action."
      ]
    },
    {
      "name": "Share Spells",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Beast Master",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Beginning at 15th level, when you cast a spell targeting yourself, you can also affect your beast companion with the spell if the beast is within 30 feet of you."
      ]
    },
    {
      "name": "Hunter",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness. As you walk the Hunter's path, you learn specialized techniques for fighting the threats you face, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Hunter's Prey|Ranger|TACS|Hunter|TACS|3"
        }
      ]
    },
    {
      "name": "Horde Breaker",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon."
      ]
    },
    {
      "name": "Hunter's Prey",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you gain one of the following features of your choice.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Colossus Slayer|Ranger|TACS|Hunter|TACS|3"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Giant Killer|Ranger|TACS|Hunter|TACS|3"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Horde Breaker|Ranger|TACS|Hunter|TACS|3"
            }
          ]
        }
      ]
    },
    {
      "name": "Colossus Slayer",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2,
      "entries": [
        "Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra {@damage 1d8} damage if it's below its hit point maximum. You can deal this extra damage only once per turn."
      ]
    },
    {
      "name": "Giant Killer",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2,
      "entries": [
        "When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature."
      ]
    },
    {
      "name": "Defensive Tactics",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "At 7th level, you gain one of the following features of your choice.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Escape the Horde|Ranger|TACS|Hunter|TACS|7"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Multiattack Defense|Ranger|TACS|Hunter|TACS|7"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Steel Will|Ranger|TACS|Hunter|TACS|7"
            }
          ]
        }
      ]
    },
    {
      "name": "Escape the Horde",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "Opportunity attacks against you are made with disadvantage."
      ]
    },
    {
      "name": "Multiattack Defense",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn."
      ]
    },
    {
      "name": "Steel Will",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "You have advantage on saving throws against being {@condition frightened}."
      ]
    },
    {
      "name": "Multiattack",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "At 11th level, you gain one of the following features of your choice.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Volley|Ranger|TACS|Hunter|TACS|11"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Whirlwind Attack|Ranger|TACS|Hunter|TACS|11"
            }
          ]
        }
      ]
    },
    {
      "name": "Volley",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon's range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target."
      ]
    },
    {
      "name": "Whirlwind Attack",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target."
      ]
    },
    {
      "name": "Evasion",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "You can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or a {@spell lightning bolt} spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
      ]
    },
    {
      "name": "Stand Against the Tide",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice."
      ]
    },
    {
      "name": "Superior Hunter's Defense",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "At 15th level, you gain one of the following features of your choice.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Evasion|Ranger|TACS|Hunter|TACS|15"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Stand Against the Tide|Ranger|TACS|Hunter|TACS|15"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Uncanny Dodge|Ranger|TACS|Hunter|TACS|15"
            }
          ]
        }
      ]
    },
    {
      "name": "Uncanny Dodge",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Hunter",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
      ]
    },
    {
      "name": "Fey Wanderer",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "A fey mystique surrounds you, thanks to the boon of an archfey, the shining fruit you ate from a talking tree, the magic spring you swam in, or some other auspicious event. However you acquired your fey magic, you are now a Fey Wanderer, a ranger who represents both the mortal and the fey realms. As you wander the multiverse, your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Dreadful Strikes|Ranger|TACS|Fey Wanderer|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Fey Wanderer Magic|Ranger|TACS|Fey Wanderer|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Otherworldly Glamour|Ranger|TACS|Fey Wanderer|TACS|3"
        }
      ]
    },
    {
      "name": "Dreadful Strikes",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Fey Wanderer feature}",
        "You can augment your weapon strikes with mind-scarring magic, drawn from the gloomy hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra {@damage 1d4} psychic damage to the target, which can take this extra damage only once per turn.",
        "The extra damage increases to {@dice 1d6} when you reach 11th level in this class."
      ]
    },
    {
      "name": "Fey Wanderer Magic",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Fey Wanderer feature}",
        "You learn an additional spell when you reach certain levels in this class, as shown in the Fey Wanderer Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Fey Wanderer Spells",
          "colLabels": [
            "Ranger Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell charm person}"
            ],
            [
              "5th",
              "{@spell misty step}"
            ],
            [
              "9th",
              "{@spell dispel magic}"
            ],
            [
              "13th",
              "{@spell dimension door}"
            ],
            [
              "17th",
              "{@spell mislead}"
            ]
          ]
        },
        "You also possess a preternatural blessing from a fey ally or a place of fey power. Choose your blessing from the Feywild Gifts table or determine it randomly.",
        {
          "type": "table",
          "caption": "Feywild Gifts",
          "colLabels": [
            "d6",
            "Gift"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "1",
              "Illusory butterflies flutter around you while you take a short or long rest."
            ],
            [
              "2",
              "Fresh, seasonal flowers sprout from your hair each dawn."
            ],
            [
              "3",
              "You faintly smell of cinnamon, lavender, nutmeg, or another comforting herb or spice."
            ],
            [
              "4",
              "Your shadow dances while no one is looking directly at it."
            ],
            [
              "5",
              "Horns or antlers sprout from your head."
            ],
            [
              "6",
              "Your skin and hair change color to match the season at each dawn."
            ]
          ]
        }
      ]
    },
    {
      "name": "Otherworldly Glamour",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Fey Wanderer feature}",
        "Your fey qualities give you a supernatural charm. As a result, whenever you make a Charisma check, you gain a bonus to the check equal to your Wisdom modifier (minimum of +1).",
        "In addition, you gain proficiency in one of the following skills of your choice: {@skill Deception}, {@skill Performance}, or {@skill Persuasion}."
      ]
    },
    {
      "name": "Beguiling Twist",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "{@i 7th-level Fey Wanderer feature}",
        "The magic of the Feywild guards your mind. You have advantage on saving throws against being {@condition charmed} or {@condition frightened}.",
        "In addition, whenever you or a creature you can see within 120 feet of you succeeds on a saving throw against being {@condition charmed} or {@condition frightened}, you can use your reaction to force a different creature you can see within 120 feet of you to make a Wisdom saving throw against your spell save DC. If the save fails, the target is {@condition charmed} or {@condition frightened} by you (your choice) for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a successful save."
      ]
    },
    {
      "name": "Fey Reinforcements",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "{@i 11th-level Fey Wanderer feature}",
        "The royal courts of the Feywild have blessed you with the assistance of fey beings: you know {@spell summon fey|tce}. It doesn't count against the number of ranger spells you know, and you can cast it without a material component. You can also cast it once without a spell slot, and you regain the ability to do so when you finish a long rest.",
        "Whenever you start casting the spell, you can modify it so that it doesn't require concentration. If you do so, the spell's duration becomes 1 minute for that casting."
      ]
    },
    {
      "name": "Misty Wanderer",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Fey Wanderer",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Fey Wanderer feature}",
        "You can slip in and out of the Feywild to move in a blink of an eye: you can cast {@spell misty step} without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
        "In addition, whenever you cast {@i misty step}, you can bring along one willing creature you can see within 5 feet of you. That creature teleports to an unoccupied space of your choice within 5 feet of your destination space."
      ]
    },
    {
      "name": "Swarmkeeper",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "Feeling a deep connection to the environment around them, some rangers reach out through their magical connection to the world and bond with a swarm of nature spirits. The swarm becomes a potent force in battle, as well as helpful company for the ranger. Some Swarmkeepers are outcasts or hermits, keeping to themselves and their attendant swarms rather than dealing with the discomfort of others. Other Swarmkeepers enjoy building vibrant communities that work for the mutual benefit of all those they consider part of their swarm.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Gathered Swarm|Ranger|TACS|Swarmkeeper|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Swarmkeeper Magic|Ranger|TACS|Swarmkeeper|TACS|3"
        }
      ]
    },
    {
      "name": "Gathered Swarm",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Swarmkeeper feature}",
        "A swarm of intangible nature spirits has bonded itself to you and can assist you in battle. While you're alive, the swarm remains in your space, crawling on you or flying and skittering around you within your space. You determine its appearance, or you generate its appearance by rolling on the Swarm Appearance table.",
        {
          "type": "table",
          "caption": "Swarm Appearance",
          "colLabels": [
            "d4",
            "Appearance"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "1",
              "Swarming insects"
            ],
            [
              "2",
              "Miniature twig blights"
            ],
            [
              "3",
              "Fluttering birds"
            ],
            [
              "4",
              "Playful pixies"
            ]
          ]
        },
        "Once on each of your turns, you can cause the swarm to assist you in one of the following ways, immediately after you hit a creature with an attack:",
        {
          "type": "list",
          "items": [
            "The attack's target takes {@damage 1d6} piercing damage from the swarm.",
            "The attack's target must succeed on a Strength saving throw against your spell save DC or be moved by the swarm up to 15 feet horizontally in a direction of your choice.",
            "You are moved by the swarm 5 feet horizontally in a direction of your choice."
          ]
        },
        {
          "type": "inset",
          "name": "It's Your Swarm",
          "entries": [
            "A Swarmkeeper's swarm and spells are reflections of the character's bond with nature spirits. Take the opportunity to describe the swarm and the ranger's magic in play. For example, when your ranger casts gaseous form, they might appear to melt into the swarm, instead of a cloud of mist, or the {@spell arcane eye} spell could create an extension of your swarm that spies for you. Such descriptions don't change the effects of spells, but they are an exciting opportunity to explore your character's narrative through their class abilities. For more guidance on customizing spells, see the \"Personalizing Spells\" section in chapter 3.",
            "Also, remember that the swarm's appearance is yours to customize, and don't feel confined to a single appearance. Perhaps the spirits' look changes with the ranger's mood or with the seasons. You decide!"
          ]
        }
      ]
    },
    {
      "name": "Swarmkeeper Magic",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Swarmkeeper feature}",
        "You learn the {@spell mage hand} cantrip if you don't already know it. When you cast it, the hand takes the form of your swarming nature spirits.",
        "You also learn an additional spell of 1st level or higher when you reach certain levels in this class, as shown in the Swarmkeeper Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Swarmkeeper Spells",
          "colLabels": [
            "Ranger Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell faerie fire}"
            ],
            [
              "5th",
              "{@spell web}"
            ],
            [
              "9th",
              "{@spell gaseous form}"
            ],
            [
              "13th",
              "{@spell arcane eye}"
            ],
            [
              "17th",
              "{@spell insect plague}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Writhing Tide",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "{@i 7th-level Swarmkeeper feature}",
        "You can condense part of your swarm into a focused mass that lifts you up. As a bonus action, you gain a flying speed of 10 feet and can hover. This effect lasts for 1 minute or until you are {@condition incapacitated}.",
        "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Mighty Swarm",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "{@i 11th-level Swarmkeeper feature}",
        "Your Gathered Swarm grows mightier in the following ways:",
        {
          "type": "list",
          "items": [
            "The damage of Gathered Swarm increases to {@dice 1d8}.",
            "If a creature fails its saving throw against being moved by Gathered Swarm, you can also cause the swarm to knock the creature {@condition prone}.",
            "When you are moved by Gathered Swarm, it gives you half cover until the start of your next turn."
          ]
        }
      ]
    },
    {
      "name": "Swarming Dispersal",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Swarmkeeper",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Swarmkeeper feature}",
        "You can discorporate into your swarm, avoiding danger. When you take damage, you can use your reaction to give yourself resistance to that damage. You vanish into your swarm and then teleport to an unoccupied space that you can see within 30 feet of you, where you reappear with the swarm.",
        "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Gloom Stalker",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Gloom Stalkers are at home in the darkest places: deep under the earth, in gloomy alleyways, in primeval forests, and wherever else the light dims. Most folk enter such places with trepidation, but a Gloom Stalker ventures boldly into the darkness, seeking to ambush threats before they can reach the broader world. Such rangers are often found in the Underdark, but they will go any place where evil lurks in the shadows.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Dread Ambusher|Ranger|TACS|Gloom Stalker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Umbral Sight|Ranger|TACS|Gloom Stalker|TACS|3"
        }
      ]
    },
    {
      "name": "Gloom Stalker Magic",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Gloom Stalker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Gloom Stalker Spells",
          "colLabels": [
            "Ranger Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell disguise self}"
            ],
            [
              "5th",
              "{@spell rope trick}"
            ],
            [
              "9th",
              "{@spell fear}"
            ],
            [
              "13th",
              "{@spell greater invisibility}"
            ],
            [
              "17th",
              "{@spell seeming}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Umbral Sight",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you gain {@sense darkvision} out to a range of 60 feet. If you already have {@sense darkvision} from your race, its range increases by 30 feet.",
        "You are also adept at evading creatures that rely on {@sense darkvision}. While in darkness, you are {@condition invisible} to any creature that relies on {@sense darkvision} to see you in that darkness."
      ]
    },
    {
      "name": "Dread Ambusher",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you master the art of the ambush. You can give yourself a bonus to your initiative rolls equal to your Wisdom modifier.",
        "At the start of your first turn of each combat, your walking speed increases by 10 feet, which lasts until the end of that turn. If you take the {@action Attack} action on that turn, you can make one additional weapon attack as part of that action. If that attack hits, the target takes an extra 1d8 damage of the weapon's damage type."
      ]
    },
    {
      "name": "Iron Mind",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "By 7th level, you have honed your ability to resist the mind-altering powers of your prey. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
      ]
    },
    {
      "name": "Stalker's Flurry",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "At 11th level, you learn to attack with such unexpected speed that you can turn a miss into another strike. Once on each of your turns when you miss with a weapon attack, you can make another weapon attack as part of the same action."
      ]
    },
    {
      "name": "Shadowy Dodge",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Gloom Stalker",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "Starting at 15th level, you can dodge in unforeseen ways, with wisps of supernatural shadow around you. Whenever a creature makes an attack roll against you and doesn't have advantage on the roll, you can use your reaction to impose disadvantage on it. You must use this feature before you know the outcome of the attack roll."
      ]
    },
    {
      "name": "Horizon Walker",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "Horizon Walkers guard the world against threats that originate from other planes or that seek to ravage the mortal realm with otherworldly magic. They seek out planar portals and keep watch over them, venturing to the Inner Planes and the Outer Planes as needed to pursue their foes. These rangers are also friends to any forces in the multiverse—especially benevolent dragons, fey, and elementals—that work to preserve life and the order of the planes.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Horizon Walker Magic|Ranger|TACS|Horizon Walker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Detect Portal|Ranger|TACS|Horizon Walker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Planar Warrior|Ranger|TACS|Horizon Walker|TACS|3"
        }
      ]
    },
    {
      "name": "Detect Portal",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.",
        "Once you use this feature, you can't use it again until you finish a short or long rest.",
        "See the \"Planar Travel\" section in chapter 2 of the Dungeon Master's Guide for examples of planar portals."
      ]
    },
    {
      "name": "Horizon Walker Magic",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Horizon Walker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Horizon Walker Spells",
          "colLabels": [
            "Ranger Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell protection from evil and good}"
            ],
            [
              "5th",
              "{@spell misty step}"
            ],
            [
              "9th",
              "{@spell haste}"
            ],
            [
              "13th",
              "{@spell banishment}"
            ],
            [
              "17th",
              "{@spell teleportation circle}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Planar Warrior",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you learn to draw on the energy of the multiverse to augment your attacks.",
        "As a bonus action, choose one creature you can see within 30 feet of you. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra {@damage 1d8} force damage from the attack. When you reach 11th level in this class, the extra damage increases to {@dice 2d8}."
      ]
    },
    {
      "name": "Ethereal Step",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "At 7th level, you learn to step through the Ethereal Plane. As a bonus action, you can cast the {@spell etherealness} spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Distant Strike",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "At 11th level, you gain the ability to pass between the planes in the blink of an eye. When you take the {@action Attack} action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.",
        "If you attack at least two different creatures with the action, you can make one additional attack with it against a third creature."
      ]
    },
    {
      "name": "Spectral Defense",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Horizon Walker",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "At 15th level, your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack's damage on this turn."
      ]
    },
    {
      "name": "Monster Slayer",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 3,
      "entries": [
        "You have dedicated yourself to hunting down creatures of the night and wielders of grim magic. A Monster Slayer seeks out vampires, dragons, evil fey, fiends, and other magical threats. Trained in supernatural techniques to overcome such monsters, slayers are experts at unearthing and defeating mighty, mystical foes.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Monster Slayer Magic|Ranger|TACS|Monster Slayer|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Hunter's Sense|Ranger|TACS|Monster Slayer|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Slayer's Prey|Ranger|TACS|Monster Slayer|TACS|3"
        }
      ]
    },
    {
      "name": "Hunter's Sense",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "At 3rd level, you gain the ability to peer at a creature and magically discern how best to hurt it. As an action, choose one creature you can see within 60 feet of you. You immediately learn whether the creature has any damage immunities, resistances, or vulnerabilities and what they are. If the creature is hidden from divination magic, you sense that it has no damage immunities, resistances, or vulnerabilities.",
        "You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses of it when you finish a long rest."
      ]
    },
    {
      "name": "Monster Slayer Magic",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Monster Slayer Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Monster Slayer Spells",
          "colLabels": [
            "Ranger Level",
            "Spells"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "3rd",
              "{@spell protection from evil and good}"
            ],
            [
              "5th",
              "{@spell zone of truth}"
            ],
            [
              "9th",
              "{@spell magic circle}"
            ],
            [
              "13th",
              "{@spell banishment}"
            ],
            [
              "17th",
              "{@spell hold monster}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Slayer's Prey",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting at 3rd level, you can focus your ire on one foe, increasing the harm you inflict on it. As a bonus action, you designate one creature you can see within 60 feet of you as the target of this feature. The first time each turn that you hit that target with a weapon attack, it takes an extra {@damage 1d6} damage from the weapon.",
        "This benefit lasts until you finish a short or long rest. It ends early if you designate a different creature."
      ]
    },
    {
      "name": "Supernatural Defense",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2,
      "entries": [
        "At 7th level, you gain extra resilience against your prey's assaults on your mind and body. Whenever the target of your Slayer's Prey forces you to make a saving throw and whenever you make an ability check to escape that target's grapple, add {@dice 1d6} to your roll."
      ]
    },
    {
      "name": "Magic-User's Nemesis",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2,
      "entries": [
        "At 11th level, you gain the ability to thwart someone else's magic. When you see a creature casting a spell or teleporting within 60 feet of you, you can use your reaction to try to magically foil it. The creature must succeed on a Wisdom saving throw against your spell save DC, or its spell or teleport fails and is wasted.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Slayer's Counter",
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Monster Slayer",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2,
      "entries": [
        "At 15th level, you gain the ability to counterattack when your prey tries to sabotage you. If the target of your Slayer's Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds, in addition to the attack's normal effects."
      ]
    },
    {
      "name": "Winter Walker",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Winter Walker",
      "page": 1,
      "level": 3,
      "header": 1,
      "entries": [
        "You traverse primarily through colder environments. Tundras, certain layers of hell, perhaps even throughout the coldest parts of the feywild. Adapting to this specific environment, your magic also adapts to it, granting you certain cryomantic abilities.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Freezing Strikes|Ranger|TACS|Winter Walker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Winter Walker Magic|Ranger|TACS|Winter Walker|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Frost Walker|Ranger|TACS|Winter Walker|TACS|3"
        }
      ]
    },
    {
      "type": "entries",
      "name": "Freezing Strikes",
      "entries": [
        "Starting at 3rd level, you can augment your weapon strikes with body numbing magic, drawn from the frozen wastes of the tundras you traverse. When you hit a creature with a weapon, you can deal an extra 1d6 cold damage and their speed is reduced by 10 feet until the start of your next turn, you can only apply this extra damage and speed reduction once per turn.",
        "The extra damage increases to 1d8 when you reach 11th level in this class."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Winter Walker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2
    },
    {
      "name": "Winter Walker Magic",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Winter Walker",
      "page": null,
      "level": 3,
      "header": 2,
      "entries": [
        "You learn an additional spell when you reach certain levels in this class, as shown in the Winter Walker Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Winter Walker Spells",
          "colLabels": [
            "Ranger Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "3rd",
              "{@spell glacial grip|TACS}"
            ],
            [
              "5th",
              "{@spell winter's grasp|TACS}"
            ],
            [
              "9th",
              "{@spell sleet storm}"
            ],
            [
              "13th",
              "{@spell ice storm}"
            ],
            [
              "17th",
              "{@spell cone of cold}"
            ]
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Frost Walker",
      "entries": [
        "Also at 3rd level, you are adept at traversing through snowy environments and are an expert at guiding your allies through said environments. You have advantage on saving throws made to resist the effects of extreme cold and you do not suffer the effects of difficult terrain from ice and snow. By spending 10 minutes, you can magically bestow this benefit to any number of creatures within 30 feet of you up to your proficiency bonus plus your Wisdom modifier. This benefit lasts for 8 hours and once you grant it, you cannot do so again until you finish a long rest.",
        "If you chose the arctic terrain as your favored terrain from the Natural Explorer feature, you can grant this magical benefit as an action rather than spending 10 minutes and you can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest. When you use an action to grant these benefits, it instead only lasts for a minute."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Winter Walker",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Warden of Winter",
      "entries": [
        "At 7th level, you are aware of the dangers that lurk in the coldest of environments and your study over these creatures allows you to better prepare for them. You have resistance to cold damage and you have advantage on ability checks and saving throws made against effects that would reduce your movement in any way, including ways that would indirectly affect your speed such as being {@condition stunned} or {@condition paralyzed} which would take away your ability to move, even though it does not directly reduce your speed.",
        "When you use your Frost Walker feature to grant other creatures the benefits of it, one of those creatures may also magically gain the benefits of this feature."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Winter Walker",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Frozen Sentinel",
      "entries": [
        "At 11th level, you can use your magic to ward yourself and your allies with a protective ice barrier. As a bonus action you can grant yourself and a number of allies within 30 feet of you up to your Wisdom modifier (minimum of 1) temporary hit points equal to your ranger level. While they have these temporary hit points, whenever a creature hits them with a melee attack from within 5 feet of them the attacker takes an amount of cold damage equal to your ranger level.",
        "You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Winter Walker",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Preserving Ward",
      "entries": [
        "At 15th level, you can use your magic to freeze over a dead creature, extending the duration needed to revive them with spells. You can cast gentle repose without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
        "In addition, if you cast gentle repose on a creature whose been dead for no longer than a minute, some of your magic lingers within the corpse and tethers the soul to the creature before it can pass on into the afterlife. The cost for any material needed for a spell to bring the creature back to life, such as revivify, is halved until the spell ends."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Winter Walker",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2
    },
    {
      "name": "The Lore Hunter",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "page": null,
      "level": 3,
      "header": 1,
      "entries": [
        "Some rangers specialize in the pursuit of knowledge, an archeologist traversing his way through an ancient tomb, hunting for strange and rare artifacts. Rangers of this conclave often dig up old relics of the past and try to decipher them to learn the secrets they hold.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Lore Hunter Magic|Ranger|TACS|Lore Hunter|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Relic Knowledge|Ranger|TACS|Lore Hunter|TACS|3"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Blast From the Past|Ranger|TACS|Lore Hunter|TACS|3"
        }
      ]
    },
    {
      "name": "Lore Hunter Magic",
      "source": "TACS",
      "className": "Ranger",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "page": null,
      "level": 3,
      "header": 2,
      "entries": [
        "You learn an additional spell when you reach certain levels in this class, as shown in the Lore Hunter Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
        {
          "type": "table",
          "caption": "Lore Hunter Spells",
          "colLabels": [
            "Ranger Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "3rd",
              "{@spell identify}"
            ],
            [
              "5th",
              "{@spell borrowed knowledge|SCC}"
            ],
            [
              "9th",
              "{@spell glyph of warding}"
            ],
            [
              "13th",
              "{@spell death ward}"
            ],
            [
              "17th",
              "{@spell legend lore}"
            ]
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Relic Knowledge",
      "entries": [
        "Starting at 3rd level, you've been researching old, forgotten magic for years and have learned how to manifest it by tattooing runes onto your body. You gain proficiency in the History and Arcana skills. Your proficiency bonus is doubled for any ability check you make that uses either of those proficiencies.",
        "In addition, you have advantage on Intelligence (Investigation) and Wisdom (Perception) checks made to find or detect traps, or to see through illusions."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Blast From the Past",
      "entries": [
        "Also at 3rd level, you can empower your attacks with magic from the runes on your body. When you hit a creature with a weapon, you can deal an extra {@dice 1d6} force damage to the target, which can take this extra damage only once per turn.",
        "The extra damage increases to 1d8 when you reach 11th level in this class."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 3,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Ritual Master",
      "entries": [
        "Starting at 7th level, you can cast a ranger spell as a ritual if that spell has the ritual tag and you have the spell prepared. In addition, when you ritual cast a spell, it takes you an extra 5 minutes instead of 10 to cast.",
        "In addition, after you finish a long rest you can choose one of your prepared ranger spells, the chosen spell can be of a level no higher than half of your proficiency bonus (rounded down). The chosen spell is given the ritual tag until you next finish a long rest."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Detect Dungeon",
      "entries": [
        "Also at 7th level, you can focus your mind to magically sense dungeons or ruins that contain valuable treasures, such as a dragon’s hoard or the temple of an ancient ruler. As an action, you detect the distance and direction to the closest dungeon or ruin within 10 miles of you. In order for a location to qualify for this feature, there must be enough treasure worth at least 1,000 gp or more.",
        "Alternatively, you can name a creature or object associated and/or familiar with the dungeon or ruin and roll an Intelligence (Arcana) ability check. The DC equals the CR of the creature or 15 if it is an object. If the object is a magic item, the DC increases by 5 if it is a Rare or Very Rare item and by 10 if it is a Legendary item or an Artifact. If the target is protected by divination magic, you gain no information about it.",
        "On a successful check, you learn the location of the target, as well as the distance and direction of it. You retain this knowledge for the next 24 hours, after which it is magically lost.",
        "Once you’ve used this feature using either of the methods above, you cannot use it again until you finish a long rest."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 7,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Ancient Wisdom",
      "entries": [
        "Starting at 11th level, when you make an Intelligence ability check using a skill or tool, you can add your Wisdom modifier to the roll.",
        "You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest. While you have no uses available, you can spend a spell slot of any level to use this feature again."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 11,
      "header": 2
    },
    {
      "type": "entries",
      "name": "Relics of The Past",
      "entries": [
        "Starting at 15th level, you're able to manifest a powerful item using old and forgotten magic. By performing a 1-hour ritual and expending a 3rd level or higher spell slot, you can manifest one of the following items, which lasts until you use this feature again or until you die:",
        {
          "type": "list",
          "items": [
            {
              "name": "Relic Talisman",
              "type": "entries",
              "entries": [
                "You create a magical talisman which wards the wearer with a protective aura. A creature wearing this talisman gains a +2 bonus to AC and saving throws."
              ]
            },
            {
              "name": "Relic Armament",
              "type": "entries",
              "entries": [
                "You can create a non-magical martial or simple weapon, which becomes magical after it is created. The wielder has a +1 bonus to attack and damage rolls made with this magic weapon and once per turn when they hit with it, it deals an additional {@dice 1d6} force damage."
              ]
            },
            {
              "name": "Relic Ring",
              "type": "entries",
              "entries": [
                "You create a ring capable of storing magic within it. As an action, you can choose one of your prepared ranger spells and store it within the ring. The spell must be no higher than 3rd level. A creature can cast the spell from the ring once, without expending a spell slot or requiring material components. The spell uses your spell save DC and spell attack modifier. You can use an action to choose a different spell to store into the ring, taking out the previous one. Once a creature casts a spell from this ring, a creature cannot do so again until you finish a long rest."
              ]
            },
            {
              "name": "Relic Aegis",
              "type": "entries",
              "entries": [
                "You create a set of light or medium non-magical armor, which becomes magical after it is created. The armor gives the wearer a +1 bonus to their AC and the wearer’s movement speed is increased by 10 feet."
              ]
            }
          ]
        },
        "Once you’ve manifested an item with this feature, you cannot do so again until you finish a long rest."
      ],
      "source": "TACS",
      "page": null,
      "className": "Ranger",
      "classSource": "TACS",
      "subclassShortName": "Lore Hunter",
      "subclassSource": "TACS",
      "level": 15,
      "header": 2
    }
  ],
  "optionalfeature": [
    {
      "name": "Dual Fighting",
      "source": "TACS",
      "featureType": [
        "FS:F",
        "FS:B",
        "FS:R"
      ],
      "entries": [
        "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
        "You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one."
      ]
    }
  ],
  "spell": [
    {
      "name": "Air Promenade",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform elegant and rhythmic movements to allow yourself to dance through the air effortlessly as powerful winds lift you off the ground. For the duration, you have a flying speed equal to your walking speed and can hover, but you cannot ascend any higher than 10 feet off the ground. ",
        "When the spell ends, you safely descend to the ground, provided you are no higher than 20 feet. If you are higher than 20 feet when the spell ends, you fall at a normal rate."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 4th level or higher, the duration is 8 hours. If you use a spell slot of 6th level or higher, the duration is 24 hours. Using a spell slot of 4th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Aquarius's Veil",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A gilded gemstone worth 500 gp filled with ocean water",
          "cost": 50000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You don yourself with a veil of watery armor. Until the spell ends, you have the following benefits:",
        {
          "type": "list",
          "items": [
            "You have immunity to fire damage and resistance to cold damage.",
            "You have a swim speed of 80 feet and can breathe underwater as you do air.",
            "While you're not wearing armor, your armor class becomes 14 + your Dexterity modifier and you have advantage on Strength and Dexterity saving throws.",
            "You have advantage on attack rolls made with daggers, javelins, shortswords, spears, or tridents and you can use your spellcasting ability for the attack and damage rolls made with such weapons in place of Strength or Dexterity.",
            "You gain 60 temporary hit points. If any of these remain when the spell ends, they are lost."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Fiery Earth",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and fire, syncing together in a perfect harmony. Until the spell ends, the target is wreathed in magical flames that retaliate against creatures that hit them with melee attacks, dealing {@damage 1d8} fire damage to the attacker.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of earth and the elemental plane of fire. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} fire or poison damage.",
        "Also, whenever a creature under the effects of this spell heals a creature with a spell, they can add {@dice 1d8} healing to one of the rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire",
        "poison"
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Flowing Life",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and water, syncing together in a perfect harmony. Until the spell ends, the target has a swim and climb speed of 60 feet and do not suffer penalties to their speed while traversing through difficult terrain.",
        "In addition, the target can empower their ability to heal immensely by channeling both of the primordial energies of the elemental plane of earth and the elemental plane of water. Whenever they heal a creature with a spell, they can add an additional {@dice 2d8} healing to one of the rolls from the spell.",
        "In addition, when they heal a creature with a spell, they can remove any one condition or disease, or they can remove one level of {@condition exhaustion}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Storms",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of air and water, syncing together in a perfect harmony. Until the spell ends, the target has a flying speed of 60 feet and can hover.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of air and the elemental plane of water. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} lightning or thunder damage and creatures who take this damage are pushed up to 10 feet away from the attacker or source of the spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "lightning",
        "thunder"
      ],
      "miscTags": [
        "FMV"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Blade of Frost",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "sphere",
        "distance": {
          "type": "feet",
          "amount": 5
        }
      },
      "components": {
        "s": true,
        "m": "a melee weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You brandish the weapon used in the spell's casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack's normal effects and then ice begins to creep from the point of impact. The target's speed is reduced by 10 feet until the start of your next turn.",
        "This spell's damage increases when you reach certain levels. At 5th level, the melee attack deals an extra {@damage 1d8} cold damage to the target on a hit. The extra damage increases by {@dice 1d8} at 11th level ({@dice 2d8}) and again at 17th level ({@dice 3d8})."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Blustering Winds",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You extend your hands and gales of wind blows around you in a 10 foot radius centered on you. Creatures within range make a strength saving throw. On a failed save, the creature takes {@damage 1d10} bludgeoning damage and is pushed 10 feet back and knocked {@condition prone}. On a success, they take half damage and suffers no additional effects."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Boulder Bash",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a giant rock and throw it in a 5-foot-wide 30-foot-long line. Each creature within range must make a Dexterity saving throw, taking {@damage 3d10} bludgeoning damage and is knocked {@condition prone} on a failed save or half as much on a success and is not knocked {@condition prone}. When the rock reaches the end of its range, or if it hits a wall, the rock vanishes. If it hits a wall, the wall automatically takes damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd"
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Burning Touch",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You ignite your hands with red hot flames and attempt to burn a creature. Make a melee spell attack, on hit it takes {@damage 2d8} fire damage and must make a Constitution saving throw. On a failed save, they are caught on fire and takes an additional {@damage 1d8} fire damage at the start of each of their turns for the duration. A creature can use its action to put out the flames, or at the end of each of the affected creature's turn it can repeat its Constitution save, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "spellAttack": [
        "M"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Charity",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You touch a creature and imbue them with a small pool of your magical power, which can restore them in two different ways. If the target is a spellcaster, you can have it regain one of its expended spell slots of 2nd level or lower. If the target is not a spellcaster, or if it chooses not to regain a spell slot, it instead regains a number of hit points equal to {@dice 4d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the maximum expended slot level that can be regained increases by 1 and the healing increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Chilling Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The next time you hit with a melee weapon attack during this spell's duration, your weapon is freezing cold to the touch, and the attack deals an extra {@damage 1d8} cold damage. If the target is a creature, at the start of its next turn it must succeed a Constitution saving throw or have their movement speed cut in half until the spell ends. The creature may repeat its save at the start of each of its turns until the spell ends, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cold Snap",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You snap your fingers and a burst of cold energy cracks at a point you choose within range. Each creature in a 15-foot-radius sphere centered on that point must make a Constitution saving throw. A target takes {@damage 6d6} cold damage and their movement is reduced to 0 until the start of your next turn on a failed save, or half as much damage on a successful one and their speed is not reduced.",
        "The cold vapors spread around corners. It freezes non-magical objects and liquid in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@damage 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Contact Ancient Spirits",
      "source": "TACS",
      "level": 3,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny statue made of gold or silver worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "You reach out to the great beyond to call upon the wisdom of ancient souls of long dead scholars. Three tiny sized spirits which take the forms of balls of light float around you within range of the spell. You can ask each of the spirits a single question, which they must answer truthfully. After a spirit has answered your question, it disappears. You must ask your questions before the spell ends.",
        "Each spirit has a +10 to any Intelligence ability check, though depending on the question, a check may or may not be required (DM's choice). If a check is required, the DM determines the DC based on the rarity of the answer, the rarest resulting in a DC 30, whereas an uncommon answer results in a DC 15. The spirit takes the form of a creature who may know the answer to your question when it is asked. The creature does not have to be humanoid. A failed check results in the spirit being unable to answer the question, and disappears out of embarrassment or prideful arrogance.",
        "The spell fails if you have cast it within the last 24 hours."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Counterspell",
      "source": "TACS",
      "otherSources": [
        {
          "source": "PHB",
          "page": 228
        }
      ],
      "level": 3,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a creature within 60 feet of you casting a spell and you are not casting a spell."
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You attempt to interrupt a creature in the process of casting a spell. Make an ability check using your spellcasting ability and add your proficiency bonus to the roll. The DC equals the caster’s spell save DC. On a success, its spell fails and has no effect.",
        "On a failure, their spell succeeds but its effects are dampened as your spell acts as a buffer for its effects. The spell’s damage, healing, range, and duration is halved. If there was nothing to halve, this spell simply has no effect. If your check fails by 5 or more, this spell also has no effect.",
        "An astute caster can recognize when their spell is about to fail and attempt to reinforce it with their own magic. A creature with proficiency in arcana can use their reaction to add to the DC equal to the level they are casting their own spell at."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, you can add a +1 bonus to  your spellcasting ability check used for the spell for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ],
        "fromSubclass": [
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption (UA)",
              "source": "UAATrioOfSubclasses"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption",
              "source": "XGE"
            }
          },
          {
            "class": {
              "name": "Sorcerer",
              "source": "PHB"
            },
            "subclass": {
              "name": "Clockwork Soul (UA)",
              "source": "UA2020SubclassesPt2"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers (UA)",
              "source": "UA2020SubclassesPt1"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers",
              "source": "TCE"
            }
          }
        ]
      },
      "races": [
        {
          "name": "Human (Mark of Sentinel)",
          "source": "ERLW",
          "baseName": "Human",
          "baseSource": "PHB"
        }
      ],
      "backgrounds": [
        {
          "name": "Azorius Functionary",
          "source": "GGR"
        }
      ]
    },
    {
      "name": "Creeping Cold",
      "source": "TACS",
      "level": 5,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pinch of powdered snow"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You choose a creature within range that you can see and mark them with a freezing cold brand. Ice begins to slowly creep from the ground beneath their feet to the tip of their head, covering the body with ice. The creature must make a Constitution saving throw. On a failed save, they take {@damage 6d6} cold damage and is {@condition restrained} as they are frozen to the ground. If the creature is airborne, a pillar of ice is made between the creature and the ground. The ice occupies the spaces in between it and the ground and the creature's elevation remains the same. The spell fails if the creature is more than 30 feet off the ground. On a successful save, the creature takes half damage and isn't affected. A creature is also unaffected by the spell if it has immunity to cold damage or being {@condition petrified} and a creature with resistance to cold damage has advantage on its saves against the spell.",
        "A creature affected by the spell must make another Constitution saving throw at the end of each of its turns. On a failed save, it takes an additional {@damage 2d6} cold damage or half as much on a success. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to a frozen statue and subjected to the {@condition petrified} condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.",
        "A creature may use its action to break off a piece of the ice. Doing so counts as one successful save for the purposes of the spell. Every time the creature takes any amount of piercing or fire damage counts as one successful save."
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cutting Wind",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "Magical winds build up in your hands and launch out to a creature within range. Make a ranged spell attack. On hit, the target takes {@damage 1d6} slashing damage and are left scarred with magic. Until the start of your next turn, the next weapon attack that hits the target deals an additional {@damage 1d6} damage of the weapon's type.",
        "This spell's damage increases when you reach certain levels. At 5th level, the attack's damage increases by {@damage 1d6} ({@dice 2d6}). Both damage rolls increase by {@dice 1d6} at 11th level ({@dice 3d6} and {@dice 2d6}) and the attack again increases by {@dice 1d6} at 17th level ({@dice 4d6} and {@dice 2d6})."
      ],
      "damageInflict": [
        "slashing"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cyclone",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You summon a brief powerful windstorm to launch your enemies into the air. Choose a point within range, you summon a swirling windstorm in a 20-foot tall 20-foot radius cylinder. Every creature within the cylinder makes a Strength saving throw. On a failed save, they take {@damage 6d6} bludgeoning damage and are pulled to the top of the cylinder toward the center, falling to the ground afterward. On a success they take half as much and are not pulled."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Destruct Riff",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A musical instrument worth at least 1 sp"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You play a quick and powerful musical performance. Make a ranged spell attack against a creature or object to assail it with the rupturing power of song. On a hit, the target takes {@damage 1d8} thunder damage and are pushed 5 feet away from you.",
        "If you hit a construct target, it also has disadvantage on attack rolls against you until the end of your next turn.",
        "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), and 17th level ({@dice 4d8})."
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "FMV"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine Avatar",
      "source": "TACS",
      "level": 12,
      "school": "T",
      "subschools": [
        "epic spell"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A crystal or gem containing the soul of a dead god worth at least 100,000 gp"
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You assume the form of a god of your choosing. You become an avatar of said god, using an appropriate statblock. If one is not otherwise provided, you use the Divine Avatar statblock and if you do, choose from one of the listed domains: Arcana, Death, Forge, Grave, Knowledge, Life, Light, Nature, Order, Peace, Tempest, Trickery, Twilight, or War. You gain certain statistics depending on the domain you chose.",
        "You maintain this form for the duration, until your hit points is reduced to 0 in that form, or until you dismiss the spell as an action. Becoming even the avatar of a god, even for a moment, is a taxing endeavor. You gain three levels of {@condition exhaustion}, which cannot be recovered until you complete a long rest for each individual {@condition exhaustion} level. In addition, you lose the ability to cast spells until you finish a long rest."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Fiery Chains",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You launch outward a chain of fire that wraps around a target of your choice that you can see within range. Three additional chains then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the chains.",
        "A target must make a Dexterity saving throw. The target takes {@damage 6d6} fire damage and is {@condition restrained} on a failed save, or half as much damage and is not {@condition restrained} on a success.",
        "A {@condition restrained} creature takes {@damage 2d6} fire damage at the start of its turns and can use its action to attempt to break out of the chains by making a successful Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, one additional chain leaps from the first target to another target for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Flames of Life or Death",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "A wave of fiery energy washes out from a point centered on yourself. Choose either life or death. You can expend one of your Hit Dice and make three rolls using the size of the chosen Hit Die. You take damage equal to the total number rolled as burns envelop your body and your constitution is used to fuel the spell. You then apply one of the following effects depending on what you chose:",
        "{@b Death.} Every other creature in that area needs to make a Dexterity saving throw, taking fire damage equal to the total number rolled plus your spellcasting ability modifier on a failed save, or half as much on a success.",
        "{@b Life.} Every other creature you choose in that area regains hit points equal to the total number rolled plus your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, the number of dice rolled increases by one for each slot level above 6th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Encore",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a spell being cast"
        }
      ],
      "range": {
        "type": "special"
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "special"
        }
      ],
      "entries": [
        "When you see a 2nd level or lower spell being cast, you can immediately use your reaction to cast that spell, using its range and duration for this spell's. If you do not meet the requirements of the spell, such as having costly material components or a specific prerequisite listed in the spell, the spell fails. The spell also fails if the casting time is not an action or bonus action.",
        "When you cast that spell in this way, it is cast at its lowest level, but uses your spellcasting ability for it."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the level of spell you can encore can be one level higher for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fairy Fun",
      "source": "TACS",
      "level": 1,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You summon forth the mischief of the fey and implore various pranks and tricks onto a creature, causing them one of varying effects. Choose a creature that you can see within range, they suffer one of the following effects of your choosing for the duration, or until you end the spell as a bonus action.",
        {
          "type": "entries",
          "name": "Hallucinations",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, they have disadvantage on {@skill Perception} checks that rely on sight, as colorful and misty visions of various fey creatures cloud their vision. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Tumbling Fool",
          "entries": [
            "The target makes a Dexterity saving throw. On a failed save, they have disadvantage on Dexterity-based attack rolls and Dexterity ability checks, as they begin to tumble and fool around. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Babble of Doom",
          "entries": [
            "The target makes a Charisma saving throw. On a failed save, they have disadvantage on Charisma ability checks as they begin to babbling over their words like a fool. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Forgetful Idiot",
          "entries": [
            "The target makes an Intelligence saving throw. On a failed save, they struggle to recall specific details on anything, such as a name, yet they always have that feeling of familiarity as if the information is constantly on the tip of their tongue. They have disadvantage on Intelligence ability checks. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Beware the Bear",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, everyone in their vision appears as a giant, terrifying bear that fills them with a magical fear. The target is {@condition frightened} for the duration. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Why is it Always Chickens?!",
          "entries": [
            "The target makes a Strength saving throw. On a failed save, countless chickens flock from out of nowhere and bombard the target, causing them to fall {@condition prone}. This effect repeats at the end of each of the target's turns, until they succeed against it three times, ending the effect."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fey Transformation",
      "source": "TACS",
      "level": 3,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a gilded flower from the feywild worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with an iridescent aura that allows you to take the visage of a creature from the feywild. When you cast the spell, you choose one of the following forms to assume: Fuming, Mirthful, or Tricksy.",
        {
          "type": "entries",
          "name": "Fuming",
          "entries": [
            "Your iridescent aura becomes a fiery aura which empowers you with the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "Your weapon and spell attacks deal an additional {@damage 1d6} fire damage on hit.",
            "You emit bright light out to a range of 30 feet and dim light for an additional 30 feet.",
            "Creatures that hit you with melee attacks take {@damage 1d6} fire damage."
          ]
        },
        {
          "type": "entries",
          "name": "Mirthful",
          "entries": [
            "Your iridescent aura becomes a shimmering sparkle that makes you more appealing, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You have advantage on Charisma ({@skill Persuasion}) checks.",
            "Creatures you choose that can hear you speak must make a Wisdom saving throw or become {@condition charmed} by you until the spell ends, or until you or your allies do something hostile toward them after they were {@condition charmed}.",
            "You have advantage on Charisma saving throws and are immune to being {@condition charmed}."
          ]
        },
        {
          "type": "entries",
          "name": "Tricksy",
          "entries": [
            "Your iridescent aura becomes a shadowy veil, protecting you from sight, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You become {@condition invisible} until the spell ends, or until you make an attack or cast a spell. At the start of each of your turns, you become {@condition invisible} again if you weren't already.",
            "You have advantage on Dexterity and Intelligence saving throws.",
            "If you make an attack roll with advantage, you deal an additional {@damage 1d6} psychic damage on hit."
          ]
        },
        "As a bonus action on your turn, you can shift your form to a different one, losing the previous benefits and gaining the new ones until the spell ends. Doing so halves the current duration of the spell."
      ],
      "conditionInflict": [
        "charmed"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Flames of Avernus",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "cone",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "A wave of heat bursts out of your hands originating from the nine hells, incinerating creatures in a 120-foot cone of fire. Each creature within range makes a Constitution saving throw. On a failed save they take {@damage 20d6} fire damage and are lit on fire for the duration. Creatures who failed take {@damage 5d6} fire damage at the start of each of their turns. As an action, a creature can attempt to put out the flames with a Dexterity ability check against your spell save DC. A creature that attempts this, pass or fail, takes {@damage 2d6} fire damage. On a success, the flames are put out and its effects no longer persist. On a fail, the flames and the spell persists.",
        "On a successful save, the creatures take half the initial damage and are not lit on fire.",
        "A creature who dies while under the effects of the spell has their body immediately turned to scorched ash, leaving behind only any magical items they had in their possession."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Transformation",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A chunk of rare precious metal worth 1000 gp infused with magical moss, which the spell consumes",
          "consumed": true,
          "cost": 100000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You assume a magical form by mimicking the powers of Gaia. Your body becomes stone and moss forms randomly around your body. Choose either Guardian or Warrior. You gain the following benefits depending on what you chose when you cast the spell:",
        {
          "type": "list",
          "items": [
            "You are immune to poison; bludgeoning, piercing, and slashing damage from non-magical weapons that are not adamantine. You have resistance to slashing, piercing, and bludgeoning damage regardless of the source.",
            "You are immune to the {@condition poisoned} and {@condition petrified} conditions.",
            "Your size becomes one size category larger. If you were gargantuan, you become twice as large. As a result, you deal twice as much damage with weapons against objects.",
            "You have a burrow speed of 40 feet and can move through solid stone effortlessly, leaving the earth untampered with as you pass by.",
            "You have a +2 bonus to AC (Guardian), or you have a +2 bonus to Strength, Dexterity, and Constitution saving throws (Warrior).",
            "All your weapon attacks are magical, and when you make a weapon attack, you can use your spellcasting ability modifier, instead of Strength or Dexterity, for the attack and damage rolls.",
            "You gain 100 temporary hit points (Guardian) or you gain 50 temporary hit points (Warrior). If any of these remain when the spell ends, they are lost.",
            "Your weapon attacks deal an additional {@damage 2d10} bludgeoning damage (Warrior) or when you're not wearing armor, your AC becomes 20. You can still gain the benefits of a shield while under the effects of this spell (Guardian).",
            "(Warrior) You can attack twice, instead of once, when you take the {@action Attack} action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that lets you attack more than once when you take the Attack action on your turn; (Guardian) or you can use your action to form a protective barrier on any number of allies within 30 feet of you, protecting them from damage from one source reducing that damage to 0 (such as a weapon, spell, a dragon's breath weapon, etc.). This barrier lasts until the start of your next turn."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 300
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small chunk of a meteorite"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a large object made of stone which appears 200 feet above the point you choose. The stone can take any shape or appearance, so long as it is purely made of a form of earth. The object crashes directly onto the point you choose and creates. Each creature within a 60-foot radius makes a dexterity saving throw or takes {@damage 40d6} bludgeoning damage from the debris, or half as much on a success. ",
        "Objects in the area automatically take twice as much damage. ",
        "A 60-foot radius and 30-foot deep creator is left in the wake of the object, with the object completely destroyed and gravel fills the area, making it difficult terrain"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gale of The Primordials",
      "source": "TACS",
      "level": 9,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a wing from a powerful creature, such as an angel or winged beast from the elemental plane of air"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "A powerful wind builds up from your feet, granting you unmatched flight. You gain a flying speed of 150 feet for the duration. You take no damage as a result of falling and are immune to being {@condition grappled} or {@condition restrained} as wind rushes from you, preventing anything from keeping hold of you.",
        "Ranged attacks made against you have disadvantage and automatically miss if you are within their long range distance."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Giant's Strength",
      "source": "TACS",
      "level": 2,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a piece of mithral or adamantine worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body, empowering you with the might of giants. If your Strength score is lower than 19, it becomes 19 for the duration. If your strength score is being reduced by any effect, the reduction is still applied."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, your Strength score increases by 2 for every two slot levels above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Glacial Grip",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You release a magical hand made of freezing cold ice toward a creature you can see. Make a ranged spell attack against that creature. On a hit, the hand grasps onto the target and it takes {@damage 1d8} cold damage, and on each of your turns for the duration, you can use a bonus action to deal {@damage 1d8} cold damage to the target automatically, except the turn you cast the spell. Each time the target takes damage from the spell, its speed is reduced by 10 feet. The creature makes a constitution saving throw at the end of each of its turns, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by {@damage 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT",
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guided Hand",
      "source": "TACS",
      "level": 1,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You touch a creature, granting them the ability to strike true. Once before the spell ends, the target can give themself advantage on one weapon attack roll on their turn, as a spectral hand from a comforting source guides their attack. That attack deals an extra {@damage 1d6} radiant or necrotic damage on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Guise of The Blood Witch",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a vile of humanoid blood engraved with arcane sigils worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Uttering an incantation, you draw on the magic of the blood witch to transform yourself. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "You are immune to being {@condition charmed} and have advantage on saving throws against enchantment spells.",
            "Whenever you take damage from a spell or effect originating from yourself, you can choose to not take damage once on each of your turns.",
            "You have a magical flying speed of 30 feet and you can hover.",
            "You gain 30 temporary hit points. If any of these remain when the spell ends, they are lost.",
            "You can use a bonus action on each of your turns to turn your gaze to a creature you can see within 60 feet. That creature makes a wisdom saving throw or takes {@damage 4d6} necrotic damage and is {@condition frightened} until the spell ends. They take half damage and are not {@condition frightened} on a successful save."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guise of the Haunted Fey",
      "source": "TACS",
      "level": 0,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with haunting lights and illusory sounds, making you look and sound like a horrifying fey creature from the Unseelie court. For the duration, you have advantage on Charisma ({@skill Intimidation}) checks."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Heart Sunder",
      "source": "TACS",
      "level": 4,
      "school": "N",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of blood from a humanoid"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You fill a creature you choose within range that you can see with necrotic energy. You cause their heart to beat rapidly and then stop momentarily. The creature makes a constitution saving throw taking {@damage 8d6} necrotic damage and is {@condition stunned} until the start of your next turn on a failed save, or half as much and is not {@condition stunned} on a success. Undead and Constructs automatically pass the saving throw of this spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 and the duration increases by 1 additional round for each slot level above 4th."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "stunned"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Investiture of Water",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Until the spell ends, your body takes a watery appearance, and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to cold; bludgeoning, piercing, and slashing damage from non-magical attacks.",
            "You have a swim speed of 60 feet and can breathe underwater as you do air.",
            "You are always treated as if you were submerged underwater.",
            "You can use your action to create a 10 foot long whip made of water. You can use a bonus action to attack with the whip. When you do, make a melee spell attack with a range of 10 feet. On hit, the water whip deals {@dice 2d4} plus your spellcasting ability modifier bludgeoning damage and the target makes a Strength saving throw. On a failed save, they are knocked {@condition prone}.",
            "You can use your action to control nearby water to snare your enemies. Choose a creature within 30 feet of a pool of water that is within 120 feet of you. That creature must make a Dexterity saving throw or be {@condition restrained}. You can use a bonus action to drag a creature {@condition restrained} in this way 10 feet closer to the pool. Once the creature is close enough, it can be dragged underneath the pool of water. A creature can use an action to repeat its Strength save, ending the {@condition restrained} effect on a success."
          ]
        }
      ],
      "damageResist": [
        "fire"
      ],
      "damageImmune": [
        "cold"
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "N",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Lightning Spear",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "an electrified twig"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You create a bolt of lightning in your hand and throw it at a creature you can see within range. Make a ranged spell attack, on hit you deal {@damage 3d10} lightning damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d10} for each slot level above 2nd. When you cast this spell using a spell slot of 4th level or higher, you can create one additional bolt and throw it at another creature or the same creature, but it only deals {@damage 2d10} lightning damage on hit. When you cast this spell using a spell slot of 7th level or higher, the second bolt increases to {@damage 4d10} damage."
          ]
        }
      ],
      "damageInflict": [
        "lightning"
      ],
      "spellAttack": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      },
      "fluff": {
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://img.game8.co/3498526/93b71a6524daa52afd9d3c4c8136a857.png/show"
            }
          }
        ]
      }
    },
    {
      "name": "Lightning Whip",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You evoke an electrifying whip in your free hand. It is similar in size and shape to an actual whip, and it lasts for the duration. It has the light and reach properties. If you let go of the whip, it disappears, but you can evoke the whip again as a bonus action.",
        "You can use your action to make a melee spell attack with the lightning whip. On a hit, the target takes {@damage 3d4} lightning damage and it must succeed on a Strength saving throw. On a fail, the target is knocked {@condition prone}.",
        "In addition, you can use your bonus action to make a melee spell attack with the lightning whip, however it instead deals {@damage 1d4} lightning damage on hit instead of {@dice 3d4}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d4} for every two slot levels above 2nd."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Metronome",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You point at a creature you can see within range and use rhythmic movements to build up momentum and damage them. The target makes a Dexterity saving throw, taking {@damage 6d6} force damage and is marked by the spell on a failed save, or half as much on a success and are not marked. ",
        "While marked, you can use an action or a bonus action to deal {@damage 2d6} force damage to them, but you can only do so once per round and not on the turn you cast the spell. Each time the target takes this damage, they can repeat their save, ending the effect on a success.",
        "After the first round you cast the spell, if you do not use your action or bonus action to deal damage to the target with this spell, your concentration ends early."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ode of Seasons",
      "source": "TACS",
      "level": 1,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 50 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a magical song that empowers a target within range (you can choose yourself). Choose from Autumn, Winter, Spring, or Summer. The target gains the following benefits depending on what you chose:",
        {
          "name": "Autumn",
          "type": "entries",
          "entries": [
            "The target has advantage on Charisma ability checks."
          ]
        },
        {
          "name": "Winter",
          "type": "entries",
          "entries": [
            "The target has resistance to cold damage."
          ]
        },
        {
          "name": "Spring",
          "type": "entries",
          "entries": [
            "The target has advantage on saving throws made to resist being {@condition charmed} or {@condition frightened}."
          ]
        },
        {
          "name": "Summer",
          "type": "entries",
          "entries": [
            "The target has resistance to fire damage."
          ]
        }
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or 3rd level, you can maintain your concentration on the spell for up to 1 hour. When you use a spell slot of 4th level or higher, you can maintain your concentration on the spell for up to 8 hours."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Poseidon's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 500
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a wave of immeasurable force in a 500-foot-high, 500-foot-long, 100-foot-thick. Every creature and object in the area makes a Strength saving throw. On a failed save, every creature takes {@damage 12d10} bludgeoning damage and {@damage 12d10} cold damage and are knocked {@condition prone} and pushed to the end of the wave. Objects take twice the amount of damage and automatically fail the save. Creatures that save take only half damage and are pushed only half the distance they normally would be pushed and are not knocked {@condition prone}.",
        "Magical and non-magical fire in the area is immediately extinguished and creatures who took the damage from this spell gains resistance to fire damage for the next minute. Spells that set creatures on fire and persist immediately end on affected creatures.",
        "The area affected is not flooded, as the water dissipates after the spell takes effect."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Primordial Mark",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body and weapons you are holding. Choose from acid, cold, fire, lightning, or thunder. Until the spell ends, your weapon attacks deal an extra {@dice 1d4}  damage of the chosen type on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Reveal/Conceal",
      "source": "TACS",
      "level": 2,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pair of glass lenses with drops of spring water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "permanent",
          "ends": [
            "dispel"
          ]
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "For the duration, you can reveal or conceal the presence of magic on objects within range. Choose reveal or conceal and apply the appropriate effect:",
        {
          "type": "entries",
          "name": "Reveal",
          "entries": [
            "You can emanate an aura that reveals whether or not there is magic on every object within range. A magical mark appears on the object if it is magical. The mark that appears resembles the school of magic the object is affected by, otherwise a generic mark is created if there is no specified school of magic. The mark remains so long as it is within range of the aura.",
            "If the object is under the conceal effects of this spell, it is suppressed while it is within range of the aura. If the object is being protected by divination magic, like being under the effects of the {@spell nondetection} spell, make an ability check using your spellcasting ability. The DC equals 10 + the level spell that was used to protect it. If a spell was not used to protect it, the DM determines an appropriate DC. On a successful check, the effect is suppressed while the object is within range of the aura.",
            "You can also reveal a message being hidden by magic, such as from the {@spell illusory script} or the conceal effects of this spell. The message is revealed in a language you understand."
          ]
        },
        {
          "type": "entries",
          "name": "Conceal",
          "entries": [
            "Choose any number of objects within range, if the chosen objects are magical, they become hidden from divination magic. The objects can't be targeted by any divination magic, perceived through magical scrying sensors, and the magic on them cannot be revealed by the effects of divination magic, such as the {@spell detect magic} spell, except by the reveal effects of this spell.",
            "You can also choose to hide text from a non-magical object. Whether this text is written, carved, or magically scribed onto the object, the text becomes {@condition invisible} or is re-written in symbols that have no real meaning.",
            "Any of these effects remains on the objects until dispelled."
          ]
        },
        "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
      ],
      "areaTags": [
        "MT",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Rock Slide",
      "source": "TACS",
      "level": 1,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small rock"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a series of falling rocks at a point you can see within range in a 15-foot tall, 15-foot-long, and 5-foot-wide line. Every creature in the line makes a Dexterity saving throw, taking {@damage 3d6} bludgeoning damage and fall {@condition prone} on a failed save, or half as much on a success and are not knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "dexterity"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "L"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Scholar's Armament",
      "source": "TACS",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "s": true,
        "m": "A gemstone worth at least 50 gp and a martial or simple weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You imbue magical power into a weapon you are holding. The weapon must have the required gemstone fashioned onto it in some way, whether it is on the pommel or on the blade of the weapon itself. For the duration, you can use your spellcasting ability instead of Strength or Dexterity for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage becomes {@dice 1d4} plus your spellcasting modifier. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "The weapon's damage die becomes a {@dice d6} when you reach 5th level, a {@dice d8} at 11th level, and a {@dice d10} at 17th level."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Shielding Vitality",
      "source": "TACS",
      "level": 2,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you or a creature within range would take damage"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You can prevent harm from coming to you or your allies. As a reaction when you or a friendly creature who doesn't have all of its hit points would take damage within range, you can reduce the damage that creature would take by {@damage 1d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Slipstream",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a few drops of oil and water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "entries": [
        "You create a low-cresting wave of water that carries the target along the surface of water or the ground. The target's walking speed is increased by 20 feet until the spell ends. In addition, swimming does not cost the target any additional movement. If the target had a swim speed, it is increased by 30 feet until the spell ends."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Courage",
      "source": "TACS",
      "level": 1,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 20
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power to rally you and your allies within range with courage. For the duration, you and every willing ally within range that is not {@condition deafened} has advantage on saving throws made to avoid or end the {@condition frightened} condition, also they gain a +1 bonus to attack rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the bonus increases to +2, creatures within range are immune to being {@condition frightened}, and their weapon attacks are treated as magical if they weren't already. When you use a spell slot of 5th level or higher, the bonus increases to +3 and creatures within range are immune to being {@condition charmed}."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Misdirection",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power that misdirects your enemies and forces them to focus their attention toward yourself or another creature. Choose a creature within range that you can see (you can choose yourself), up to three creatures you choose within 20 feet of the initial target must make a Wisdom saving throw, regarding the initial target as hostile and the most dangerous threat on a failed save. If the initial target was well-known or friendly to the chosen creatures affected by the spell, they have advantage on the save.",
        "While under the effects of the spell, they are compelled to target the chosen creature with any and all attacks and spells they can utilize. An example of the compulsion could be that they believe that the target has a bounty on their head with a very high reward, but it is up to the DM to determine a proper reason why they would be compelled by the spell. At the end of an affected creature's turn, they can repeat their Wisdom save, ending the effect on a success. The spell ends early if the initial target is reduced to 0 hit points or dies.",
        "A creature is immune to the effects of the spell if they are immune to being {@condition charmed}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can choose one additional creature to make a save against the spell for each slot level above 2nd. When you cast this spell using a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. Using a spell slot of 8th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Static Discharge",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        },
        {
          "number": 1,
          "unit": "round"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 15
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a copper rod"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Electric energy builds up within you and you release it outward in a powerful burst of energy. Each creature (except yourself) within range makes a Dexterity saving throw, taking {@damage 3d8} lightning damage  and is {@condition stunned} until the end of your next turn on a failed save, or half as much on a success and is not {@condition stunned}.",
        "Rather than using it's normal casting time, you can instead spend your entire turn building up energy and cast it immediately at the start of your next turn, taking up your action for your next turn. When you do so, creatures have disadvantage on the saving throw and you add two additional damage dice. In addition, the radius is increased by an additional 5 feet. See 'Longer Casting Times' on page 202 of the Player's Handbook for reference on casting a spell for longer than 1 action.",
        "Charging the spell leaves you fatigued for a time. You gain one level of {@condition exhaustion} for {@dice 1d4} rounds."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Static Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The first time you hit with a melee weapon attack during this spell's duration, your weapon crackles with electricity, and the attack deals an extra {@damage 1d10} lightning damage. Additionally, if the target is a creature, it must succeed a Constitution saving throw or be {@condition incapacitated} until the start of your next turn."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "incapacitated"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Suffocating Sphere",
      "source": "TACS",
      "level": 8,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "special"
        }
      ],
      "entries": [
        "You attempt to draw the air out of a creature you can see within range. A creature is unaffected by the spell if it does not need to breathe. The creature makes a Constitution saving throw. On a failed save, the creature immediately starts to suffocate and begins choking. It can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). After the previously mentioned rounds have passed, at the start of its next turn, it drops to 0 hit points and is dying, and it can't regain hit points or be stabilized until it can breathe again.",
        "At the end of every round before it is reduced to 0 hit points, the creature can repeat its Constitution saving throw, ending the spell on a success. Once the creature is reduced to 0 hit points, you concentrate on the spell until the creature dies or until the duration ends."
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Summon Vengeful Spirit",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 90
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "humanoid blood inside a precious diamond worth at least 600 gp",
          "cost": 60000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You call forth a vengeful spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Vengeance Spirit stat block. When you cast the spell, choose Slain, Cursed, or Betrayed. The creature resembles a vengeful spirit of the chosen type, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.",
        "The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the {@action Dodge} action and uses its move to avoid danger."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell's level appears in the stat block."
          ]
        }
      ],
      "miscTags": [
        "SGT",
        "SMN"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Symphony of Law and Chaos",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "m": "A musical instrument with clockwork and gears on it worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You begin performing a powerful symphony which empowers you with the planes of law or chaos (your choice), your movements as rhythmic as clockwork. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "Your walking speed increases by 30 feet.",
            "You are immune to poison damage  and have immunity to the {@condition poisoned} condition.",
            "Clockwork wings appear on your back, giving you a flying speed of 50 feet and you can hover.",
            "You are immune to the {@condition paralyzed}, {@condition stunned}, {@condition grappled}, and {@condition restrained} conditions (Chaos) or when you deal damage with a weapon or spell, that creature is also {@condition restrained} by clockwork contraptions until the end of your next turn (Law).",
            "When you deal damage to a creature with a weapon or a spell, you can deal an additional {@damage 2d10} psychic damage to one of the damage rolls (Chaos) or an additional {@damage 2d10} force damage to one of the damage rolls (Law)."
          ]
        }
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Thunderstomp",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You stomp your foot or strike your weapon against the ground, creating a ripple of power that you can use to knock down your foes. Choose a creature within range, that creature must make a Strength saving throw or fall {@condition prone} and take {@damage 4d6} thunder damage, or half as much on a success and are not knocked {@condition prone}. You and the creature must be on the same solid surface, otherwise the spell fails."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Unseelie Moon",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "teardrops of a fey from the unseelie court"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You create a small moon, which hovers around you, that emanates a dark blue hue. When you cast the spell, and as an action on subsequent turns, you can launch a freezing ray of light from the moon toward a creature you can see within range. Make a ranged spell attack. On hit, the ray deals {@damage 4d8} cold damage and the target's speed is reduced by 10 feet until the start of your next turn.",
        "While the moon hovers around you, magical darkness within the area of the spell is treated as regular darkness."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, you can fire an additional ray from the moon for every two slot levels above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Vile Mark",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of humanoid blood"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You bestow a vile curse onto a creature you can see within range, making them more susceptible to damage for the duration of the spell. The affected creature is {@condition poisoned} and once every turn, whenever an affected creature takes damage, they take an additional {@damage 2d4} necrotic damage to one of the damage rolls of the source. A creature still suffers the damage even if they are immune to being {@condition poisoned}.",
        "An affected creature can make a Constitution saving throw at the end of each of their turns, ending the spell on a success. The spell can also be ended early with a {@spell Remove Curse}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for every two slot levels above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "poisoned"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ward of Vitality",
      "source": "TACS",
      "level": 4,
      "school": "A",
      "time": [
        {
          "number": 10,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a trinket or holy symbol made of gold or silver worth 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "For the duration, up to eight willing creatures gain 20 temporary hit points. If any of these remain when the spell ends, they are lost. While they have these temporary hit points, they have advantage on Constitution and Wisdom saving throws and their hit point maximum cannot be reduced."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the temporary hit points gained is increased by 10 for each slot level above 4th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Warding Mark",
      "source": "TACS",
      "level": 0,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You create a small rune which emits a barrier which can potentially protect you from a single attack. Until the start of your next turn, you have +1 bonus to your AC against the next attack targeted at you."
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Water Splash",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Each creature in a 5-foot radius of a point you choose within range makes a Strength saving throw. On a failed save, they take {@damage 1d4} bludgeoning damage and are pushed 5 feet away from the center.",
        "This spell's damage increases by {@dice 1d4} when you reach 5th level ({@dice 2d4}), 11th level ({@dice 3d4}), and 17th level ({@dice 4d4})."
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Water Whack",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a cup of water"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Water wraps around your hand and you wave it at a creature, slamming it into them. Make a melee spell attack against a creature within range. On hit, the target takes {@damage 2d10} bludgeoning damage and makes a Strength saving throw. On a failed save, they pushed back 5 feet and are knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Weightless Form",
      "source": "TACS",
      "level": 4,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny feather"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You become lighter than a feather. You and everything you are wearing and carrying become completely weightless, removing your tether from gravity. If you stop wearing or carrying an object, they regain their weight.",
        "For the duration, you have a magical flying speed equal to your walking speed and can hover. In addition, you are immune to being {@condition prone} as you float back onto your feet at the cost of no movement and take no damage as a result from falling. Anytime you are hit by an attack, you are pushed back 10 feet away from the attacker.",
        "If you are still flying when the spell ends, you safely descend at a rate of 60 feet per round until you touch the ground."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Whelm",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A vile filled with water from a waterfall"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You conjure an overwhelming amount of water that crashes onto a creature you can see within range with crushing force. That creature must make a Strength saving throw, or fall {@condition prone} and are {@condition restrained}. A flying creature is forced to the ground, but only takes half the normal amount of fall damage they would have received. At the start of each of the target's turns it takes {@dice 1d10} points of bludgeoning damage. At the end of the creature's turns it can repeat its saving throw, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Winter's Grasp",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a frozen monster claw"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Ice encrusts the ground radiating a powerful cold energy in a 15 foot radius, making it hard for creatures to maintain their balance. This icy ground is treated as difficult terrain. A creature that begins its turn in the affected area takes {@damage 2d6} cold damage and makes a dexterity saving throw. On a failed save, they fall {@condition prone}. At the end of their turns, they make a constitution saving throw. On a successful save, they become immune to the spell's effects.",
        "The cold freezes nonmagical liquids in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@damage 1d6} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "dexterity",
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Yeti's Chilling Gaze",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "Choose a creature that you can see within range. The target must succeed on a Constitution saving throw or take {@damage 3d6} cold damage and is {@condition paralyzed} for the duration, unless the target is resistant or immune to cold damage. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target. If a creature passes their save against this spell, they are immune to its effects for 1 hour."
      ],
      "damageInflict": [
        "cold"
      ],
      "conditionInflict": [
        "paralyzed"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    }
  ]
}