{
  "_meta": {
    "sources": [
      {
        "convertedBy": [
          "Erikku Blade"
        ],
        "authors": [
          "Erikku Blade"
        ],
        "dependencies": {
          "class": [
            "PHB"
          ],
          "classFeature": [
            "PHB",
            "TCE"
          ]
        },
        "url": "",
        "full": "The Adventures of Torrin Campaign Setting",
        "abbreviation": "AOTC",
        "json": "TACS",
        "color": "f1c232"
      }
    ],
    "dateAdded": 1638480074,
    "dateLastModified": 1638480074,
    "internalCopies": [
      "item",
      "background"
    ]
  },
  "class": [
    {
      "name": "Warlock",
      "source": "TACS",
      "page": null,
      "srd": false,
      "hd": {
        "number": 1,
        "faces": 8
      },
      "proficiency": [
        "wis",
        "cha"
      ],
      "spellcastingAbility": "cha",
      "casterProgression": "pact",
      "cantripProgression": [
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      "spellsKnownProgression": [
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        20
      ],
      "spellsKnownProgressionFixedByLevel": {
        "11": {
          "6": 1
        },
        "13": {
          "7": 1
        },
        "15": {
          "8": 1
        },
        "17": {
          "9": 1
        }
      },
      "optionalfeatureProgression": [
        {
          "name": "Eldritch Invocations",
          "featureType": [
            "EI"
          ],
          "progression": [
            0,
            2,
            2,
            3,
            3,
            4,
            4,
            5,
            5,
            6,
            6,
            7,
            7,
            8,
            8,
            9,
            9,
            10,
            10,
            10
          ]
        },
        {
          "name": "Pact Boon",
          "featureType": [
            "PB"
          ],
          "progression": {
            "3": 1
          }
        }
      ],
      "startingProficiencies": {
        "armor": [
          "light"
        ],
        "weapons": [
          "simple"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "arcana",
                "deception",
                "history",
                "intimidation",
                "investigation",
                "nature",
                "religion"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a {@item light crossbow|phb} and {@item crossbow bolts (20)|phb|20 bolts} or (b) any {@filter simple weapon|items|source=phb|category=basic|type=simple weapon}",
          "(a) a {@item component pouch|phb} or (b) an {@item arcane focus|phb}",
          "(a) a {@item scholar's pack|phb} or (b) a {@item dungeoneer's pack|phb}",
          "{@item Leather armor|phb}, any {@filter simple weapon|items|source=phb|category=basic|type=simple weapon}, and two {@item dagger|phb|daggers}"
        ],
        "goldAlternative": "{@dice 4d4 × 10|4d4 × 10|Starting Gold}",
        "defaultData": [
          {
            "a": [
              "light crossbow|phb",
              "crossbow bolts (20)|phb"
            ],
            "b": [
              {
                "equipmentType": "weaponSimple"
              }
            ]
          },
          {
            "a": [
              "component pouch|phb"
            ],
            "b": [
              "arcane focus|phb"
            ]
          },
          {
            "a": [
              "scholar's pack|phb"
            ],
            "b": [
              "dungeoneer's pack|phb"
            ]
          },
          {
            "_": [
              "Leather armor|phb",
              {
                "equipmentType": "weaponSimple"
              },
              {
                "item": "dagger|phb",
                "quantity": 2
              }
            ]
          }
        ]
      },
      "multiclassing": {
        "requirements": {
          "cha": 13
        },
        "proficienciesGained": {
          "armor": [
            "light"
          ],
          "weapons": [
            "simple"
          ]
        }
      },
      "classTableGroups": [
        {
          "colLabels": [
            "{@filter Cantrips Known|spells|level=0|class=Warlock}",
            "{@filter Spells Known|spells|class=Warlock}",
            "Spell Slots",
            "Slot Level",
            "Spell Discovery",
            "{@filter Invocations Known|optionalfeatures|feature type=ei}"
          ],
          "rows": [
            [
              2,
              2,
              1,
              "{@filter 1st|spells|level=1|class=Warlock}",
              1,
              0
            ],
            [
              2,
              3,
              2,
              "{@filter 1st|spells|level=1|class=Warlock}",
              1,
              2
            ],
            [
              2,
              4,
              2,
              "{@filter 2nd|spells|level=2|class=Warlock}",
              2,
              2
            ],
            [
              3,
              5,
              2,
              "{@filter 2nd|spells|level=2|class=Warlock}",
              2,
              3
            ],
            [
              3,
              6,
              2,
              "{@filter 3rd|spells|level=3|class=Warlock}",
              3,
              3
            ],
            [
              3,
              7,
              2,
              "{@filter 3rd|spells|level=3|class=Warlock}",
              3,
              4
            ],
            [
              3,
              8,
              2,
              "{@filter 4th|spells|level=4|class=Warlock}",
              4,
              4
            ],
            [
              3,
              9,
              2,
              "{@filter 4th|spells|level=4|class=Warlock}",
              4,
              5
            ],
            [
              3,
              10,
              2,
              "{@filter 5th|spells|level=5|class=Warlock}",
              5,
              5
            ],
            [
              4,
              10,
              2,
              "{@filter 5th|spells|level=5|class=Warlock}",
              5,
              6
            ],
            [
              4,
              11,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              6,
              6
            ],
            [
              4,
              11,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              6,
              7
            ],
            [
              4,
              12,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              7,
              7
            ],
            [
              4,
              12,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              7,
              8
            ],
            [
              4,
              13,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              8,
              8
            ],
            [
              4,
              13,
              3,
              "{@filter 5th|spells|level=5|class=Warlock}",
              8,
              9
            ],
            [
              4,
              14,
              4,
              "{@filter 5th|spells|level=5|class=Warlock}",
              9,
              9
            ],
            [
              4,
              14,
              4,
              "{@filter 5th|spells|level=5|class=Warlock}",
              9,
              10
            ],
            [
              4,
              15,
              4,
              "{@filter 5th|spells|level=5|class=Warlock}",
              10,
              10
            ],
            [
              4,
              15,
              4,
              "{@filter 5th|spells|level=5|class=Warlock}",
              10,
              10
            ]
          ]
        }
      ],
      "classFeatures": [
        "Pact Magic|Warlock|TACS|1",
        {
          "classFeature": "Otherworldly Patron|Warlock|TACS|1",
          "gainSubclassFeature": true
        },
        "Eldritch Invocations|Warlock|TACS|2",
        "Pact Boon|Warlock|TACS|3",
        "Ability Score Improvement|Warlock|TACS|4",
        "Eldritch Versatility|Warlock|TACS|4|TCE",
        "Eldritch Sanity|Warlock|TACS|5",
        {
          "classFeature": "Otherworldly Patron feature|Warlock|TACS|6",
          "gainSubclassFeature": true
        },
        "Eldritch Lore|Warlock|TACS|7",
        "Ability Score Improvement|Warlock|TACS|8",
        "Otherworldly Bargain|Warlock|TACS|9",
        {
          "classFeature": "Otherworldly Patron feature|Warlock|TACS|10",
          "gainSubclassFeature": true
        },
        "Mystic Arcanum (6th level)|Warlock|TACS|11",
        "Ability Score Improvement|Warlock|TACS|12",
        "Mystic Arcanum (7th level)|Warlock|TACS|13",
        {
          "classFeature": "Otherworldly Patron feature|Warlock|TACS|14",
          "gainSubclassFeature": true
        },
        "Mystic Arcanum (8th level)|Warlock|TACS|15",
        "Ability Score Improvement|Warlock|TACS|16",
        "Mystic Arcanum (9th level)|Warlock|TACS|17",
        "Otherworldly Presence|Warlock|TACS|18",
        "Ability Score Improvement|Warlock|TACS|19",
        "Eldritch Master|Warlock|TACS|20"
      ],
      "subclassTitle": "Otherworldly Patron",
      "fluff": [
        {
          "name": "Warlock",
          "type": "section",
          "entries": [
            "With a pseudodragon curled on his shoulder, a young elf in golden robes smiles warmly, weaving a magical charm into his honeyed words and bending the palace sentinel to his will.",
            "As flames spring to life in her hands, a wizened human whispers the secret name of her demonic patron, infusing her spell with fiendish magic.",
            "Shifting his gaze between a battered tome and the odd alignment of the stars overhead, a wild-eyed tiefling chants the mystic ritual that will open a doorway to a distant world.",
            "Warlocks are seekers of the knowledge that lies hidden in the fabric of the multiverse. Through pacts made with mysterious beings of supernatural power, warlocks unlock magical effects both subtle and spectacular. Drawing on the ancient knowledge of beings such as fey nobles, demons, devils, hags, and alien entities of the Far Realm, warlocks piece together arcane secrets to bolster their own power.",
            {
              "type": "entries",
              "name": "Sworn and Beholden",
              "entries": [
                "A warlock is defined by a pact with an otherworldly being. Sometimes the relationship between warlock and patron is like that of a cleric and a deity, though the beings that serve as patrons for warlocks are not gods. A warlock might lead a cult dedicated to a demon prince, an archdevil, or an utterly alien entity—beings not typically served by clerics. More often, though, the arrangement is similar to that between a master and an apprentice. The warlock learns and grows in power, at the cost of occasional services performed on the patron's behalf.",
                "The magic bestowed on a warlock ranges from minor but lasting alterations to the warlock's being (such as the ability to see in darkness or to read any language) to access to powerful spells. Unlike bookish wizards, warlocks supplement their magic with some facility at hand-to-hand combat. They are comfortable in light armor and know how to use simple weapons."
              ]
            },
            {
              "type": "entries",
              "name": "Delvers into Secrets",
              "entries": [
                "Warlocks are driven by an insatiable need for knowledge and power, which compels them into their pacts and shapes their lives. This thirst drives warlocks into their pacts and shapes their later careers as well.",
                "Stories of warlocks binding themselves to fiends are widely known. But many warlocks serve patrons that are not fiendish. Sometimes a traveler in the wilds comes to a strangely beautiful tower, meets its fey lord or lady, and stumbles into a pact without being fully aware of it. And sometimes, while poring over tomes of forbidden lore, a brilliant but crazed student's mind is opened to realities beyond the material world and to the alien beings that dwell in the outer void.",
                "Once a pact is made, a warlock's thirst for knowledge and power can't be slaked with mere study and research. No one makes a pact with such a mighty patron if he or she doesn't intend to use the power thus gained. Rather, the vast majority of warlocks spend their days in active pursuit of their goals, which typically means some kind of adventuring. Furthermore, the demands of their patrons drive warlocks toward adventure."
              ]
            },
            {
              "type": "entries",
              "name": "Creating a Warlock",
              "entries": [
                "As you make your warlock character, spend some time thinking about your patron and the obligations that your pact imposes upon you. What led you to make the pact, and how did you make contact with your patron? Were you seduced into summoning a devil, or did you seek out the ritual that would allow you to make contact with an alien elder god? Did you search for your patron, or did your patron find and choose you? Do you chafe under the obligations of your pact or serve joyfully in anticipation of the rewards promised to you?",
                "Work with your DM to determine how big a part your pact will play in your character's adventuring career. Your patron's demands might drive you into adventures, or they might consist entirely of small favors you can do between adventures.",
                "What kind of relationship do you have with your patron? Is it friendly, antagonistic, uneasy, or romantic? How important does your patron consider you to be? What part do you play in your patron's plans? Do you know other servants of your patron?",
                "How does your patron communicate with you? If you have a familiar, it might occasionally speak with your patron's voice. Some warlocks find messages from their patrons etched on trees, mingled among tea leaves, or adrift in the clouds—messages that only the warlock can see. Other warlocks converse with their patrons in dreams or waking visions, or deal only with intermediaries.",
                {
                  "type": "entries",
                  "name": "Quick Build",
                  "entries": [
                    "You can make a warlock quickly by following these suggestions. First, Charisma should be your highest ability score, followed by Constitution. Second, choose the {@background charlatan} background. Third, choose the {@spell eldritch blast} and {@spell chill touch} cantrips, along with the 1st-level spells {@spell charm person} and {@spell witch bolt}."
                  ]
                }
              ]
            }
          ],
          "page": null,
          "source": "TACS"
        },
        {
          "type": "section",
          "entries": [
            {
              "type": "quote",
              "entries": [
                "You think me mad? I think true insanity is being content to live a life of mortal drudgery when knowledge and power is there for the taking in the realm beyond."
              ],
              "by": "Xarren, herald of Acamar"
            },
            "Warlocks are finders and keepers of secrets. They push at the edge of our understanding of the world, always seeking to expand their expertise. Where sages or wizards might heed a clear sign of danger and end their research, a warlock plunges ahead, heedless of the cost. Thus, it takes a peculiar mixture of intelligence, curiosity, and recklessness to produce a warlock. Many folk would describe that combination as evidence of madness. Warlocks see it as a demonstration of bravery.",
            "Warlocks are defined by two elements that work in concert to forge their path into this class. The first element is the event or circumstances that led to a warlock's entering into a pact with a planar entity. The second one is the nature of the entity a warlock is bound to. Unlike clerics, who typically embrace a deity and that god's ethos, a warlock might have no love for a patron, or vice versa.",
            "The sections that follow provide ways to embellish a warlock character that could generate some intriguing story and roleplaying opportunities.",
            {
              "type": "entries",
              "name": "Patron's Attitude",
              "entries": [
                "Every relationship is a two-way street, but in the case of warlocks and their patrons it's not necessarily true that both sides of the street are the same width or made of the same stuff. The feeling that a warlock holds for their patron, whether positive or negative, might be reciprocated by the patron, or the two participants in the pact might view one another with opposing emotions.",
                "When you determine the attitude your warlock character holds toward your patron, also consider how things look from the patron's perspective. How does your patron behave toward you? Is your patron a friend and ally, or an enemy that grants you power only because you forced a pact upon it?",
                {
                  "type": "table",
                  "caption": "Patron Attitudes",
                  "colLabels": [
                    "{@dice d6}",
                    "Attitude"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "Your patron has guided and helped your family for generations and is kindly toward you."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Each interaction with your capricious patron is a surprise, whether pleasant or painful."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Your patron is the spirit of a long-dead hero who sees your pact as a way for it to continue to influence the world."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "Your patron is a strict disciplinarian but treats you with a measure of respect."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Your patron tricked you into a pact and treats you as a slave."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "You are mostly left to your own devices with no interference from your patron. Sometimes you dread the demands it will make when it does appear."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Special Terms of the Pact",
              "entries": [
                "A pact can range from a loose agreement to a formal contract with lengthy, detailed clauses and lists of requirements. The terms of a pact—what a warlock must do to receive a patron's favor—are always dictated by the patron. On occasion, those terms include a special proviso that might seem odd or whimsical, but warlocks take these dictates as seriously as they do the other requirements of their pacts.",
                "Does your character have a pact that requires you to change your behavior in an unusual or seemingly frivolous way? Even if your patron hasn't imposed such a duty on you already, that's not to say it couldn't still happen.",
                {
                  "type": "table",
                  "caption": "Special Terms",
                  "colLabels": [
                    "{@dice d6}",
                    "Term"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "When directed, you must take immediate action against a specific enemy of your patron."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Your pact tests your willpower; you are required to abstain from alcohol and other intoxicants."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "At least once a day, you must inscribe or carve your patron's name or symbol on the wall of a building."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "You must occasionally conduct bizarre rituals to maintain your pact."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "You can never wear the same outfit twice, since your patron finds such predictability to be boring."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "When you use an eldritch invocation, you must speak your patron's name aloud or risk incurring its displeasure."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Binding Mark",
              "entries": [
                "Some patrons make a habit of, and often enjoy, marking the warlocks under their sway in some fashion. A binding mark makes it clear—to those who know about such things—that the individual in question is bound to the patron's service. A warlock might take advantage of such a mark, claiming it as proof of one's pact, or might want to keep it under wraps (if possible) to avoid the difficulties it might bring.",
                "If your warlock's pact comes with a binding mark, how you feel about displaying it probably depends on the nature of your relationship with the one who gave it to you. Is the mark a source of pride or something you are secretly ashamed of?",
                {
                  "type": "table",
                  "caption": "Binding Marks",
                  "colLabels": [
                    "d6",
                    "Mark"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      "1",
                      "One of your eyes looks the same as one of your patron's eyes."
                    ],
                    [
                      "2",
                      "Each time you wake up, the small blemish on your face appears in a different place."
                    ],
                    [
                      "3",
                      "You display outward symptoms of a disease but suffer no ill effects from it."
                    ],
                    [
                      "4",
                      "Your tongue is an unnatural color."
                    ],
                    [
                      "5",
                      "You have a vestigial tail."
                    ],
                    [
                      "6",
                      "Your nose glows in the dark."
                    ]
                  ]
                }
              ]
            }
          ],
          "page": null,
          "source": "TACS"
        }
      ]
    }
  ],
  "subclass": [
    {
      "name": "The Archfey",
      "shortName": "Archfey",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "faerie fire",
              "sleep"
            ],
            "s2": [
              "calm emotions",
              "phantasmal force"
            ],
            "s3": [
              "blink",
              "plant growth"
            ],
            "s4": [
              "dominate beast",
              "greater invisibility"
            ],
            "s5": [
              "dominate person",
              "seeming"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Archfey|Warlock|TACS|Archfey|TACS|1",
        "Misty Escape|Warlock|TACS|Archfey|TACS|6",
        "Beguiling Defenses|Warlock|TACS|Archfey|TACS|10",
        "Dark Delirium|Warlock|TACS|Archfey|TACS|14"
      ]
    },
    {
      "name": "The Fiend",
      "shortName": "Fiend",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "srd": false,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "burning hands",
              "command"
            ],
            "s2": [
              "blindness/deafness",
              "scorching ray"
            ],
            "s3": [
              "fireball",
              "stinking cloud"
            ],
            "s4": [
              "fire shield",
              "wall of fire"
            ],
            "s5": [
              "flame strike",
              "hallow"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Fiend|Warlock|TACS|Fiend|TACS|1",
        "Dark One's Own Luck|Warlock|TACS|Fiend|TACS|6",
        "Fiendish Resilience|Warlock|TACS|Fiend|TACS|10",
        "Hurl Through Hell|Warlock|TACS|Fiend|TACS|14"
      ]
    },
    {
      "name": "The Great Old One",
      "shortName": "Great Old One",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "dissonant whispers",
              "Tasha's hideous laughter"
            ],
            "s2": [
              "detect thoughts",
              "phantasmal force"
            ],
            "s3": [
              "clairvoyance",
              "sending"
            ],
            "s4": [
              "dominate beast",
              "Evard's black tentacles"
            ],
            "s5": [
              "dominate person",
              "telekinesis"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Great Old One|Warlock|TACS|Great Old One|TACS|1",
        "Entropic Ward|Warlock|TACS|Great Old One|TACS|6",
        "Thought Shield|Warlock|TACS|Great Old One|TACS|10",
        "Create Thrall|Warlock|TACS|Great Old One|TACS|14"
      ]
    },
    {
      "name": "The Celestial",
      "shortName": "Celestial",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "known": {
            "1": [
              "sacred flame#c",
              "light#c"
            ]
          },
          "expanded": {
            "s1": [
              "cure wounds",
              "guiding bolt"
            ],
            "s2": [
              "flaming sphere",
              "lesser restoration"
            ],
            "s3": [
              "daylight",
              "revivify"
            ],
            "s4": [
              "guardian of faith",
              "wall of fire"
            ],
            "s5": [
              "flame strike",
              "greater restoration"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Celestial|Warlock|TACS|Celestial|TACS|1",
        "Radiant Soul|Warlock|TACS|Celestial|TACS|6",
        "Celestial Resilience|Warlock|TACS|Celestial|TACS|10",
        "Searing Vengeance|Warlock|TACS|Celestial|TACS|14"
      ]
    },
    {
      "name": "The Hexblade",
      "shortName": "Hexblade",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "shield",
              "wrathful smite"
            ],
            "s2": [
              "blur",
              "branding smite"
            ],
            "s3": [
              "blink",
              "elemental weapon"
            ],
            "s4": [
              "phantasmal killer",
              "staggering smite"
            ],
            "s5": [
              "banishing smite",
              "cone of cold"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Hexblade|Warlock|TACS|Hexblade|TACS|1",
        "Accursed Specter|Warlock|TACS|Hexblade|TACS|6",
        "Armor of Hexes|Warlock|TACS|Hexblade|TACS|10",
        "Master of Hexes|Warlock|TACS|Hexblade|TACS|14"
      ]
    },
    {
      "name": "The Fathomless",
      "shortName": "Fathomless",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "create or destroy water",
              "thunderwave"
            ],
            "s2": [
              "gust of wind",
              "silence"
            ],
            "s3": [
              "lightning bolt",
              "sleet storm"
            ],
            "s4": [
              "control water",
              "summon elemental|tce"
            ],
            "s5": [
              "Bigby's hand",
              "cone of cold"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Fathomless|Warlock|TACS|Fathomless|TACS|1",
        "Oceanic Soul|Warlock|TACS|Fathomless|TACS|6",
        "Guardian Coil|Warlock|TACS|Fathomless|TACS|6",
        "Grasping Tentacles|Warlock|TACS|Fathomless|TACS|10",
        "Fathomless Plunge|Warlock|TACS|Fathomless|TACS|14"
      ]
    },
    {
      "name": "The Genie",
      "shortName": "Genie",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "name": "Dao",
          "expanded": {
            "9": [
              "wish"
            ],
            "s1": [
              "detect evil and good",
              "sanctuary"
            ],
            "s2": [
              "phantasmal force",
              "spike growth"
            ],
            "s3": [
              "create food and water",
              "meld into stone"
            ],
            "s4": [
              "phantasmal killer",
              "stone shape"
            ],
            "s5": [
              "creation",
              "wall of stone"
            ]
          }
        },
        {
          "name": "Djinni",
          "expanded": {
            "9": [
              "wish"
            ],
            "s1": [
              "detect evil and good",
              "thunderwave"
            ],
            "s2": [
              "phantasmal force",
              "gust of wind"
            ],
            "s3": [
              "create food and water",
              "wind wall"
            ],
            "s4": [
              "phantasmal killer",
              "greater invisibility"
            ],
            "s5": [
              "creation",
              "seeming"
            ]
          }
        },
        {
          "name": "Efreeti",
          "expanded": {
            "9": [
              "wish"
            ],
            "s1": [
              "detect evil and good",
              "burning hands"
            ],
            "s2": [
              "phantasmal force",
              "scorching ray"
            ],
            "s3": [
              "create food and water",
              "fireball"
            ],
            "s4": [
              "phantasmal killer",
              "fire shield"
            ],
            "s5": [
              "creation",
              "flame strike"
            ]
          }
        },
        {
          "name": "Marid",
          "expanded": {
            "9": [
              "wish"
            ],
            "s1": [
              "detect evil and good",
              "fog cloud"
            ],
            "s2": [
              "phantasmal force",
              "blur"
            ],
            "s3": [
              "create food and water",
              "sleet storm"
            ],
            "s4": [
              "phantasmal killer",
              "control water"
            ],
            "s5": [
              "creation",
              "cone of cold"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Genie|Warlock|TACS|Genie|TACS|1",
        "Elemental Gift|Warlock|TACS|Genie|TACS|6",
        "Sanctuary Vessel|Warlock|TACS|Genie|TACS|10",
        "Limited Wish|Warlock|TACS|Genie|TACS|14"
      ]
    },
    {
      "name": "The Undead",
      "shortName": "Undead",
      "source": "VRGR",
      "className": "Warlock",
      "classSource": "TACS",
      "page": null,
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "bane",
              "false life"
            ],
            "s2": [
              "blindness/deafness",
              "phantasmal force"
            ],
            "s3": [
              "phantom steed",
              "speak with dead"
            ],
            "s4": [
              "death ward",
              "greater invisibility"
            ],
            "s5": [
              "antilife shell",
              "cloudkill"
            ]
          }
        }
      ],
      "subclassFeatures": [
        "The Undead|Warlock|TACS|Undead|VRGR|1",
        "Grave Touched|Warlock|TACS|Undead|VRGR|6",
        "Necrotic Husk|Warlock|TACS|Undead|VRGR|10",
        "Spirit Projection|Warlock|TACS|Undead|VRGR|14"
      ]
    },
    {
      "name": "Otherworldly Patron The Matron of Ravens",
      "source": "TACS",
      "shortName": "Matron of Ravens",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSpells": [
        "inflict wounds",
        "glacial grip|TACS",
        "augury",
        "wither and bloom|SCC",
        "revivify",
        "speak with dead",
        "ice storm",
        "locate creature",
        "raise dead",
        "cone of cold"
      ],
      "subclassFeatures": [
        "The Matron of Ravens|Warlock|TACS|Matron of Ravens|TACS|1",
        "Improved Raven Form|Warlock|TACS|Matron of Ravens|TACS|6",
        "Raven-Touched|Warlock|TACS|Matron of Ravens|TACS|10",
        "Sunder Undeath|Warlock|TACS|Matron of Ravens|TACS|14"
      ],
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "inflict wounds",
              "glacial grip|TACS"
            ],
            "s2": [
              "augury",
              "wither and bloom|SCC"
            ],
            "s3": [
              "revivify",
              "speak with dead"
            ],
            "s4": [
              "ice storm",
              "locate creature"
            ],
            "s5": [
              "raise dead",
              "cone of cold"
            ]
          }
        }
      ]
    },
    {
      "name": "The Greatwyrm",
      "source": "TACS",
      "shortName": "Greatwyrm",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSpells": [
        "absorb elements|XGE",
        "chromatic orb",
        "darkvision",
        "dragon's breath|XGE",
        "elemental weapon",
        "protection from energy",
        "arcane aeye",
        "polyporph",
        "circle of power",
        "summon draconic spirit|FTD"
      ],
      "subclassFeatures": [
        "The Greatwyrm|Warlock|TACS|Greatwyrm|TACS|1",
        "Voice of The Greatwyrm|Warlock|TACS|Greatwyrm|TACS|6",
        "Flight of The Greatwyrm|Warlock|TACS|Greatwyrm|TACS|10",
        "Versatile Dragon Spells|Warlock|TACS|Greatwyrm|TACS|10",
        "Ward of The Greatwyrm|Warlock|TACS|Greatwyrm|TACS|14"
      ],
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "absorb elements|XGE",
              "chromatic orb"
            ],
            "s2": [
              "darkvision",
              "dragon's breath|XGE"
            ],
            "s3": [
              "elemental weapon",
              "protection from energy"
            ],
            "s4": [
              "arcane eye",
              "polymorph"
            ],
            "s5": [
              "circle of power",
              "summon draconic spirit|TCE"
            ]
          }
        }
      ]
    },
    {
      "name": "Otherworldly Patron The Blood Witch",
      "source": "TACS",
      "shortName": "Blood Witch",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSpells": [
        "color spray",
        "inflict wounds",
        "magic mouth",
        "see invisibility",
        "bestow curse",
        "life transference|XGE",
        "confusion",
        "polymorph",
        "geas",
        "modify memory"
      ],
      "subclassFeatures": [
        "The Blood Witch|Warlock|TACS|Blood Witch|TACS|1",
        "Improved Witch's Sight|Warlock|TACS|Blood Witch|TACS|6",
        "Sacrificial Spells|Warlock|TACS|Blood Witch|TACS|10",
        "Emissary of The Blood Witch|Warlock|TACS|Blood Witch|TACS|14"
      ],
      "additionalSpells": [
        {
          "expanded": {
            "s1": [
              "color spray",
              "inflict wounds"
            ],
            "s2": [
              "magic mouth",
              "see invisibility"
            ],
            "s3": [
              "bestow curse",
              "life transference|XGE"
            ],
            "s4": [
              "confusion",
              "polymorph"
            ],
            "s5": [
              "geas",
              "modify memory"
            ]
          }
        }
      ]
    }
  ],
  "classFeature": [
    {
      "name": "Otherworldly Patron",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "At 1st level, you have struck a bargain with an otherworldly being chosen from the list of available patrons. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
      ]
    },
    {
      "name": "Pact Magic",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 1,
      "entries": [
        "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for the {@filter warlock spell list|spells|class=warlock}.",
        {
          "type": "entries",
          "name": "Cantrips",
          "entries": [
            "You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table."
          ]
        },
        {
          "type": "entries",
          "name": "Spell Slots",
          "entries": [
            "The Warlock table shows how many spell slots you have to cast your {@filter warlock spells|spells|class=warlock} of 1st through 5th level. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.",
            "For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell {@spell witch bolt}, you must spend one of those slots, and you cast it as a 3rd-level spell."
          ]
        },
        {
          "type": "entries",
          "name": "Spells Known of 1st Level and Higher",
          "entries": [
            "At 1st level, you know two 1st-level spells of your choice from the warlock spell list.",
            "The Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.",
            "Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots."
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Ability",
          "entries": [
            "Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.",
            {
              "type": "abilityDc",
              "name": "Spell",
              "attributes": [
                "cha"
              ]
            },
            {
              "type": "abilityAttackMod",
              "name": "Spell",
              "attributes": [
                "cha"
              ]
            }
          ]
        },
        {
          "type": "entries",
          "name": "Spellcasting Focus",
          "entries": [
            "You can use an {@item arcane focus|phb} as a spellcasting focus for your warlock spells."
          ]
        }
      ]
    },
    {
      "name": "Eldritch Invocations",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 2,
      "entries": [
        "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.",
        "At 2nd level, you gain two eldritch invocations of your choice. A list of the available options can be found on the {@filter Optional Features|optionalfeatures|Feature Type=EI} page. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table.",
        "Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level.",
        "If an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class."
      ]
    },
    {
      "name": "Pact Boon",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 3,
      "entries": [
        "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.",
        {
          "type": "options",
          "count": 1,
          "entries": [
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Pact of the Chain"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Pact of the Blade|TACS"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Pact of the Tome"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Pact of the Talisman|TCE"
            },
            {
              "type": "refOptionalfeature",
              "optionalfeature": "Pact of The Vial|TACS"
            }
          ]
        }
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 4,
      "entries": [
        "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Eldritch Versatility",
      "source": "TCE",
      "page": 70,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 4,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 4th-level warlock {@variantrule optional class features|TACS|optional feature}}",
        "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can do one of the following, representing a change of focus in your occult studies:",
        {
          "type": "list",
          "items": [
            "Replace one cantrip you learned from this class's Pact Magic feature with another cantrip from the {@filter warlock spell list|spells|level=0|class=Warlock}.",
            "Replace the option you chose for the Pact Boon feature with one of that feature's other options.",
            "If you're 12th level or higher, replace one spell from your Mystic Arcanum feature with another warlock spell of the same level."
          ]
        },
        "If this change makes you ineligible for any of your Eldritch Invocations, you must also replace them now, choosing invocations for which you qualify."
      ]
    },
    {
      "name": "Eldritch Sanity",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 5,
      "entries": [
        "At 5th level, you can empower your mind temporarily by calling upon your patron’s power. While you are charmed or frightened, you can use your action to end the effects, even if your action would have otherwise been unavailable due to being charmed or frightened. If you do not have an action unrelated to those two conditions, you cannot use your action to end those conditions.",
        "Once you use this feature, you cannot use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Otherworldly Patron feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 6,
      "entries": [
        "At 6th level, you gain a feature granted by your Otherworldly Patron."
      ]
    },
    {
      "name": "Eldritch Lore",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 7,
      "entries": [
        "When you reach 7th level, you gain proficiency in two skills of your choice from the list of skills available to warlocks at 1st level."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 8,
      "entries": [
        "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Otherworldly Bargain",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 9,
      "entries": [
        "Starting at 9th level, you can expend 5 hit dice as a bonus action to regain an expended warlock spell slot. You can use this feature once, regaining all expended uses when you finish a long rest. You can use this feature a second time before needing to finish a long rest when you reach 13th level, and a third time when you reach 17th level."
      ]
    },
    {
      "name": "Otherworldly Patron feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 10,
      "entries": [
        "At 10th level, you gain a feature granted by your Otherworldly Patron."
      ]
    },
    {
      "name": "Mystic Arcanum (6th level)",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 11,
      "entries": [
        "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 6th-level spell from the warlock spell list|spells|level=6|class=Warlock} as this arcanum.",
        "You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.",
        "At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 12,
      "entries": [
        "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Mystic Arcanum (7th level)",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 13,
      "entries": [
        "At 13th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 7th-level spell from the warlock spell list|spells|level=7|class=Warlock} as this arcanum.",
        "You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
      ]
    },
    {
      "name": "Otherworldly Patron feature",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 14,
      "entries": [
        "At 14th level, you gain a feature granted by your Otherworldly Patron."
      ]
    },
    {
      "name": "Mystic Arcanum (8th level)",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 15,
      "entries": [
        "At 15th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 8th-level spell from the warlock spell list|spells|level=8|class=Warlock} as this arcanum.",
        "You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 16,
      "entries": [
        "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Mystic Arcanum (9th level)",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 17,
      "entries": [
        "At 17th level, your patron bestows upon you a magical secret called an arcanum. Choose one {@filter 9th-level spell from the warlock spell list|spells|level=9|class=Warlock} as this arcanum.",
        "You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again."
      ]
    },
    {
      "name": "Otherworldly Presence",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 18,
      "entries": [
        "At 18th level, you’ve grown to be an exceptionally powerful being after selling yourself to the service of another greatly powerful being, to the point where your very presence is imposing against others.",
        "As an action, you can force a creature within 60 feet of you that can see you to make a Wisdom saving throw against your warlock spell save DC. On a failed save, they become overwhelmed by your presence, causing them to be {@condition incapacitated} until the start of your next turn. Afterwhich, you have advantage on Charisma (Intimidation) checks for the next hour. A creature is immune to this ability if they are immune to being {@condition charmed} or {@condition frightened}.",
        "You can use this feature a number of times equal to your Charisma modifier, regaining all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 19,
      "entries": [
        "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Eldritch Master",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "level": 20,
      "entries": [
        "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "The Archfey",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Archfey",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "Your patron is a lord or lady of the fey, a creature of legend who holds secrets that were forgotten before the mortal races were born. This being's motivations are often inscrutable, and sometimes whimsical, and might involve a striving for greater magical power or the settling of age-old grudges. Beings of this sort include the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; her consort Oberon, the Green Lord; Hyrsam, the Prince of Fools; and ancient hags.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "The Archfey lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Archfey Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell faerie fire}, {@spell sleep}"
                ],
                [
                  "2nd",
                  "{@spell calm emotions}, {@spell phantasmal force}"
                ],
                [
                  "3rd",
                  "{@spell blink}, {@spell plant growth}"
                ],
                [
                  "4th",
                  "{@spell dominate beast}, {@spell greater invisibility}"
                ],
                [
                  "5th",
                  "{@spell dominate person}, {@spell seeming}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Fey Presence|Warlock|TACS|Archfey|TACS|1"
        }
      ]
    },
    {
      "name": "Fey Presence",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Archfey",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. The creatures that fail their saving throws are all {@condition charmed} or {@condition frightened} by you (your choice) until the end of your next turn.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Misty Escape",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Archfey",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, you can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn {@condition invisible} and teleport up to 60 feet to an unoccupied space you can see. You remain {@condition invisible} until the start of your next turn or until you attack or cast a spell.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Beguiling Defenses",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Archfey",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Beginning at 10th level, your patron teaches you how to turn the mind-affecting magic of your enemies against them. You are immune to being {@condition charmed}, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature. The creature must succeed on a Wisdom saving throw against your warlock spell save DC or be {@condition charmed} by you for 1 minute or until the creature takes any damage."
      ]
    },
    {
      "name": "Dark Delirium",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Archfey",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, you can plunge a creature into an illusory realm. As an action, choose a creature that you can see within 60 feet of you. It must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is {@condition charmed} or {@condition frightened} by you (your choice) for 1 minute or until your concentration is broken (as if you are concentrating on a spell). This effect ends early if the creature takes any damage.",
        "Until this illusion ends, the creature thinks it is lost in a misty realm, the appearance of which you choose. The creature can see and hear only itself, you, and the illusion.",
        "You must finish a short or long rest before you can use this feature again."
      ]
    },
    {
      "name": "The Fiend",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fiend",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "The Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Fiend Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell burning hands}, {@spell command}"
                ],
                [
                  "2nd",
                  "{@spell blindness/deafness}, {@spell scorching ray}"
                ],
                [
                  "3rd",
                  "{@spell fireball}, {@spell stinking cloud}"
                ],
                [
                  "4th",
                  "{@spell fire shield}, {@spell wall of fire}"
                ],
                [
                  "5th",
                  "{@spell flame strike}, {@spell hallow}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Dark One's Blessing|Warlock|TACS|Fiend|TACS|1"
        }
      ]
    },
    {
      "name": "Dark One's Blessing",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fiend",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1)."
      ]
    },
    {
      "name": "Dark One's Own Luck",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fiend",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a {@dice d10} to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Fiendish Resilience",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fiend",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance."
      ]
    },
    {
      "name": "Hurl Through Hell",
      "source": "TACS",
      "page": null,
      "srd": false,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fiend",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.",
        "At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes {@damage 10d10} psychic damage as it reels from its horrific experience.",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "The Great Old One",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Great Old One",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "Your patron is a mysterious entity whose nature is utterly foreign to the fabric of reality. It might come from the Far Realm, the space beyond reality, or it could be one of the elder gods known only in legends. Its motives are incomprehensible to mortals, and its knowledge so immense and ancient that even the greatest libraries pale in comparison to the vast secrets it holds. The Great Old One might be unaware of your existence or entirely indifferent to you, but the secrets you have learned allow you to draw your magic from it. Entities of this type include Ghaunadar, called That Which Lurks; Tharizdun, the Chained God; Dendar, the Night Serpent; Zargon, the Returner; Great Cthulhu; and other unfathomable beings.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "The Great Old One lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Great Old One Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell dissonant whispers}, {@spell Tasha's hideous laughter}"
                ],
                [
                  "2nd",
                  "{@spell detect thoughts}, {@spell phantasmal force}"
                ],
                [
                  "3rd",
                  "{@spell clairvoyance}, {@spell sending}"
                ],
                [
                  "4th",
                  "{@spell dominate beast}, {@spell Evard's black tentacles}"
                ],
                [
                  "5th",
                  "{@spell dominate person}, {@spell telekinesis}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Awakened Mind|Warlock|TACS|Great Old One|TACS|1"
        }
      ]
    },
    {
      "name": "Awakened Mind",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Great Old One",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, your alien knowledge gives you the ability to touch the minds of other creatures. You can telepathically speak to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language."
      ]
    },
    {
      "name": "Entropic Ward",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Great Old One",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "At 6th level, you learn to magically ward yourself against attack and to turn an enemy's failed strike into good luck for yourself. When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "Thought Shield",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Great Old One",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, your thoughts can't be read by telepathy or other means unless you allow it. You also have resistance to psychic damage, and whenever a creature deals psychic damage to you, that creature takes the same amount of damage that you do."
      ]
    },
    {
      "name": "Create Thrall",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Great Old One",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "At 14th level, you gain the ability to infect a humanoid's mind with the alien magic of your patron. You can use your action to touch an {@condition incapacitated} humanoid. That creature is then {@condition charmed} by you until a {@spell remove curse} spell is cast on it, the {@condition charmed} condition is removed from it, or you use this feature again.",
        "You can communicate telepathically with the {@condition charmed} creature as long as the two of you are on the same plane of existence."
      ]
    },
    {
      "name": "The Fathomless",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "You have plunged into a pact with the deeps. An entity of the ocean, the Elemental Plane of Water, or another otherworldly sea now allows you to draw on its thalassic power. Is it merely using you to learn about terrestrial realms, or does it want you to open cosmic floodgates and drown the world?",
        "Perhaps you were born into a generational cult that venerates the Fathomless and its spawn. Or you might have been shipwrecked and on the brink of drowning when your patron's grasp offered you a chance at life. Whatever the reason for your pact, the sea and its unknown depths call to you.",
        "Entities of the deep that might empower a warlock include krakens, ancient water elementals, godlike hallucinations dreamed into being by kuo-toa, merfolk demigods, and sea hag covens.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "{@i 1st-level Fathomless feature}",
            "The Fathomless lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Fathomless Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell create or destroy water}, {@spell thunderwave}"
                ],
                [
                  "2nd",
                  "{@spell gust of wind}, {@spell silence}"
                ],
                [
                  "3rd",
                  "{@spell lightning bolt}, {@spell sleet storm}"
                ],
                [
                  "4th",
                  "{@spell control water}, {@spell summon elemental|tce} (water only)"
                ],
                [
                  "5th",
                  "{@spell Bigby's hand} (appears as a tentacle), {@spell cone of cold}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Tentacle of the Deeps|Warlock|TACS|Fathomless|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Gift of the Sea|Warlock|TACS|Fathomless|TACS|1"
        }
      ]
    },
    {
      "name": "Gift of the Sea",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Fathomless feature}",
        "You gain a swimming speed of 40 feet, and you can breathe underwater."
      ]
    },
    {
      "name": "Tentacle of the Deeps",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Fathomless feature}",
        "You can magically summon a spectral tentacle that strikes at your foes. As a bonus action, you create a 10-foot-long tentacle at a point you can see within 60 feet of you. The tentacle lasts for 1 minute or until you use this feature to create another tentacle.",
        "When you create the tentacle, you can make a melee spell attack against one creature within 10 feet of it. On a hit, the target takes {@damage 1d8} cold damage, and its speed is reduced by 10 feet until the start of your next turn. When you reach 10th level in this class, the damage increases to {@dice 2d8}.",
        "As a bonus action on your turn, you can move the tentacle up to 30 feet and repeat the attack.",
        "You can summon the tentacle a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Guardian Coil",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Fathomless feature}",
        "Your Tentacle of the Deeps can defend you and others, interposing itself between them and harm. When you or a creature you can see takes damage while within 10 feet of the tentacle, you can use your reaction to choose one of those creatures and reduce the damage to that creature by {@dice 1d8}. When you reach 10th level in this class, the damage reduced by the tentacle increases to {@dice 2d8}."
      ]
    },
    {
      "name": "Oceanic Soul",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Fathomless feature}",
        "You are now even more at home in the depths. You gain resistance to cold damage. In addition, when you are fully submerged, any creature that is also fully submerged can understand your speech, and you can understand theirs."
      ]
    },
    {
      "name": "Grasping Tentacles",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "{@i 10th-level Fathomless feature}",
        "You learn the spell {@spell Evard's black tentacles}. It counts as a warlock spell for you, but it doesn't count against the number of spells you know. You can also cast it once without a spell slot, and you regain the ability to do so when you finish a long rest.",
        "Whenever you cast this spell, your patron's magic bolsters you, granting you a number of temporary hit points equal to your warlock level. Moreover, damage can't break your concentration on this spell."
      ]
    },
    {
      "name": "Fathomless Plunge",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Fathomless",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Fathomless feature}",
        "You can magically open temporary conduits to watery destinations. As an action, you can teleport yourself and up to five other willing creatures that you can see within 30 feet of you. Amid a whirl of tentacles, you all vanish and then reappear up to 1 mile away in a body of water you've seen (pond size or larger) or within 30 feet of it, each of you appearing in an unoccupied space within 30 feet of the others.",
        "Once you use this feature, you can't use it again until you finish a short or long rest."
      ]
    },
    {
      "name": "The Genie",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "You have made a pact with one of the rarest kinds of genie, a noble genie. Such entities rule vast fiefs on the Elemental Planes and have great influence over lesser genies and elemental creatures. Noble genies are varied in their motivations, but most are arrogant and wield power that rivals that of lesser deities. They delight in turning the table on mortals, who often bind genies into servitude, and readily enter into pacts that expand their reach.",
        "You choose your patron's kind or determine it randomly, using the Genie Kind table.",
        {
          "type": "table",
          "caption": "Genie Kind",
          "colLabels": [
            "d4",
            "Kind",
            "Element"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-5",
            "col-5"
          ],
          "rows": [
            [
              1,
              "{@creature Dao}",
              "Earth"
            ],
            [
              2,
              "{@creature Djinni}",
              "Air"
            ],
            [
              3,
              "{@creature Efreeti}",
              "Fire"
            ],
            [
              4,
              "{@creature Marid}",
              "Water"
            ]
          ]
        },
        {
          "name": "Expanded Spell List",
          "type": "entries",
          "entries": [
            "{@i 1st-level Genie feature}",
            "The Genie lets you choose from an expanded list of spells when you learn a warlock spell. The Genie Expanded Spells table shows the genie spells that are added to the warlock spell list for you, along with the spells associated in the table with your patron's kind: dao, djinni, efreeti, or marid.",
            {
              "type": "table",
              "caption": "Genie Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Genie Spells",
                "Dao Spells",
                "Djinni Spells",
                "Efreeti Spells",
                "Marid Spells"
              ],
              "colStyles": [
                "col-1 text-center",
                "col-2-2",
                "col-2-2",
                "col-2-2",
                "col-2-2",
                "col-2-2"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell detect evil and good}",
                  "{@spell sanctuary}",
                  "{@spell thunderwave}",
                  "{@spell burning hands}",
                  "{@spell fog cloud}"
                ],
                [
                  "2nd",
                  "{@spell phantasmal force}",
                  "{@spell spike growth}",
                  "{@spell gust of wind}",
                  "{@spell scorching ray}",
                  "{@spell blur}"
                ],
                [
                  "3rd",
                  "{@spell create food and water}",
                  "{@spell meld into stone}",
                  "{@spell wind wall}",
                  "{@spell fireball}",
                  "{@spell sleet storm}"
                ],
                [
                  "4th",
                  "{@spell phantasmal killer}",
                  "{@spell stone shape}",
                  "{@spell greater invisibility}",
                  "{@spell fire shield}",
                  "{@spell control water}"
                ],
                [
                  "5th",
                  "{@spell creation}",
                  "{@spell wall of stone}",
                  "{@spell seeming}",
                  "{@spell flame strike}",
                  "{@spell cone of cold}"
                ],
                [
                  "9th",
                  "{@spell wish}",
                  "—",
                  "—",
                  "—",
                  "—"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Genie's Vessel|Warlock|TACS|Genie|TACS|1"
        }
      ]
    },
    {
      "name": "Genie's Vessel",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Genie feature}",
        "Your patron gifts you a magical vessel that grants you a measure of the genie's power. The vessel is a Tiny object, and you can use it as a spellcasting focus for your warlock spells. You decide what the object is, or you can determine what it is randomly by rolling on the Genie's Vessel table.",
        {
          "type": "table",
          "caption": "Genie's Vessel",
          "colLabels": [
            "d6",
            "Vessel"
          ],
          "colStyles": [
            "col-2 text-center",
            "col-10"
          ],
          "rows": [
            [
              "1",
              "Oil lamp"
            ],
            [
              "2",
              "Urn"
            ],
            [
              "3",
              "Ring with a compartment"
            ],
            [
              "4",
              "Stoppered bottle"
            ],
            [
              "5",
              "Hollow statuette"
            ],
            [
              "6",
              "Ornate lantern"
            ]
          ]
        },
        "While you are touching the vessel, you can use it in the following ways:",
        {
          "type": "options",
          "style": "list-hang-notitle",
          "entries": [
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Bottled Respite|Warlock|TACS|Genie|TACS|1"
            },
            {
              "type": "refSubclassFeature",
              "subclassFeature": "Genie's Wrath|Warlock|TACS|Genie|TACS|1"
            }
          ]
        },
        "The vessel's AC equals your spell save DC. Its hit points equal your warlock level plus your proficiency bonus, and it is immune to poison and psychic damage.",
        "If the vessel is destroyed or you lose it, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and the previous vessel is destroyed if it still exists. The vessel vanishes in a flare of elemental power when you die."
      ]
    },
    {
      "name": "Elemental Gift",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Genie feature}",
        "You begin to take on characteristics of your patron's kind. You now have resistance to a damage type determined by your patron's kind: bludgeoning (dao), thunder (djinni), fire (efreeti), or cold (marid).",
        "In addition, as a bonus action, you can give yourself a flying speed of 30 feet that lasts for 10 minutes, during which you can hover. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Sanctuary Vessel",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "{@i 10th-level Genie feature}",
        "When you enter your Genie's Vessel via the Bottled Respite feature, you can now choose up to five willing creatures that you can see within 30 feet of you, and the chosen creatures are drawn into the vessel with you.",
        "As a bonus action, you can eject any number of creatures from the vessel, and everyone is ejected if you leave or die or if the vessel is destroyed.",
        "In addition, anyone (including you) who remains within the vessel for at least 10 minutes gains the benefit of finishing a short rest, and anyone can add your proficiency bonus to the number of hit points they regain if they spend any Hit Dice as part of a short rest there."
      ]
    },
    {
      "name": "Limited Wish",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Genie feature}",
        "You entreat your patron to grant you a small wish. As an action, you can speak your desire to your Genie's Vessel, requesting the effect of one spell that is 6th level or lower and has a casting time of 1 action. The spell can be from any class's spell list, and you don't need to meet the requirements in that spell, including costly components; the spell simply takes effect as part of this action.",
        "Once you use this feature, you can't use it again until you finish {@dice 1d4} long rests."
      ]
    },
    {
      "name": "The Undead",
      "source": "VRGR",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Undead",
      "subclassSource": "VRGR",
      "level": 1,
      "entries": [
        "You've made a pact with a deathless being, a creature that defies the cycle and life and death, forsaking its mortal shell so it might eternally pursue its unfathomable ambitions. For such beings, time and morality are fleeting things, the concerns of those for whom grains of sand still rush through life's hourglass. Having once been mortal themselves, these ancient undead know firsthand the paths of ambition and the routes past the doors of death. They eagerly share this profane knowledge, along with other secrets, with those who work their will among the living.",
        "Beings of this type include the demilich Acererak, the vampire tyrant Kas the Bloody-Handed, the githyanki lich-queen Vlaakith, the dracolich Dragotha, the undead pharaoh Ankhtepot, and the elusive Darklord, Azalin Rex.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "{@i 1st-level Undead feature}",
            "The Undead lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Undead Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell bane}, {@spell false life}"
                ],
                [
                  "2nd",
                  "{@spell blindness/deafness}, {@spell phantasmal force}"
                ],
                [
                  "3rd",
                  "{@spell phantom steed}, {@spell speak with dead}"
                ],
                [
                  "4th",
                  "{@spell death ward}, {@spell greater invisibility}"
                ],
                [
                  "5th",
                  "{@spell antilife shell}, {@spell cloudkill}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Form of Dread|Warlock|TACS|Undead|VRGR|1"
        }
      ]
    },
    {
      "name": "Form of Dread",
      "source": "VRGR",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Undead",
      "subclassSource": "VRGR",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Undead feature}",
        "You manifest an aspect of your patron's dreadful power. As a bonus action, you transform for 1 minute. You gain the following benefits while transformed:",
        {
          "type": "list",
          "items": [
            "You gain temporary hit points equal to {@dice 1d10} + your warlock level.",
            "Once during each of your turns, when you hit a creature with an attack roll, you can force it to make a Wisdom saving throw, and if the saving throw fails, the target is {@condition frightened} of you until the end of your next turn.",
            "You are immune to the {@condition frightened} condition."
          ]
        },
        "You can transform a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
        "The appearance of your Form of Dread reflects some aspect of your patron. For example, your form could be a shroud of shadows forming the crown and robes of your lich patron, or your body might glow with glyphs from ancient funerary rites and be surrounded by desert winds, suggesting your mummy patron."
      ]
    },
    {
      "name": "Grave Touched",
      "source": "VRGR",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Undead",
      "subclassSource": "VRGR",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Undead feature}",
        "Your patron's powers have a profound effect on your body and magic. You don't need to eat, drink, or breathe.",
        "In addition, once during each of your turns, when you hit a creature with an attack roll and roll damage against the creature, you can replace the damage type with necrotic damage. While you are using your Form of Dread, you can roll one additional damage die when determining the necrotic damage the target takes."
      ]
    },
    {
      "name": "Necrotic Husk",
      "source": "VRGR",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Undead",
      "subclassSource": "VRGR",
      "level": 10,
      "header": 2,
      "entries": [
        "{@i 10th-level Undead feature}",
        "Your connection to undeath and necrotic energy now saturates your body. You have resistance to necrotic damage. If you are transformed using your Form of Dread, you instead become immune to necrotic damage.",
        "In addition, when you would be reduced to 0 hit points, you can use your reaction to drop to 1 hit point instead and cause your body to erupt with deathly energy. Each creature of your choice that is within 30 feet of you takes necrotic damage equal to {@damage 2d10} + your warlock level. You then gain 1 level of {@condition exhaustion}. Once you use this reaction, you can't do so again until you finish {@dice 1d4} long rests."
      ]
    },
    {
      "name": "Spirit Projection",
      "source": "VRGR",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Undead",
      "subclassSource": "VRGR",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Undead feature}",
        "Your spirit can become untethered from your physical form. As an action, you can project your spirit from your body. The body you leave behind is {@condition unconscious} and in a state of suspended animation.",
        "Your spirit resembles your mortal form in almost every way, replicating your game statistics but not your possessions. Any damage or other effects that apply to your spirit or physical body affects the other. Your spirit can remain outside your body for up to 1 hour or until your concentration is broken (as if concentrating on a spell). When your projection ends, your spirit returns to your body or your body magically teleports to your spirit's space (your choice).",
        "While projecting your spirit, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Your spirit and body gain resistance to bludgeoning, piercing, and slashing damage.",
            "When you cast a spell of the conjuration or necromancy school, the spell doesn't require verbal or somatic components or material components that lack a gold cost.",
            "You have a flying speed equal to your walking speed and can hover. You can move through creatures and objects as if they were {@quickref difficult terrain|TACS|3}, but you take {@dice 1d10} force damage if you end your turn inside a creature or an object.",
            "While you are using your Form of Dread, once during each of your turns when you deal necrotic damage to a creature, you regain hit points equal to half the amount of necrotic damage dealt."
          ]
        },
        "Once you use this feature, you can't do so again until you finish a long rest."
      ]
    },
    {
      "name": "The Celestial",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "Your patron is a powerful being of the Upper Planes. You have bound yourself to an ancient empyrean, solar, ki-rin, unicorn, or other entity that resides in the planes of everlasting bliss. Your pact with that being allows you to experience the barest touch of the holy light that illuminates the multiverse.",
        "Being connected to such power can cause changes in your behavior and beliefs. You might find yourself driven to annihilate the undead, to defeat fiends, and to protect the innocent. At times, your heart might also be filled with a longing for the celestial realm of your patron, and a desire to wander that paradise for the rest of your days. But you know that your mission is among mortals for now, and that your pact binds you to bring light to the dark places of the world.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "The Celestial lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Celestial Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell cure wounds}, {@spell guiding bolt}"
                ],
                [
                  "2nd",
                  "{@spell flaming sphere}, {@spell lesser restoration}"
                ],
                [
                  "3rd",
                  "{@spell daylight}, {@spell revivify}"
                ],
                [
                  "4th",
                  "{@spell guardian of faith}, {@spell wall of fire}"
                ],
                [
                  "5th",
                  "{@spell flame strike}, {@spell greater restoration}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Bonus Cantrips|Warlock|TACS|Celestial|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Healing Light|Warlock|TACS|Celestial|TACS|1"
        }
      ]
    },
    {
      "name": "Bonus Cantrips",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "At 1st level, you learn the {@spell sacred flame} and {@spell light} cantrips. They count as warlock cantrips for you, but they don't count against your number of cantrips known."
      ]
    },
    {
      "name": "Healing Light",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "At 1st level, you gain the ability to channel celestial energy to heal wounds. You have a pool of {@dice d6}s that you spend to fuel this healing. The number of dice in the pool equals 1 + your warlock level.",
        "As a bonus action, you can heal one creature you can see within 60 feet of you, spending dice from the pool. The maximum number of dice you can spend at once equals your Charisma modifier (minimum of one die). Roll the dice you spend, add them together, and restore a number of hit points equal to the total.",
        "Your pool regains all expended dice when you finish a long rest."
      ]
    },
    {
      "name": "Radiant Soul",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, your link to the Celestial allows you to serve as a conduit for radiant energy. You have resistance to radiant damage, and when you cast a spell that deals radiant or fire damage, you can add your Charisma modifier to one radiant or fire damage roll of that spell against one of its targets."
      ]
    },
    {
      "name": "Celestial Resilience",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, you gain temporary hit points whenever you finish a short or long rest. These temporary hit points equal your warlock level + your Charisma modifier. Additionally, choose up to five creatures you can see at the end of the rest. Those creatures each gain temporary hit points equal to half your warlock level + your Charisma modifier."
      ]
    },
    {
      "name": "Searing Vengeance",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Celestial",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, the radiant energy you channel allows you to resist death. When you have to make a death saving throw at the start of your turn, you can instead spring back to your feet with a burst of radiant energy. You regain hit points equal to half your hit point maximum, and then you stand up if you so choose. Each creature of your choice that is within 30 feet of you takes radiant damage equal to {@dice 2d8} + your Charisma modifier, and it is {@condition blinded} until the end of the current turn.",
        "Once you use this feature, you can't use it again until you finish a long rest."
      ]
    },
    {
      "name": "The Hexblade",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "You have made your pact with a mysterious entity from the Shadowfell—a force that manifests in sentient magic weapons carved from the stuff of shadow. The mighty sword Blackrazor is the most notable of these weapons, which have been spread across the multiverse over the ages. The shadowy force behind these weapons can offer power to warlocks who form pacts with it. Many hexblade warlocks create weapons that emulate those formed in the Shadowfell. Others forgo such arms, content to weave the dark magic of that plane into their spellcasting.",
        "Because the Raven Queen is known to have forged the first of these weapons, many sages speculate that she and the force are one and that the weapons, along with hexblade warlocks, are tools she uses to manipulate events on the Material Plane to her inscrutable ends.",
        {
          "type": "entries",
          "name": "Expanded Spell List",
          "entries": [
            "The Hexblade lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
            {
              "type": "table",
              "caption": "Hexblade Expanded Spells",
              "colLabels": [
                "Spell Level",
                "Spells"
              ],
              "colStyles": [
                "col-2 text-center",
                "col-10"
              ],
              "rows": [
                [
                  "1st",
                  "{@spell shield}, {@spell wrathful smite}"
                ],
                [
                  "2nd",
                  "{@spell blur}, {@spell branding smite}"
                ],
                [
                  "3rd",
                  "{@spell blink}, {@spell elemental weapon}"
                ],
                [
                  "4th",
                  "{@spell phantasmal killer}, {@spell staggering smite}"
                ],
                [
                  "5th",
                  "{@spell banishing smite}, {@spell cone of cold}"
                ]
              ]
            }
          ]
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Hexblade's Curse|Warlock|TACS|Hexblade|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Hex Warrior|Warlock|TACS|Hexblade|TACS|1"
        }
      ]
    },
    {
      "name": "Hex Warrior",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "At 1st level, you acquire the training necessary to effectively arm yourself for battle. You gain proficiency with medium armor, shields, and martial weapons.",
        "The influence of your patron also allows you to mystically channel your will through a particular weapon. Whenever you finish a long rest, you can touch one weapon that you are proficient with and that lacks the two-handed property. The weapon deals an additional {@dice 1d6} necrotic damage on hit. This benefit lasts until you finish a long rest. If you later gain the Pact of the Blade feature, this benefit extends to every pact weapon you conjure with that feature, no matter the weapon's type.",
        "The extra necrotic damage of the hexblade increases as you gain levels in this class, increasing to {@dice 1d8} when you reach 8th level and {@dice 1d10} when you reach 15th level."
      ]
    },
    {
      "name": "Hexblade's Curse",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, you gain the ability to place a baleful curse on someone. As a bonus action, choose one creature you can see within 30 feet of you. The target is cursed for 1 minute. The curse ends early if the target dies, you die, or you are {@condition incapacitated}. Until the curse ends, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain a bonus to damage rolls against the cursed target. The bonus equals your proficiency bonus.",
            "Any attack roll you make against the cursed target is a critical hit on a roll of 19 or 20 on the {@dice d20}.",
            "If the cursed target dies, you regain hit points equal to your warlock level + your Charisma modifier (minimum of 1 hit point)."
          ]
        },
        "You can't use this feature again until you finish a short or long rest."
      ]
    },
    {
      "name": "Accursed Specter",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, you can curse the soul of a person you slay, temporarily binding it to your service. When you slay a humanoid, you can cause its spirit to rise from its corpse as a {@creature specter}, the statistics for which are in the Monster Manual. When the specter appears, it gains temporary hit points equal to half your warlock level. Roll initiative for the specter, which has its own turns. It obeys your verbal commands, and it gains a special bonus to its attack rolls equal to your Charisma modifier (minimum of +0).",
        "The specter remains in your service until the end of your next long rest, at which point it vanishes to the afterlife.",
        "Once you bind a specter with this feature, you can't use the feature again until you finish a long rest."
      ]
    },
    {
      "name": "Armor of Hexes",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 10,
      "header": 2,
      "entries": [
        "At 10th level, your hex grows more powerful. If the target cursed by your Hexblade's Curse hits you with an attack roll, you can use your reaction to roll a {@dice d6}. On a 4 or higher, the attack instead misses you, regardless of its roll."
      ]
    },
    {
      "name": "Master of Hexes",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Hexblade",
      "subclassSource": "TACS",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, you can spread your Hexblade's Curse from a slain creature to another creature. When the creature cursed by your Hexblade's Curse dies, you can apply the curse to a different creature you can see within 30 feet of you, provided you aren't {@condition incapacitated}. When you apply the curse in this way, you don't regain hit points from the death of the previously cursed creature."
      ]
    },
    {
      "name": "Bottled Respite",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "As an action, you can magically vanish and enter your vessel, which remains in the space you left. The interior of the vessel is an extradimensional space in the shape of a 20-foot-radius cylinder, 20 feet high, and resembles your vessel. The interior is appointed with cushions and low tables and is a comfortable temperature. While inside, you can hear the area around your vessel as if you were in its space. You can remain inside the vessel up to a number of hours equal to twice your proficiency bonus. You exit the vessel early if you use a bonus action to leave, if you die, or if the vessel is destroyed. When you exit the vessel, you appear in the unoccupied space closest to it. Any objects left in the vessel remain there until carried out, and if the vessel is destroyed, every object stored there harmlessly appears in the unoccupied spaces closest to the vessel's former space. Once you enter the vessel, you can't enter again until you finish a long rest."
      ]
    },
    {
      "name": "Genie's Wrath",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Genie",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "Once during each of your turns when you hit with an attack roll, you can deal extra damage to the target equal to your proficiency bonus. The type of this damage is determined by your patron: bludgeoning (dao), thunder (djinni), fire (efreeti), or cold (marid)."
      ]
    },
    {
      "name": "The Greatwyrm",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "There are dragons that have ascended to near god-hood known as greatwyrms. It is no secret that dragons can bestow their powers as gifts onto other creatures, there are even dragons that are gods in the D&D multiverse that bestow their powers onto clerics as divine power.",
        "Greatwyrms are similar in nature to these divine dragons, but on a lesser scale typically. As such, they are just as capable as bestowing power to devout followers. Some greatwyrms have cult-like followings, others give their powers to great heroes and some are even children to these great beings.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Expanded Spell List|Warlock|TACS|Greatwyrm|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Eye of Dragonsight|Warlock|TACS|Greatwyrm|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Draconic Gift|Warlock|TACS|Greatwyrm|TACS|1"
        }
      ],
      "page": null
    },
    {
      "name": "Expanded Spell List",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, the greatwyrm lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
        {
          "type": "table",
          "caption": "Expanded Spell List",
          "colLabels": [
            "Spell Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "1st",
              "{@spell absorb elements|XGE}, {@spell chromatic orb|PHB}"
            ],
            [
              "2nd",
              "{@spell darkvision|PHB}, {@spell dragon's breath|XGE}"
            ],
            [
              "3rd",
              "{@spell elemental weapon|PHB}, {@spell protection from energy|PHB}"
            ],
            [
              "4th",
              "{@spell arcane eye|PHB}, {@spell polymorph|PHB}"
            ],
            [
              "5th",
              "{@spell circle of power|PHB}, {@spell summon draconic spirit|FTD}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Eye of Dragonsight",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 1,
      "header": 1,
      "entries": [
        "Starting at 1st level, you have the ability to perceive echoes of yourself and your dragon patron, allowing yourself to gain the knowledge and some abilities of these echoes. When you finish a short or long rest, choose one skill or tool you lack proficiency in. You gain proficiency in that skill or tool, which lasts until you finish your next short or long rest.",
        "As an action, you can focus your dragonsight and allow yourself to see spirits. You can see into the ethereal plane out to a range of 60 feet, as if you were under the effects of the {@spell see invisibility} spell. You can retain this sight for 1 minute or until you lose your concentration (as if you were concentrating on a spell).",
        "You can focus your dragonsight a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Draconic Gift",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 1,
      "header": 2,
      "entries": [
        "Also at 1st level, you have a gift from your patron that physically changes you. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            {
              "type": "entries",
              "name": "Tongue of Dragons",
              "entries": [
                "You learn to speak, read, and write Draconic or one other language of your choice."
              ]
            },
            {
              "type": "entries",
              "name": "Draconic Spells",
              "entries": [
                "When you finish a short rest, choose from acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder. When you damage a target with a spell, you can change the damage of the spell to the chosen type."
              ]
            },
            {
              "type": "entries",
              "name": "Dragon's Wrath",
              "entries": [
                "Once during each of your turns when you hit with an attack roll, you can deal extra damage equal to your proficiency bonus. The type of damage is determined by the type chosen by your draconic spells benefit."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Voice of The Greatwyrm",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 6,
      "entries": [
        "Starting at 6th level, you can channel the voice of your patron to boom through yours. As an action, you can give yourself advantage on all Charisma ability checks for the next 10 minutes. You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses of it once you complete a short or long rest. ",
        "Alternatively, when you have no remaining uses of this ability you can expend a warlock spell slot to use it again.",
        "In addition, you have advantage on saving throws made to resist being {@condition charmed} or {@condition frightened}."
      ],
      "header": 2
    },
    {
      "name": "Flight of The Greatwyrm",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 10,
      "entries": [
        "Starting at 10th level, as a bonus action, you can form spectral wings and give yourself a flying speed of 60 feet that lasts for 10 minutes, during which you can hover. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      ],
      "header": 2
    },
    {
      "name": "Versatile Dragon Spells",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 10,
      "entries": [
        "Also at 10th level, when you would change the type of damage a spell would use with your Draconic Spells benefit, you can choose a different type from the same list. You can use this feature twice, regaining all expended uses when you finish a short or long rest.",
        "Alternatively, you can expend a warlock spell slot to use this feature again when you have no remaining uses of it."
      ],
      "header": 2
    },
    {
      "name": "Ward of The Greatwyrm",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Greatwyrm",
      "level": 14,
      "header": 2,
      "entries": [
        "At 14th level, you can use a bonus action and a warlock spell slot to cast the {@spell Primordial Ward|XGE} spell. When you cast this spell in this way, you do not need to concentrate on it and its casting time is the bonus action used for it.",
        "Alternatively, you can cast the spell in the same way but as an action instead, doing so gives you the ability to choose a creature within 30 feet of you that you can see and give them the benefits of the spell instead of yourself."
      ]
    },
    {
      "name": "The Matron of Ravens",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "A mortal who ascended to divinity, the mother of ravens and the queen of life and death. Your patron is the Matron of Ravens, a mysterious being who rules the Shadowfell from a palace of ice deep within that dread realm. The Matron of Ravens watches over the world, anticipating each creature's death and ensuring that it meets its end at the proscribed time and place. As the ruler of the Shadowfell, she dwells in a decayed, dark reflection of the world. Her ability to reach into the world is limited. Thus, she turns to mortal warlocks to serve her will. Warlocks sworn to the Matron of Ravens receive visions and whispers from her in their dreams, sending them on quests and warning them of impending dangers.",
        "The Matron of Raven's followers are expected to serve her will in the world. She concerns herself with ensuring that those fated to die pass from the world as expected, and bids her agents to defeat those who seek to cheat death through undeath or other imitations of immortality. She hates intelligent undead and expects her followers to strike them down, whereas mindless undead such as skeletons and zombies are little more than stumbling automatons in her eyes.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Expanded Spell List|Warlock|TACS|Matron of Ravens|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Eyes of The Raven|Warlock|TACS|Matron of Ravens|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Visage of Ravens|Warlock|TACS|Matron of Ravens|TACS|1"
        }
      ]
    },
    {
      "name": "Expanded Spell List",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 1,
      "entries": [
        "The Matron of Ravens lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
        {
          "type": "table",
          "caption": "Expanded Spell List",
          "colLabels": [
            "Spell Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "1st",
              "{@spell inflict wounds}, {@spell glacial grip|TACS}"
            ],
            [
              "2nd",
              "{@spell augury}, {@spell wither and bloom|SCC}"
            ],
            [
              "3rd",
              "{@spell revivify}, {@spell speak with dead}"
            ],
            [
              "4th",
              "{@spell ice storm}, {@spell locate creature}"
            ],
            [
              "5th",
              "{@spell raise dead}, {@spell cone of cold}"
            ]
          ]
        }
      ],
      "header": 1
    },
    {
      "name": "Eyes of The Raven",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 1,
      "header": 1,
      "entries": [
        "At 1st level, you gain the ability to sense the presence of the undead, whose existence is an insult to the natural cycle of life. You always know the location of any undead within 30 feet of you that isn't behind total cover and that isn't protected from divination magic. This sense doesn't tell you anything about a creature's capabilities or identity.",
        "As an action you can extend the range of this special sense to 60 feet until the start of your next turn. You can do so a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.",
        "In addition, you gain darkvision out to a range of 60 feet. If you already have darkvision from your race, its range increases by 30 feet."
      ]
    },
    {
      "name": "Visage of Ravens",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 1,
      "header": 1,
      "entries": [
        "Also at 1st level, you can manifest an aspect of your patron's dreadful power. As a bonus action, you transform for 1 minute. You gain the following benefits while transformed:",
        {
          "type": "list",
          "items": [
            "You have resistance to cold and necrotic damage.",
            "When you deal damage with an attack or spell, you can add an amount of necrotic damage equal to your proficiency bonus to one of the damage rolls. This necrotic damage becomes twice as potent against undead, and ignores any resistance or immunities to necrotic. You can deal this extra damage once per turn.",
            "You gain temporary hit points equal to {@dice 1d10} + your warlock level."
          ]
        },
        "You can transform a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
        "The appearance of your Visage of Ravens reflects some aspect of your patron. For example, your form could be a shroud of shadows forming the mask and robes of your patron, or shadowy ravens might fly around you and merge with your attacks and spells."
      ]
    },
    {
      "name": "Improved Raven Form",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 6,
      "header": 2,
      "entries": [
        "Starting at 6th level, when you transform into your Visage of Ravens, you gain the following benefits until the form expires.",
        {
          "type": "list",
          "items": [
            "You gain a flying speed equal to twice your walking speed and can hover.",
            "You are immune to being {@condition charmed} or {@condition frightened}.",
            "Undead that start their turn within 30 feet of you takes {@dice 1d10} force damage."
          ]
        }
      ]
    },
    {
      "name": "Raven-Touched",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, you've been granted a gift by your patron, allowing you to pursue her will further. You no longer need to eat, drink, or breathe.",
        "In addition, when you transform into your Visage of Ravens, you have immunity to cold and necrotic damage rather than resistance."
      ]
    },
    {
      "name": "Sunder Undeath",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Matron of Ravens",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, you can call on the powers of your patron to sunder and repel undead. As an action, you can emit an aura that extends out to a radius of 15 feet centered on yourself. Undead cannot willingly enter the aura nor reach through it. Undead that start their turn in the aura gains vulnerability to all damage and their movement speed is reduced to 0 until they are no longer within the aura. You can use an action to extend this aura out to a range of 30 feet until the end of your next turn.",
        "The aura lasts for 1 minute, or until you dismiss it as a bonus action. You concentrate on this effect as you would a spell. You can call on this aura once, regaining the ability to do so again when you finish a long rest, or when you have no remaining uses you can expend a warlock spell slot to use it again."
      ]
    },
    {
      "name": "The Blood Witch",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassShortName": "Blood Witch",
      "subclassSource": "TACS",
      "level": 1,
      "entries": [
        "Said to be the first to unlock this ancient form of fiendish magic, The Blood Witch is a very mysterious entity with a sort of mastery over blood magic. Where she acquired it from exactly is still unknown, as are many things about her. Some that have met her have claimed her to be a deity, while others refer to her as a false god with an exaggerated ego. She is revered by cultists as the first and one true master of the blood arts, while many see her as a stepping stone into their own wicked ascension.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Expanded Spell List|Warlock|TACS|Blood Witch|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Eyes of The Blood Witch|Warlock|TACS|Blood Witch|TACS|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Hemomancy|Warlock|TACS|Blood Witch|TACS|1"
        }
      ]
    },
    {
      "name": "Expanded Spell List",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 1,
      "entries": [
        "{@i 1st-level Blood Witch feature}",
        "The Blood Witch lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
        {
          "type": "table",
          "caption": "Expanded Spell List",
          "colLabels": [
            "Spell Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "1st",
              "{@spell Color Spray|PHB}, {@spell Inflict Wounds|PHB}"
            ],
            [
              "2nd",
              "{@spell Magic Mouth|PHB}, {@spell See Invisibility|PHB}"
            ],
            [
              "3rd",
              "{@spell Bestow Curse|PHB}, {@spell Life Transference|XGE}"
            ],
            [
              "4th",
              "{@spell Confusion|PHB}, {@spell Polymorph|PHB}"
            ],
            [
              "5th",
              "{@spell Geas|PHB}, {@spell Modify Memory}"
            ]
          ]
        }
      ],
      "header": 1
    },
    {
      "name": "Eyes of The Blood Witch",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Blood Witch feature}",
        "The Blood Witch was said to have a special sense that allowed her to find hidden paths and secret doors. As an action, you can inherit this magical sense for 1 minute. While you have this magical sight, you can potentially see through illusions and {@condition invisible} creatures and objects as if they weren't {@condition invisible}.",
        "This magical sight is limited however, as it is only a portion of The Blood Witch’s true sight. In order to see an {@condition invisible} creature or object, you must pass a Wisdom ({@skill Perception}) check in order to properly see it. If the creature was hidden, then the DC is the Dexterity ({@skill Stealth}) check it made, or if it wasn’t hidden the DC is 5 + the CR of the creature. If the object is {@condition invisible}, the DC equals the AC of the object or if it does not have an AC, the DM determines the check based on the size or difficulty to see the object in question.  If the invisibility was created via a spell, such as {@spell Invisibility|PHB}, the DC equals the Spell Save DC of the caster.",
        "To see through an illusion depends on the illusion itself. If the illusion is a spell, such as {@spell Disguise Self|PHB}, the DC equals the Spell Save DC of the caster of the spell. If the illusion is made via other means, the DM determines the DC based on the circumstances of the illusion.",
        "You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.",
        "{@i Note: A transmutation spell, such as {@spell Polymorph}, is not merely an illusion but an actual transformation and you cannot see its true form in the current state of this ability.}"
      ]
    },
    {
      "name": "Hemomancy",
      "source": "TACS",
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Blood Witch feature}",
        "Studying occult-based magic, you’ve learned the very nature of blood magic and can use it yourself to a limited degree. Your blood magic will be represented by hemomancy dice. These dice are d4s and you have a number of hemomancy dice equal to twice your proficiency bonus. ",
        "You use these dice to fuel your blood magic abilities, and you regain all of your hemomancy dice after a long rest. You cannot gain more hemomancy dice than you can have at your current level in this way. If a hemomancy feature requires a creature to make a saving throw, the DC equals your Spell Save DC.",
        "When you use a Hemomancy die, regardless if it is spent or not, you roll the die and take damage equal to what you roll. Your hemomancy dice grows stronger with you as you gain levels in this class, becoming a d6 at 5th level, a d8 at 9th level, a d10 at 13th level, and a d12 at 17th level.",
        "You can use your hemomancy dice in the following ways:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Hex of the Witch",
              "entries": [
                "As a bonus action, you can spend a hemomancy die to magically curse a creature you can see within 60 feet of you. When you do, that creature cannot regain hit points for a number of rounds equal to the number rolled. At the start of each of the affected creature’s turns, it takes necrotic damage equal to your hemomancy die. You concentrate on this hex as if you were concentrating on a spell."
              ]
            },
            {
              "type": "entries",
              "name": "Blood Transmutation",
              "entries": [
                "When you cast a cantrip that deals damage, you can use a hemomancy die to convert the damage type of the cantrip into necrotic damage until the end of the current turn and one damage roll receives an additional amount of necrotic damage equal to the number rolled on the hemomancy die. The first time you use this ability after each long rest, you don't expend the hemomancy die. All other times you use the ability, you expend the die."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Improved Witch's Sight",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 6,
      "entries": [
        "{@i 6th-level Blood Witch feature}",
        "As an action, you can spend a use of your Eyes of The Blood Witch feature to instead cast {@spell See Invisibility|PHB} without expending a spell slot or requiring material components. When cast in this way, the spell instead lasts for a minute instead of an hour."
      ],
      "header": 2
    },
    {
      "name": "Sacrificial Spells",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 10,
      "entries": [
        "{@i 10th-level Blood Witch feature}",
        "Using your blood magic, you can cast spells using your own vitality rather than through your pact magic. When you cast a warlock spell, instead of spending a spell slot you can instead spend a number of hemomancy dice equal to the level you cast the spell. You can cast the spell at its original level, or to a maximum level equal to your Warlock Spell Slot. The damage you take from your hemomancy dice when spent in this way is doubled."
      ],
      "header": 2
    },
    {
      "name": "Emissary of The Blood Witch",
      "source": "TACS",
      "page": null,
      "className": "Warlock",
      "classSource": "TACS",
      "subclassSource": "TACS",
      "subclassShortName": "Blood Witch",
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Blood Witch feature}",
        "The first time you use your Eyes of The Blood Witch feature, you instead cast the {@spell True Seeing|PHB} spell without expending a spell slot or requiring material components, but you can only target yourself. It lasts for its full duration and cannot be dispelled. Once you reach 15th level, you also gain the {@optfeature Witch Sight|PHB} Eldritch Invocation, but it does not count against your total number of Eldritch Invocations.",
        "In addition, the following options are added to your Hemomancy feature:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Potent Blood Magic",
              "entries": [
                "When you cast a spell using a Warlock spell slot, you can spend a hemomancy die to force every creature affected by the spell to take necrotic damage equal to the number rolled plus your charisma modifier."
              ]
            },
            {
              "type": "entries",
              "name": "Blood Magic Reserves",
              "entries": [
                "When you have no remaining hemomancy dice, as a bonus action you can spend a warlock spell slot to regain 5 hemomancy dice. You can use the ability twice, regaining all expended uses when you finish a long rest."
              ]
            }
          ]
        }
      ]
    }
  ],
  "spell": [
    {
      "name": "Air Promenade",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform elegant and rhythmic movements to allow yourself to dance through the air effortlessly as powerful winds lift you off the ground. For the duration, you have a flying speed equal to your walking speed and can hover, but you cannot ascend any higher than 10 feet off the ground. ",
        "When the spell ends, you safely descend to the ground, provided you are no higher than 20 feet. If you are higher than 20 feet when the spell ends, you fall at a normal rate."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 4th level or higher, the duration is 8 hours. If you use a spell slot of 6th level or higher, the duration is 24 hours. Using a spell slot of 4th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Aquarius's Veil",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A gilded gemstone worth 500 gp filled with ocean water",
          "cost": 50000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You don yourself with a veil of watery armor. Until the spell ends, you have the following benefits:",
        {
          "type": "list",
          "items": [
            "You have immunity to fire damage and resistance to cold damage.",
            "You have a swim speed of 80 feet and can breathe underwater as you do air.",
            "While you're not wearing armor, your armor class becomes 14 + your Dexterity modifier and you have advantage on Strength and Dexterity saving throws.",
            "You have advantage on attack rolls made with daggers, javelins, shortswords, spears, or tridents and you can use your spellcasting ability for the attack and damage rolls made with such weapons in place of Strength or Dexterity.",
            "You gain 60 temporary hit points. If any of these remain when the spell ends, they are lost."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Fiery Earth",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and fire, syncing together in a perfect harmony. Until the spell ends, the target is wreathed in magical flames that retaliate against creatures that hit them with melee attacks, dealing {@damage 1d8} fire damage to the attacker.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of earth and the elemental plane of fire. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} fire or poison damage.",
        "Also, whenever a creature under the effects of this spell heals a creature with a spell, they can add {@dice 1d8} healing to one of the rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire",
        "poison"
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Flowing Life",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of earth and water, syncing together in a perfect harmony. Until the spell ends, the target has a swim and climb speed of 60 feet and do not suffer penalties to their speed while traversing through difficult terrain.",
        "In addition, the target can empower their ability to heal immensely by channeling both of the primordial energies of the elemental plane of earth and the elemental plane of water. Whenever they heal a creature with a spell, they can add an additional {@dice 2d8} healing to one of the rolls from the spell.",
        "In addition, when they heal a creature with a spell, they can remove any one condition or disease, or they can remove one level of {@condition exhaustion}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "miscTags": [
        "HL"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ballad of Storms",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Your voice and song empowers a single creature that can hear you within range. The song is an intermingling of the elemental planes of air and water, syncing together in a perfect harmony. Until the spell ends, the target has a flying speed of 60 feet and can hover.",
        "In addition, the target can empower their weapons and magic with the primordial energies of the elemental plane of air and the elemental plane of water. Whenever the target deals damage with a weapon or spell, they can deal an additional {@damage 2d8} lightning or thunder damage and creatures who take this damage are pushed up to 10 feet away from the attacker or source of the spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, you can target one additional creature for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "lightning",
        "thunder"
      ],
      "miscTags": [
        "FMV"
      ],
      "areaTags": [
        "ST",
        "MT"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Blade of Frost",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "sphere",
        "distance": {
          "type": "feet",
          "amount": 5
        }
      },
      "components": {
        "s": true,
        "m": "a melee weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You brandish the weapon used in the spell's casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack's normal effects and then ice begins to creep from the point of impact. The target's speed is reduced by 10 feet until the start of your next turn.",
        "This spell's damage increases when you reach certain levels. At 5th level, the melee attack deals an extra {@damage 1d8} cold damage to the target on a hit. The extra damage increases by {@dice 1d8} at 11th level ({@dice 2d8}) and again at 17th level ({@dice 3d8})."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Blustering Winds",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You extend your hands and gales of wind blows around you in a 10 foot radius centered on you. Creatures within range make a strength saving throw. On a failed save, the creature takes {@damage 1d10} bludgeoning damage and is pushed 10 feet back and knocked {@condition prone}. On a success, they take half damage and suffers no additional effects."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Boulder Bash",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a giant rock and throw it in a 5-foot-wide 30-foot-long line. Each creature within range must make a Dexterity saving throw, taking {@damage 3d10} bludgeoning damage and is knocked {@condition prone} on a failed save or half as much on a success and is not knocked {@condition prone}. When the rock reaches the end of its range, or if it hits a wall, the rock vanishes. If it hits a wall, the wall automatically takes damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd"
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Burning Touch",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You ignite your hands with red hot flames and attempt to burn a creature. Make a melee spell attack, on hit it takes {@damage 2d8} fire damage and must make a Constitution saving throw. On a failed save, they are caught on fire and takes an additional {@damage 1d8} fire damage at the start of each of their turns for the duration. A creature can use its action to put out the flames, or at the end of each of the affected creature's turn it can repeat its Constitution save, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "spellAttack": [
        "M"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Charity",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You touch a creature and imbue them with a small pool of your magical power, which can restore them in two different ways. If the target is a spellcaster, you can have it regain one of its expended spell slots of 2nd level or lower. If the target is not a spellcaster, or if it chooses not to regain a spell slot, it instead regains a number of hit points equal to {@dice 4d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the maximum expended slot level that can be regained increases by 1 and the healing increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Chilling Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The next time you hit with a melee weapon attack during this spell's duration, your weapon is freezing cold to the touch, and the attack deals an extra {@damage 1d8} cold damage. If the target is a creature, at the start of its next turn it must succeed a Constitution saving throw or have their movement speed cut in half until the spell ends. The creature may repeat its save at the start of each of its turns until the spell ends, ending the effect on itself on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d8} for each slot level above 1st."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cold Snap",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You snap your fingers and a burst of cold energy cracks at a point you choose within range. Each creature in a 15-foot-radius sphere centered on that point must make a Constitution saving throw. A target takes {@damage 6d6} cold damage and their movement is reduced to 0 until the start of your next turn on a failed save, or half as much damage on a successful one and their speed is not reduced.",
        "The cold vapors spread around corners. It freezes non-magical objects and liquid in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@damage 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Contact Ancient Spirits",
      "source": "TACS",
      "level": 3,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny statue made of gold or silver worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "You reach out to the great beyond to call upon the wisdom of ancient souls of long dead scholars. Three tiny sized spirits which take the forms of balls of light float around you within range of the spell. You can ask each of the spirits a single question, which they must answer truthfully. After a spirit has answered your question, it disappears. You must ask your questions before the spell ends.",
        "Each spirit has a +10 to any Intelligence ability check, though depending on the question, a check may or may not be required (DM's choice). If a check is required, the DM determines the DC based on the rarity of the answer, the rarest resulting in a DC 30, whereas an uncommon answer results in a DC 15. The spirit takes the form of a creature who may know the answer to your question when it is asked. The creature does not have to be humanoid. A failed check results in the spirit being unable to answer the question, and disappears out of embarrassment or prideful arrogance.",
        "The spell fails if you have cast it within the last 24 hours."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Counterspell",
      "source": "TACS",
      "otherSources": [
        {
          "source": "PHB",
          "page": 228
        }
      ],
      "level": 3,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a creature within 60 feet of you casting a spell and you are not casting a spell."
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You attempt to interrupt a creature in the process of casting a spell. Make an ability check using your spellcasting ability and add your proficiency bonus to the roll. The DC equals the caster’s spell save DC. On a success, its spell fails and has no effect.",
        "On a failure, their spell succeeds but its effects are dampened as your spell acts as a buffer for its effects. The spell’s damage, healing, range, and duration is halved. If there was nothing to halve, this spell simply has no effect. If your check fails by 5 or more, this spell also has no effect.",
        "An astute caster can recognize when their spell is about to fail and attempt to reinforce it with their own magic. A creature with proficiency in arcana can use their reaction to add to the DC equal to the level they are casting their own spell at."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, you can add a +1 bonus to  your spellcasting ability check used for the spell for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ],
        "fromSubclass": [
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption (UA)",
              "source": "UAATrioOfSubclasses"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Redemption",
              "source": "XGE"
            }
          },
          {
            "class": {
              "name": "Sorcerer",
              "source": "PHB"
            },
            "subclass": {
              "name": "Clockwork Soul (UA)",
              "source": "UA2020SubclassesPt2"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers (UA)",
              "source": "UA2020SubclassesPt1"
            }
          },
          {
            "class": {
              "name": "Paladin",
              "source": "PHB"
            },
            "subclass": {
              "name": "Watchers",
              "source": "TCE"
            }
          }
        ]
      },
      "races": [
        {
          "name": "Human (Mark of Sentinel)",
          "source": "ERLW",
          "baseName": "Human",
          "baseSource": "PHB"
        }
      ],
      "backgrounds": [
        {
          "name": "Azorius Functionary",
          "source": "GGR"
        }
      ]
    },
    {
      "name": "Creeping Cold",
      "source": "TACS",
      "level": 5,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pinch of powdered snow"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You choose a creature within range that you can see and mark them with a freezing cold brand. Ice begins to slowly creep from the ground beneath their feet to the tip of their head, covering the body with ice. The creature must make a Constitution saving throw. On a failed save, they take {@damage 6d6} cold damage and is {@condition restrained} as they are frozen to the ground. If the creature is airborne, a pillar of ice is made between the creature and the ground. The ice occupies the spaces in between it and the ground and the creature's elevation remains the same. The spell fails if the creature is more than 30 feet off the ground. On a successful save, the creature takes half damage and isn't affected. A creature is also unaffected by the spell if it has immunity to cold damage or being {@condition petrified} and a creature with resistance to cold damage has advantage on its saves against the spell.",
        "A creature affected by the spell must make another Constitution saving throw at the end of each of its turns. On a failed save, it takes an additional {@damage 2d6} cold damage or half as much on a success. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to a frozen statue and subjected to the {@condition petrified} condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.",
        "A creature may use its action to break off a piece of the ice. Doing so counts as one successful save for the purposes of the spell. Every time the creature takes any amount of piercing or fire damage counts as one successful save."
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cutting Wind",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "Magical winds build up in your hands and launch out to a creature within range. Make a ranged spell attack. On hit, the target takes {@damage 1d6} slashing damage and are left scarred with magic. Until the start of your next turn, the next weapon attack that hits the target deals an additional {@damage 1d6} damage of the weapon's type.",
        "This spell's damage increases when you reach certain levels. At 5th level, the attack's damage increases by {@damage 1d6} ({@dice 2d6}). Both damage rolls increase by {@dice 1d6} at 11th level ({@dice 3d6} and {@dice 2d6}) and the attack again increases by {@dice 1d6} at 17th level ({@dice 4d6} and {@dice 2d6})."
      ],
      "damageInflict": [
        "slashing"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Cyclone",
      "source": "TACS",
      "level": 3,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You summon a brief powerful windstorm to launch your enemies into the air. Choose a point within range, you summon a swirling windstorm in a 20-foot tall 20-foot radius cylinder. Every creature within the cylinder makes a Strength saving throw. On a failed save, they take {@damage 6d6} bludgeoning damage and are pulled to the top of the cylinder toward the center, falling to the ground afterward. On a success they take half as much and are not pulled."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d6} for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Destruct Riff",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A musical instrument worth at least 1 sp"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You play a quick and powerful musical performance. Make a ranged spell attack against a creature or object to assail it with the rupturing power of song. On a hit, the target takes {@damage 1d8} thunder damage and are pushed 5 feet away from you.",
        "If you hit a construct target, it also has disadvantage on attack rolls against you until the end of your next turn.",
        "This spell's damage increases by {@dice 1d8} when you reach 5th level ({@dice 2d8}), 11th level ({@dice 3d8}), and 17th level ({@dice 4d8})."
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "FMV"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine Avatar",
      "source": "TACS",
      "level": 12,
      "school": "T",
      "subschools": [
        "epic spell"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A crystal or gem containing the soul of a dead god worth at least 100,000 gp"
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You assume the form of a god of your choosing. You become an avatar of said god, using an appropriate statblock. If one is not otherwise provided, you use the Divine Avatar statblock and if you do, choose from one of the listed domains: Arcana, Death, Forge, Grave, Knowledge, Life, Light, Nature, Order, Peace, Tempest, Trickery, Twilight, or War. You gain certain statistics depending on the domain you chose.",
        "You maintain this form for the duration, until your hit points is reduced to 0 in that form, or until you dismiss the spell as an action. Becoming even the avatar of a god, even for a moment, is a taxing endeavor. You gain three levels of {@condition exhaustion}, which cannot be recovered until you complete a long rest for each individual {@condition exhaustion} level. In addition, you lose the ability to cast spells until you finish a long rest."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Fiery Chains",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 150
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You launch outward a chain of fire that wraps around a target of your choice that you can see within range. Three additional chains then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the chains.",
        "A target must make a Dexterity saving throw. The target takes {@damage 6d6} fire damage and is {@condition restrained} on a failed save, or half as much damage and is not {@condition restrained} on a success.",
        "A {@condition restrained} creature takes {@damage 2d6} fire damage at the start of its turns and can use its action to attempt to break out of the chains by making a successful Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, one additional chain leaps from the first target to another target for each slot level above 6th."
          ]
        }
      ],
      "damageInflict": [
        "fire"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Divine's Flames of Life or Death",
      "source": "TACS",
      "level": 6,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "A wave of fiery energy washes out from a point centered on yourself. Choose either life or death. You can expend one of your Hit Dice and make three rolls using the size of the chosen Hit Die. You take damage equal to the total number rolled as burns envelop your body and your constitution is used to fuel the spell. You then apply one of the following effects depending on what you chose:",
        "{@b Death.} Every other creature in that area needs to make a Dexterity saving throw, taking fire damage equal to the total number rolled plus your spellcasting ability modifier on a failed save, or half as much on a success.",
        "{@b Life.} Every other creature you choose in that area regains hit points equal to the total number rolled plus your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 7th level or higher, the number of dice rolled increases by one for each slot level above 6th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Encore",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you see a spell being cast"
        }
      ],
      "range": {
        "type": "special"
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "special"
        }
      ],
      "entries": [
        "When you see a 2nd level or lower spell being cast, you can immediately use your reaction to cast that spell, using its range and duration for this spell's. If you do not meet the requirements of the spell, such as having costly material components or a specific prerequisite listed in the spell, the spell fails. The spell also fails if the casting time is not an action or bonus action.",
        "When you cast that spell in this way, it is cast at its lowest level, but uses your spellcasting ability for it."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the level of spell you can encore can be one level higher for each slot level above 3rd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fairy Fun",
      "source": "TACS",
      "level": 1,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You summon forth the mischief of the fey and implore various pranks and tricks onto a creature, causing them one of varying effects. Choose a creature that you can see within range, they suffer one of the following effects of your choosing for the duration, or until you end the spell as a bonus action.",
        {
          "type": "entries",
          "name": "Hallucinations",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, they have disadvantage on {@skill Perception} checks that rely on sight, as colorful and misty visions of various fey creatures cloud their vision. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Tumbling Fool",
          "entries": [
            "The target makes a Dexterity saving throw. On a failed save, they have disadvantage on Dexterity-based attack rolls and Dexterity ability checks, as they begin to tumble and fool around. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Babble of Doom",
          "entries": [
            "The target makes a Charisma saving throw. On a failed save, they have disadvantage on Charisma ability checks as they begin to babbling over their words like a fool. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Forgetful Idiot",
          "entries": [
            "The target makes an Intelligence saving throw. On a failed save, they struggle to recall specific details on anything, such as a name, yet they always have that feeling of familiarity as if the information is constantly on the tip of their tongue. They have disadvantage on Intelligence ability checks. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Beware the Bear",
          "entries": [
            "The target makes a Wisdom saving throw. On a failed save, everyone in their vision appears as a giant, terrifying bear that fills them with a magical fear. The target is {@condition frightened} for the duration. At the end of each of the creature's turns, they can repeat their save, ending the effect on a success."
          ]
        },
        {
          "type": "entries",
          "name": "Why is it Always Chickens?!",
          "entries": [
            "The target makes a Strength saving throw. On a failed save, countless chickens flock from out of nowhere and bombard the target, causing them to fall {@condition prone}. This effect repeats at the end of each of the target's turns, until they succeed against it three times, ending the effect."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Fey Transformation",
      "source": "TACS",
      "level": 3,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a gilded flower from the feywild worth at least 100 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with an iridescent aura that allows you to take the visage of a creature from the feywild. When you cast the spell, you choose one of the following forms to assume: Fuming, Mirthful, or Tricksy.",
        {
          "type": "entries",
          "name": "Fuming",
          "entries": [
            "Your iridescent aura becomes a fiery aura which empowers you with the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "Your weapon and spell attacks deal an additional {@damage 1d6} fire damage on hit.",
            "You emit bright light out to a range of 30 feet and dim light for an additional 30 feet.",
            "Creatures that hit you with melee attacks take {@damage 1d6} fire damage."
          ]
        },
        {
          "type": "entries",
          "name": "Mirthful",
          "entries": [
            "Your iridescent aura becomes a shimmering sparkle that makes you more appealing, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You have advantage on Charisma ({@skill Persuasion}) checks.",
            "Creatures you choose that can hear you speak must make a Wisdom saving throw or become {@condition charmed} by you until the spell ends, or until you or your allies do something hostile toward them after they were {@condition charmed}.",
            "You have advantage on Charisma saving throws and are immune to being {@condition charmed}."
          ]
        },
        {
          "type": "entries",
          "name": "Tricksy",
          "entries": [
            "Your iridescent aura becomes a shadowy veil, protecting you from sight, granting you the following benefits until the spell ends:"
          ]
        },
        {
          "type": "list",
          "items": [
            "You become {@condition invisible} until the spell ends, or until you make an attack or cast a spell. At the start of each of your turns, you become {@condition invisible} again if you weren't already.",
            "You have advantage on Dexterity and Intelligence saving throws.",
            "If you make an attack roll with advantage, you deal an additional {@damage 1d6} psychic damage on hit."
          ]
        },
        "As a bonus action on your turn, you can shift your form to a different one, losing the previous benefits and gaining the new ones until the spell ends. Doing so halves the current duration of the spell."
      ],
      "conditionInflict": [
        "charmed"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Flames of Avernus",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "cone",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          }
        }
      ],
      "entries": [
        "A wave of heat bursts out of your hands originating from the nine hells, incinerating creatures in a 120-foot cone of fire. Each creature within range makes a Constitution saving throw. On a failed save they take {@damage 20d6} fire damage and are lit on fire for the duration. Creatures who failed take {@damage 5d6} fire damage at the start of each of their turns. As an action, a creature can attempt to put out the flames with a Dexterity ability check against your spell save DC. A creature that attempts this, pass or fail, takes {@damage 2d6} fire damage. On a success, the flames are put out and its effects no longer persist. On a fail, the flames and the spell persists.",
        "On a successful save, the creatures take half the initial damage and are not lit on fire.",
        "A creature who dies while under the effects of the spell has their body immediately turned to scorched ash, leaving behind only any magical items they had in their possession."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Transformation",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "A chunk of rare precious metal worth 1000 gp infused with magical moss, which the spell consumes",
          "consumed": true,
          "cost": 100000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You assume a magical form by mimicking the powers of Gaia. Your body becomes stone and moss forms randomly around your body. Choose either Guardian or Warrior. You gain the following benefits depending on what you chose when you cast the spell:",
        {
          "type": "list",
          "items": [
            "You are immune to poison; bludgeoning, piercing, and slashing damage from non-magical weapons that are not adamantine. You have resistance to slashing, piercing, and bludgeoning damage regardless of the source.",
            "You are immune to the {@condition poisoned} and {@condition petrified} conditions.",
            "Your size becomes one size category larger. If you were gargantuan, you become twice as large. As a result, you deal twice as much damage with weapons against objects.",
            "You have a burrow speed of 40 feet and can move through solid stone effortlessly, leaving the earth untampered with as you pass by.",
            "You have a +2 bonus to AC (Guardian), or you have a +2 bonus to Strength, Dexterity, and Constitution saving throws (Warrior).",
            "All your weapon attacks are magical, and when you make a weapon attack, you can use your spellcasting ability modifier, instead of Strength or Dexterity, for the attack and damage rolls.",
            "You gain 100 temporary hit points (Guardian) or you gain 50 temporary hit points (Warrior). If any of these remain when the spell ends, they are lost.",
            "Your weapon attacks deal an additional {@damage 2d10} bludgeoning damage (Warrior) or when you're not wearing armor, your AC becomes 20. You can still gain the benefits of a shield while under the effects of this spell (Guardian).",
            "(Warrior) You can attack twice, instead of once, when you take the {@action Attack} action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that lets you attack more than once when you take the Attack action on your turn; (Guardian) or you can use your action to form a protective barrier on any number of allies within 30 feet of you, protecting them from damage from one source reducing that damage to 0 (such as a weapon, spell, a dragon's breath weapon, etc.). This barrier lasts until the start of your next turn."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gaia's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 300
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small chunk of a meteorite"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a large object made of stone which appears 200 feet above the point you choose. The stone can take any shape or appearance, so long as it is purely made of a form of earth. The object crashes directly onto the point you choose and creates. Each creature within a 60-foot radius makes a dexterity saving throw or takes {@damage 40d6} bludgeoning damage from the debris, or half as much on a success. ",
        "Objects in the area automatically take twice as much damage. ",
        "A 60-foot radius and 30-foot deep creator is left in the wake of the object, with the object completely destroyed and gravel fills the area, making it difficult terrain"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Gale of The Primordials",
      "source": "TACS",
      "level": 9,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a wing from a powerful creature, such as an angel or winged beast from the elemental plane of air"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "A powerful wind builds up from your feet, granting you unmatched flight. You gain a flying speed of 150 feet for the duration. You take no damage as a result of falling and are immune to being {@condition grappled} or {@condition restrained} as wind rushes from you, preventing anything from keeping hold of you.",
        "Ranged attacks made against you have disadvantage and automatically miss if you are within their long range distance."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Giant's Strength",
      "source": "TACS",
      "level": 2,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a piece of mithral or adamantine worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body, empowering you with the might of giants. If your Strength score is lower than 19, it becomes 19 for the duration. If your strength score is being reduced by any effect, the reduction is still applied."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, your Strength score increases by 2 for every two slot levels above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Glacial Grip",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You release a magical hand made of freezing cold ice toward a creature you can see. Make a ranged spell attack against that creature. On a hit, the hand grasps onto the target and it takes {@damage 1d8} cold damage, and on each of your turns for the duration, you can use a bonus action to deal {@damage 1d8} cold damage to the target automatically, except the turn you cast the spell. Each time the target takes damage from the spell, its speed is reduced by 10 feet. The creature makes a constitution saving throw at the end of each of its turns, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by {@damage 1d8} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT",
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guided Hand",
      "source": "TACS",
      "level": 1,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You touch a creature, granting them the ability to strike true. Once before the spell ends, the target can give themself advantage on one weapon attack roll on their turn, as a spectral hand from a comforting source guides their attack. That attack deals an extra {@damage 1d6} radiant or necrotic damage on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          }
        ]
      }
    },
    {
      "name": "Guise of The Blood Witch",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a vile of humanoid blood engraved with arcane sigils worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Uttering an incantation, you draw on the magic of the blood witch to transform yourself. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "You are immune to being {@condition charmed} and have advantage on saving throws against enchantment spells.",
            "Whenever you take damage from a spell or effect originating from yourself, you can choose to not take damage once on each of your turns.",
            "You have a magical flying speed of 30 feet and you can hover.",
            "You gain 30 temporary hit points. If any of these remain when the spell ends, they are lost.",
            "You can use a bonus action on each of your turns to turn your gaze to a creature you can see within 60 feet. That creature makes a wisdom saving throw or takes {@damage 4d6} necrotic damage and is {@condition frightened} until the spell ends. They take half damage and are not {@condition frightened} on a successful save."
          ]
        }
      ],
      "conditionInflict": [
        "frightened"
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Guise of the Haunted Fey",
      "source": "TACS",
      "level": 0,
      "school": "I",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You veil yourself with haunting lights and illusory sounds, making you look and sound like a horrifying fey creature from the Unseelie court. For the duration, you have advantage on Charisma ({@skill Intimidation}) checks."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Heart Sunder",
      "source": "TACS",
      "level": 4,
      "school": "N",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of blood from a humanoid"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You fill a creature you choose within range that you can see with necrotic energy. You cause their heart to beat rapidly and then stop momentarily. The creature makes a constitution saving throw taking {@damage 8d6} necrotic damage and is {@condition stunned} until the start of your next turn on a failed save, or half as much and is not {@condition stunned} on a success. Undead and Constructs automatically pass the saving throw of this spell."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 and the duration increases by 1 additional round for each slot level above 4th."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "stunned"
      ],
      "savingThrow": [
        "constitution"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Investiture of Water",
      "source": "TACS",
      "level": 6,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "Until the spell ends, your body takes a watery appearance, and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to cold; bludgeoning, piercing, and slashing damage from non-magical attacks.",
            "You have a swim speed of 60 feet and can breathe underwater as you do air.",
            "You are always treated as if you were submerged underwater.",
            "You can use your action to create a 10 foot long whip made of water. You can use a bonus action to attack with the whip. When you do, make a melee spell attack with a range of 10 feet. On hit, the water whip deals {@dice 2d4} plus your spellcasting ability modifier bludgeoning damage and the target makes a Strength saving throw. On a failed save, they are knocked {@condition prone}.",
            "You can use your action to control nearby water to snare your enemies. Choose a creature within 30 feet of a pool of water that is within 120 feet of you. That creature must make a Dexterity saving throw or be {@condition restrained}. You can use a bonus action to drag a creature {@condition restrained} in this way 10 feet closer to the pool. Once the creature is close enough, it can be dragged underneath the pool of water. A creature can use an action to repeat its Strength save, ending the {@condition restrained} effect on a success."
          ]
        }
      ],
      "damageResist": [
        "fire"
      ],
      "damageImmune": [
        "cold"
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "restrained"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "N",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Lightning Spear",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "an electrified twig"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You create a bolt of lightning in your hand and throw it at a creature you can see within range. Make a ranged spell attack, on hit you deal {@damage 3d10} lightning damage."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d10} for each slot level above 2nd. When you cast this spell using a spell slot of 4th level or higher, you can create one additional bolt and throw it at another creature or the same creature, but it only deals {@damage 2d10} lightning damage on hit. When you cast this spell using a spell slot of 7th level or higher, the second bolt increases to {@damage 4d10} damage."
          ]
        }
      ],
      "damageInflict": [
        "lightning"
      ],
      "spellAttack": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      },
      "fluff": {
        "images": [
          {
            "type": "image",
            "href": {
              "type": "external",
              "url": "https://img.game8.co/3498526/93b71a6524daa52afd9d3c4c8136a857.png/show"
            }
          }
        ]
      }
    },
    {
      "name": "Lightning Whip",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You evoke an electrifying whip in your free hand. It is similar in size and shape to an actual whip, and it lasts for the duration. It has the light and reach properties. If you let go of the whip, it disappears, but you can evoke the whip again as a bonus action.",
        "You can use your action to make a melee spell attack with the lightning whip. On a hit, the target takes {@damage 3d4} lightning damage and it must succeed on a Strength saving throw. On a fail, the target is knocked {@condition prone}.",
        "In addition, you can use your bonus action to make a melee spell attack with the lightning whip, however it instead deals {@damage 1d4} lightning damage on hit instead of {@dice 3d4}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@dice 1d4} for every two slot levels above 2nd."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Metronome",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You point at a creature you can see within range and use rhythmic movements to build up momentum and damage them. The target makes a Dexterity saving throw, taking {@damage 6d6} force damage and is marked by the spell on a failed save, or half as much on a success and are not marked. ",
        "While marked, you can use an action or a bonus action to deal {@damage 2d6} force damage to them, but you can only do so once per round and not on the turn you cast the spell. Each time the target takes this damage, they can repeat their save, ending the effect on a success.",
        "After the first round you cast the spell, if you do not use your action or bonus action to deal damage to the target with this spell, your concentration ends early."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ode of Seasons",
      "source": "TACS",
      "level": 1,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument worth at least 50 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a magical song that empowers a target within range (you can choose yourself). Choose from Autumn, Winter, Spring, or Summer. The target gains the following benefits depending on what you chose:",
        {
          "name": "Autumn",
          "type": "entries",
          "entries": [
            "The target has advantage on Charisma ability checks."
          ]
        },
        {
          "name": "Winter",
          "type": "entries",
          "entries": [
            "The target has resistance to cold damage."
          ]
        },
        {
          "name": "Spring",
          "type": "entries",
          "entries": [
            "The target has advantage on saving throws made to resist being {@condition charmed} or {@condition frightened}."
          ]
        },
        {
          "name": "Summer",
          "type": "entries",
          "entries": [
            "The target has resistance to fire damage."
          ]
        }
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or 3rd level, you can maintain your concentration on the spell for up to 1 hour. When you use a spell slot of 4th level or higher, you can maintain your concentration on the spell for up to 8 hours."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Poseidon's Wrath",
      "source": "TACS",
      "level": 9,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "line",
        "distance": {
          "type": "feet",
          "amount": 500
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a wave of immeasurable force in a 500-foot-high, 500-foot-long, 100-foot-thick. Every creature and object in the area makes a Strength saving throw. On a failed save, every creature takes {@damage 12d10} bludgeoning damage and {@damage 12d10} cold damage and are knocked {@condition prone} and pushed to the end of the wave. Objects take twice the amount of damage and automatically fail the save. Creatures that save take only half damage and are pushed only half the distance they normally would be pushed and are not knocked {@condition prone}.",
        "Magical and non-magical fire in the area is immediately extinguished and creatures who took the damage from this spell gains resistance to fire damage for the next minute. Spells that set creatures on fire and persist immediately end on affected creatures.",
        "The area affected is not flooded, as the water dissipates after the spell takes effect."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Primordial Mark",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Magical runes appear on your body and weapons you are holding. Choose from acid, cold, fire, lightning, or thunder. Until the spell ends, your weapon attacks deal an extra {@dice 1d4}  damage of the chosen type on a hit."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Reveal/Conceal",
      "source": "TACS",
      "level": 2,
      "school": "D",
      "time": [
        {
          "number": 1,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a pair of glass lenses with drops of spring water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "permanent",
          "ends": [
            "dispel"
          ]
        }
      ],
      "meta": {
        "ritual": true
      },
      "entries": [
        "For the duration, you can reveal or conceal the presence of magic on objects within range. Choose reveal or conceal and apply the appropriate effect:",
        {
          "type": "entries",
          "name": "Reveal",
          "entries": [
            "You can emanate an aura that reveals whether or not there is magic on every object within range. A magical mark appears on the object if it is magical. The mark that appears resembles the school of magic the object is affected by, otherwise a generic mark is created if there is no specified school of magic. The mark remains so long as it is within range of the aura.",
            "If the object is under the conceal effects of this spell, it is suppressed while it is within range of the aura. If the object is being protected by divination magic, like being under the effects of the {@spell nondetection} spell, make an ability check using your spellcasting ability. The DC equals 10 + the level spell that was used to protect it. If a spell was not used to protect it, the DM determines an appropriate DC. On a successful check, the effect is suppressed while the object is within range of the aura.",
            "You can also reveal a message being hidden by magic, such as from the {@spell illusory script} or the conceal effects of this spell. The message is revealed in a language you understand."
          ]
        },
        {
          "type": "entries",
          "name": "Conceal",
          "entries": [
            "Choose any number of objects within range, if the chosen objects are magical, they become hidden from divination magic. The objects can't be targeted by any divination magic, perceived through magical scrying sensors, and the magic on them cannot be revealed by the effects of divination magic, such as the {@spell detect magic} spell, except by the reveal effects of this spell.",
            "You can also choose to hide text from a non-magical object. Whether this text is written, carved, or magically scribed onto the object, the text becomes {@condition invisible} or is re-written in symbols that have no real meaning.",
            "Any of these effects remains on the objects until dispelled."
          ]
        },
        "The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
      ],
      "areaTags": [
        "MT",
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Fate Weaver",
            "source": "TACS"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Rock Slide",
      "source": "TACS",
      "level": 1,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a small rock"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You conjure a series of falling rocks at a point you can see within range in a 15-foot tall, 15-foot-long, and 5-foot-wide line. Every creature in the line makes a Dexterity saving throw, taking {@damage 3d6} bludgeoning damage and fall {@condition prone} on a failed save, or half as much on a success and are not knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "dexterity"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "L"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Scholar's Armament",
      "source": "TACS",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "s": true,
        "m": "A gemstone worth at least 50 gp and a martial or simple weapon worth at least 1 sp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You imbue magical power into a weapon you are holding. The weapon must have the required gemstone fashioned onto it in some way, whether it is on the pommel or on the blade of the weapon itself. For the duration, you can use your spellcasting ability instead of Strength or Dexterity for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage becomes {@dice 1d4} plus your spellcasting modifier. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "The weapon's damage die becomes a {@dice d6} when you reach 5th level, a {@dice d8} at 11th level, and a {@dice d10} at 17th level."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          },
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Shielding Vitality",
      "source": "TACS",
      "level": 2,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "reaction",
          "condition": "which you take when you or a creature within range would take damage"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You can prevent harm from coming to you or your allies. As a reaction when you or a friendly creature who doesn't have all of its hit points would take damage within range, you can reduce the damage that creature would take by {@damage 1d6} + your spellcasting ability modifier."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Slipstream",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "touch"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a few drops of oil and water"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          }
        }
      ],
      "entries": [
        "You create a low-cresting wave of water that carries the target along the surface of water or the ground. The target's walking speed is increased by 20 feet until the spell ends. In addition, swimming does not cost the target any additional movement. If the target had a swim speed, it is increased by 30 feet until the spell ends."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Courage",
      "source": "TACS",
      "level": 1,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 20
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power to rally you and your allies within range with courage. For the duration, you and every willing ally within range that is not {@condition deafened} has advantage on saving throws made to avoid or end the {@condition frightened} condition, also they gain a +1 bonus to attack rolls."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the bonus increases to +2, creatures within range are immune to being {@condition frightened}, and their weapon attacks are treated as magical if they weren't already. When you use a spell slot of 5th level or higher, the bonus increases to +3 and creatures within range are immune to being {@condition charmed}."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Song of Misdirection",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a musical instrument"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You perform a song of power that misdirects your enemies and forces them to focus their attention toward yourself or another creature. Choose a creature within range that you can see (you can choose yourself), up to three creatures you choose within 20 feet of the initial target must make a Wisdom saving throw, regarding the initial target as hostile and the most dangerous threat on a failed save. If the initial target was well-known or friendly to the chosen creatures affected by the spell, they have advantage on the save.",
        "While under the effects of the spell, they are compelled to target the chosen creature with any and all attacks and spells they can utilize. An example of the compulsion could be that they believe that the target has a bounty on their head with a very high reward, but it is up to the DM to determine a proper reason why they would be compelled by the spell. At the end of an affected creature's turn, they can repeat their Wisdom save, ending the effect on a success. The spell ends early if the initial target is reduced to 0 hit points or dies.",
        "A creature is immune to the effects of the spell if they are immune to being {@condition charmed}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, you can choose one additional creature to make a save against the spell for each slot level above 2nd. When you cast this spell using a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. Using a spell slot of 8th level or higher grants a duration that doesn't require concentration."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Static Discharge",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        },
        {
          "number": 1,
          "unit": "round"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 15
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a copper rod"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Electric energy builds up within you and you release it outward in a powerful burst of energy. Each creature (except yourself) within range makes a Dexterity saving throw, taking {@damage 3d8} lightning damage  and is {@condition stunned} until the end of your next turn on a failed save, or half as much on a success and is not {@condition stunned}.",
        "Rather than using it's normal casting time, you can instead spend your entire turn building up energy and cast it immediately at the start of your next turn, taking up your action for your next turn. When you do so, creatures have disadvantage on the saving throw and you add two additional damage dice. In addition, the radius is increased by an additional 5 feet. See 'Longer Casting Times' on page 202 of the Player's Handbook for reference on casting a spell for longer than 1 action.",
        "Charging the spell leaves you fatigued for a time. You gain one level of {@condition exhaustion} for {@dice 1d4} rounds."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above 2nd."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Static Smite",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "The first time you hit with a melee weapon attack during this spell's duration, your weapon crackles with electricity, and the attack deals an extra {@damage 1d10} lightning damage. Additionally, if the target is a creature, it must succeed a Constitution saving throw or be {@condition incapacitated} until the start of your next turn."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "incapacitated"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Paladin",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Suffocating Sphere",
      "source": "TACS",
      "level": 8,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        },
        {
          "type": "special"
        }
      ],
      "entries": [
        "You attempt to draw the air out of a creature you can see within range. A creature is unaffected by the spell if it does not need to breathe. The creature makes a Constitution saving throw. On a failed save, the creature immediately starts to suffocate and begins choking. It can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). After the previously mentioned rounds have passed, at the start of its next turn, it drops to 0 hit points and is dying, and it can't regain hit points or be stabilized until it can breathe again.",
        "At the end of every round before it is reduced to 0 hit points, the creature can repeat its Constitution saving throw, ending the spell on a success. Once the creature is reduced to 0 hit points, you concentrate on the spell until the creature dies or until the duration ends."
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Summon Vengeful Spirit",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 90
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": {
          "text": "humanoid blood inside a precious diamond worth at least 600 gp",
          "cost": 60000
        }
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You call forth a vengeful spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Vengeance Spirit stat block. When you cast the spell, choose Slain, Cursed, or Betrayed. The creature resembles a vengeful spirit of the chosen type, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.",
        "The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the {@action Dodge} action and uses its move to avoid danger."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell's level appears in the stat block."
          ]
        }
      ],
      "miscTags": [
        "SGT",
        "SMN"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Symphony of Law and Chaos",
      "source": "TACS",
      "level": 7,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "m": "A musical instrument with clockwork and gears on it worth at least 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You begin performing a powerful symphony which empowers you with the planes of law or chaos (your choice), your movements as rhythmic as clockwork. You gain the following benefits until the spell ends:",
        {
          "type": "list",
          "items": [
            "Your walking speed increases by 30 feet.",
            "You are immune to poison damage  and have immunity to the {@condition poisoned} condition.",
            "Clockwork wings appear on your back, giving you a flying speed of 50 feet and you can hover.",
            "You are immune to the {@condition paralyzed}, {@condition stunned}, {@condition grappled}, and {@condition restrained} conditions (Chaos) or when you deal damage with a weapon or spell, that creature is also {@condition restrained} by clockwork contraptions until the end of your next turn (Law).",
            "When you deal damage to a creature with a weapon or a spell, you can deal an additional {@damage 2d10} psychic damage to one of the damage rolls (Chaos) or an additional {@damage 2d10} force damage to one of the damage rolls (Law)."
          ]
        }
      ],
      "conditionInflict": [
        "restrained"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Thunderstomp",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "You stomp your foot or strike your weapon against the ground, creating a ripple of power that you can use to knock down your foes. Choose a creature within range, that creature must make a Strength saving throw or fall {@condition prone} and take {@damage 4d6} thunder damage, or half as much on a success and are not knocked {@condition prone}. You and the creature must be on the same solid surface, otherwise the spell fails."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by {@dice 1d6} for each slot level above 1st."
          ]
        }
      ],
      "conditionInflict": [
        "prone"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Unseelie Moon",
      "source": "TACS",
      "level": 3,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "radius",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "teardrops of a fey from the unseelie court"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You create a small moon, which hovers around you, that emanates a dark blue hue. When you cast the spell, and as an action on subsequent turns, you can launch a freezing ray of light from the moon toward a creature you can see within range. Make a ranged spell attack. On hit, the ray deals {@damage 4d8} cold damage and the target's speed is reduced by 10 feet until the start of your next turn.",
        "While the moon hovers around you, magical darkness within the area of the spell is treated as regular darkness."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, you can fire an additional ray from the moon for every two slot levels above 3rd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "spellAttack": [
        "R"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Ranger",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Vile Mark",
      "source": "TACS",
      "level": 2,
      "school": "E",
      "subschools": [
        "hemomancy"
      ],
      "time": [
        {
          "number": 1,
          "unit": "bonus"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a drop of humanoid blood"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "You bestow a vile curse onto a creature you can see within range, making them more susceptible to damage for the duration of the spell. The affected creature is {@condition poisoned} and once every turn, whenever an affected creature takes damage, they take an additional {@damage 2d4} necrotic damage to one of the damage rolls of the source. A creature still suffers the damage even if they are immune to being {@condition poisoned}.",
        "An affected creature can make a Constitution saving throw at the end of each of their turns, ending the spell on a success. The spell can also be ended early with a {@spell Remove Curse}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for every two slot levels above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "necrotic"
      ],
      "conditionInflict": [
        "poisoned"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Ward of Vitality",
      "source": "TACS",
      "level": 4,
      "school": "A",
      "time": [
        {
          "number": 10,
          "unit": "minute"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a trinket or holy symbol made of gold or silver worth 500 gp"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 8
          }
        }
      ],
      "entries": [
        "For the duration, up to eight willing creatures gain 20 temporary hit points. If any of these remain when the spell ends, they are lost. While they have these temporary hit points, they have advantage on Constitution and Wisdom saving throws and their hit point maximum cannot be reduced."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 5th level or higher, the temporary hit points gained is increased by 10 for each slot level above 4th."
          ]
        }
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Bard",
            "source": "PHB"
          },
          {
            "name": "Cleric",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Paladin",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Warding Mark",
      "source": "TACS",
      "level": 0,
      "school": "A",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "round",
            "amount": 1,
            "upTo": true
          }
        }
      ],
      "entries": [
        "You create a small rune which emits a barrier which can potentially protect you from a single attack. Until the start of your next turn, you have +1 bonus to your AC against the next attack targeted at you."
      ],
      "miscTags": [
        "MAC"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Artificer",
            "source": "TCE"
          }
        ]
      }
    },
    {
      "name": "Water Splash",
      "source": "TACS",
      "level": 0,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Each creature in a 5-foot radius of a point you choose within range makes a Strength saving throw. On a failed save, they take {@damage 1d4} bludgeoning damage and are pushed 5 feet away from the center.",
        "This spell's damage increases by {@dice 1d4} when you reach 5th level ({@dice 2d4}), 11th level ({@dice 3d4}), and 17th level ({@dice 4d4})."
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "savingThrow": [
        "strength"
      ],
      "areaTags": [
        "S"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Water Whack",
      "source": "TACS",
      "level": 1,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 10
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a cup of water"
      },
      "duration": [
        {
          "type": "instant"
        }
      ],
      "entries": [
        "Water wraps around your hand and you wave it at a creature, slamming it into them. Make a melee spell attack against a creature within range. On hit, the target takes {@damage 2d10} bludgeoning damage and makes a Strength saving throw. On a failed save, they pushed back 5 feet and are knocked {@condition prone}."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 2nd or higher level, the damage increases by {@dice 1d10} for each slot level above 1st."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "spellAttack": [
        "R"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Weightless Form",
      "source": "TACS",
      "level": 4,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "self"
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a tiny feather"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 10
          },
          "concentration": true
        }
      ],
      "entries": [
        "You become lighter than a feather. You and everything you are wearing and carrying become completely weightless, removing your tether from gravity. If you stop wearing or carrying an object, they regain their weight.",
        "For the duration, you have a magical flying speed equal to your walking speed and can hover. In addition, you are immune to being {@condition prone} as you float back onto your feet at the cost of no movement and take no damage as a result from falling. Anytime you are hit by an attack, you are pushed back 10 feet away from the attacker.",
        "If you are still flying when the spell ends, you safely descend at a rate of 60 feet per round until you touch the ground."
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Warlock",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Whelm",
      "source": "TACS",
      "level": 2,
      "school": "C",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 60
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "A vile filled with water from a waterfall"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "You conjure an overwhelming amount of water that crashes onto a creature you can see within range with crushing force. That creature must make a Strength saving throw, or fall {@condition prone} and are {@condition restrained}. A flying creature is forced to the ground, but only takes half the normal amount of fall damage they would have received. At the start of each of the target's turns it takes {@dice 1d10} points of bludgeoning damage. At the end of the creature's turns it can repeat its saving throw, ending the spell on a success."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd or higher level, the damage increases by {@dice 1d10} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "bludgeoning"
      ],
      "conditionInflict": [
        "prone"
      ],
      "savingThrow": [
        "strength"
      ],
      "miscTags": [
        "SCL"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Wizard",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          },
          {
            "name": "Sorcerer",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Winter's Grasp",
      "source": "TACS",
      "level": 2,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 120
        }
      },
      "components": {
        "v": true,
        "s": true,
        "m": "a frozen monster claw"
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1,
            "upTo": true
          },
          "concentration": true
        }
      ],
      "entries": [
        "Ice encrusts the ground radiating a powerful cold energy in a 15 foot radius, making it hard for creatures to maintain their balance. This icy ground is treated as difficult terrain. A creature that begins its turn in the affected area takes {@damage 2d6} cold damage and makes a dexterity saving throw. On a failed save, they fall {@condition prone}. At the end of their turns, they make a constitution saving throw. On a successful save, they become immune to the spell's effects.",
        "The cold freezes nonmagical liquids in the area that aren't being worn or carried."
      ],
      "entriesHigherLevel": [
        {
          "name": "At Higher Levels",
          "entries": [
            "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@damage 1d6} for each slot level above 2nd."
          ]
        }
      ],
      "damageInflict": [
        "cold"
      ],
      "savingThrow": [
        "dexterity",
        "constitution"
      ],
      "miscTags": [
        "SCL"
      ],
      "areaTags": [
        "R"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    },
    {
      "name": "Yeti's Chilling Gaze",
      "source": "TACS",
      "level": 4,
      "school": "V",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "v": true,
        "s": true
      },
      "duration": [
        {
          "type": "timed",
          "duration": {
            "type": "minute",
            "amount": 1
          },
          "concentration": true
        }
      ],
      "entries": [
        "Choose a creature that you can see within range. The target must succeed on a Constitution saving throw or take {@damage 3d6} cold damage and is {@condition paralyzed} for the duration, unless the target is resistant or immune to cold damage. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target. If a creature passes their save against this spell, they are immune to its effects for 1 hour."
      ],
      "damageInflict": [
        "cold"
      ],
      "conditionInflict": [
        "paralyzed"
      ],
      "savingThrow": [
        "constitution"
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "ST"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "Sorcerer",
            "source": "PHB"
          },
          {
            "name": "Druid",
            "source": "PHB"
          }
        ]
      }
    }
  ],
  "optionalfeature": [
    {
      "source": "TACS",
      "name": "Pact of the Blade",
      "entries": [
        "You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it (see chapter 5 for weapon options). You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. Moreover, when you attack with that weapon, you can use your Charisma modifier, instead of Strength or Dexterity, for the attack and damage rolls.",
        "Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.",
        "You can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks."
      ],
      "featureType": [
        "PB"
      ]
    },
    {
      "name": "Pact of The Vial",
      "source": "TACS",
      "featureType": [
        "PB"
      ],
      "entries": [
        "Your patron grants you a small glass vial, droplets of your blood and the essence of your patron are mixed within it. This magical vial has many magical properties and serves like an Arcane Focus. You can use your action to summon the vial into an empty hand. The vial disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the vial (no action required), or if you die.",
        "When you form this magical vial, choose either your spell attack or spell save DC. You gain a +1 bonus to whichever benefit you chose when you use the vial as an arcane focus. You can change this benefit by performing a 10 minute ritual during a long rest and the new benefit takes effect once you complete the long rest.",
        "In addition, choose one of the warlock spells that you know that is of a level no higher than half of your proficiency bonus (rounded up). You can store that spell into your Vial and cast it at its lowest level without expending a spell slot or requiring material components. The spell you store in the vial cannot require any costly materials. Every time you cast the spell, you take 1d8 points of damage per level of the spell as you spend your own vitality to cast the spell. When you cast the spell, the vial momentarily fills with your own blood and empties again after the spell is cast, leaving only the droplets of blood from when the blood pact was made.",
        "You can cast the spell within the vial a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Life Draining Blast",
      "source": "TACS",
      "page": null,
      "featureType": [
        "EI"
      ],
      "prerequisite": [
        {
          "spell": [
            "eldritch blast#c"
          ]
        },
        {
          "level": {
            "level": 7,
            "class": {
              "name": "Warlock"
            }
          }
        }
      ],
      "entries": [
        "When you hit at least one creature with {@spell eldritch blast} on your turn, you can gain a number of temporary hit points equal to one of the damage rolls. You can gain this benefit once a round."
      ]
    },
    {
      "name": "Improved Pact Vial",
      "source": "TACS",
      "page": null,
      "featureType": [
        "EI"
      ],
      "prerequisite": [
        {
          "pact": "Vial"
        }
      ],
      "entries": [
        "The benefit you receive to either your spell attack or spell save DC now applies to both when you use the vial as an arcane focus.",
        "In addition, you can choose one cantrip from the Warlock spell list and store it within the vial, allowing you to cast that cantrip whenever you use the vial as an arcane focus."
      ]
    },
    {
      "name": "Scorching Blood",
      "source": "TACS",
      "page": null,
      "featureType": [
        "EI"
      ],
      "prerequisite": [
        {
          "pact": "Vial"
        }
      ],
      "entries": [
        "While you have your pact vial out, you can cast {@spell Hellish Rebuke|PHB} as a 3rd level spell without expending a spell slot. Once you do so, you cannot do so again until you finish a long rest."
      ]
    },
    {
      "name": "Chilling Blast",
      "source": "TACS",
      "page": null,
      "featureType": [
        "EI"
      ],
      "prerequisite": [
        {
          "spell": [
            "eldritch blast#c"
          ]
        },
        {
          "level": {
            "level": 12,
            "class": {
              "name": "Warlock"
            }
          }
        }
      ],
      "entries": [
        "Once on each of your turns when you hit a creature with {@spell eldritch blast} on your turn, that creature cannot gain the benefits of healing until the start of your next turn."
      ]
    },
    {
      "name": "Life Giver",
      "source": "TACS",
      "page": null,
      "featureType": [
        "EI"
      ],
      "prerequisite": [
        {
          "level": {
            "level": 15,
            "class": {
              "name": "Warlock"
            }
          }
        }
      ],
      "entries": [
        "You can cast {@spell Life Transference|XGE} without expending a spell slot a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.",
        "In addition, you can cast {@spell Raise Dead|PHB} once without requiring material components or spending a spell slot, regaining the ability to do so again when you finish a long rest. When you cast the spell in this way, you are reduced to one hit point and you gain one level of exhaustion."
      ]
    }
  ]
}