{
  "meta": {
    "sources": [
      {
        "json": "RBE",
        "abbreviation": "RBE",
        "full": "Ragnarok - The Blade of Beginning and End",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "url": "https://docs.google.com/document/d/1fEve8G2oOKYVzp30EoK7O6k-HJ7pL8jwBex8GE0ucjU/edit?usp=sharing",
        "version": "1.0",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1590749501,
    "dateLastModified": 1590749501
  },
  "item": [
    {
      "name": "Ragnarok - The Blade of Beginning and End",
      "source": "RBE",
      "page": 1,
      "baseItem": "katana",
      "type": "M",
      "rarity": "artifact",
      "reqAttune": true,
      "sentient": true,
      "weight": 3,
      "weaponCategory": "martial",
      "property": [
        "T",
        "F",
        "V"
      ],
      "range": "40/80",
      "dmg1": "1d8",
      "dmg2": "1d10",
      "dmgType": "S",
      "bonusWeapon": "+1",
      "weapon": true,
      "entries": [
        "A powerful hum can be heard from the weapon. A creature that meditates infront of the blade will hear the ambience of a thunderstorm, and may even see visions of a powerful hero that now lies dormant within the blade. The blade itself radiates electricity with the might of a dragon.",
        {
          "type": "entries",
          "name": "Spirit of Ragnarok",
          "entries": [
            "A voice can be heard from the blade from time to time. While attuned with the weapon you can communicate with the spirit inside the blade, Ragnarok. Ragnarok is a genius with magic, and knows just about anything about it. No matter how hard, rare, or impossible the magic may be to know, he knows about it to some degree. Though, unless absolutely necessary he will not share all of his knowledge. The most cursed of magic he’ll keep to himself unless encountered with it, or if a weakness needs to be known. Ragnarok is kind and benevolent. If he finds that his wielder becomes tainted or cursed, he will ensure that they either become pure again, or grants them a swift painless death so they no longer suffer from the sins they would regret later in life.",
            "The weapon communicates telepathically with its wielder and can speak, read, and understand Common, Draconic, and Primordial."
          ]
        },
        {
          "type": "entries",
          "name": "Hero's Soul",
          "entries": [
            "A creature attuned with this weapon becomes Lawful Good and Pure of Heart. The creature is not lawful in the sense of “man-made” laws, but more so on the laws of all life. Everything has a beginning and an end, but no one’s end should come early. You are the protector of life, and vanquisher of evil. Those who kill and destroy, those who take from those more in need should not go without punishment. Most importantly, you protect those who cannot protect themselves."
          ]
        },
        {
          "type": "entries",
          "name": "Dormant",
          "entries": [
            "The katana grants the following benefits in its dormant state:",
            {
              "type": "list",
              "items": [
                "You can speak, read, and write Auran and Draconic.",
                "You gain a +1 bonus to attack and damage rolls made with this magic weapon, and it deals an extra 1d8 lightning damage to any target it hits. Immediately after you make a ranged attack with this weapon, it flies back to your hand. You can also call the weapon using a bonus action.",
                "As a reaction, whenever you are targeted by a spell, magical effect, or attack (not originating from you) that would deal lightning damage, you can instead reduce that damage to 0, and regain hit points equal to the original amount. This property can’t be used again until the next dawn.",
                "You can spend an action to cast the fly spell. This property cannot be used again until the next dawn."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "name": "Awakened",
          "entries": [
            "When the katana reaches an awakened state, it gains the following properties:",
            {
              "type": "list",
              "items": [
                "The weapon's bonus to attack and damage rolls increases to +2, and the extra lightning damage dealt by the weapon increases to 2d8.",
                "The lightning absorption property can be used twice before the next dawn.",
                "When you throw the katana and speak a command word, it transforms into a bolt of lightning, forming a line 5 feet wide that extends out from you to a creature you can see within 120 feet of you. Each creature in the line, excluding you, must make a DC 15 Dexterity saving throw, taking 10d8 lightning damage on a failed save, or half as much damage on a successful one. Ragnarok then returns to your hand. This property can't be used again until the next dawn.",
                "While holding the katana, you can use an action to cast one of the following spells from it (save DC 15, +7 to hit): {@spell lightning bolt} (6th level), {@spell chain lightning}, {spell storm sphere}, or {spell call lightning} (6th level). Once a spell has been cast using the katana, that spell can't be cast from the katana again until the next dawn."
              ]
            }
          ]
        },
        {
          "type": "entries",
          "name": "Exalted",
          "entries": [
            "When the katana reaches an exalted state, it gains the following properties:",
            {
              "type": "list",
              "items": [
                "The weapon's bonus to attack and damage rolls increases to +3.",
                "The lightning absorption property can be used three times before the next dawn.",
                "The saving throw DC for the weapon's special actions and spells cast from the weapon increases to 17 and the spell attack becomes + 9.",
                "While holding the katana, you can use an action to cast one of the following spells from it (save DC 17): control weather, storm of vengeance. Once you have cast either of these spells, they cannot be cast again until the next dawn."
              ]
            }
          ]
        },
        {
          "type": "inset",
          "name": "Artifact Properties",
          "entries": [
            "While attuned to Ragnarok in its dormant state, the wierlder gains two {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial} properties and one {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial} property. When the artifact attains an awakened state, it gains an additional {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial} property. When the item reaches its exalted state, it gains a {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial} property. See \"Artifact Properties\" in chapter 7 of the Dungeon Master's Guide for more information."
          ]
        }
      ]
    }
  ]
}