{
  "_meta": {
    "sources": [
      {
        "json": "EBoDF",
        "abbreviation": "EBoDF",
        "full": "Erikku's Book of Draconic Feats",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "version": "1.0",
        "url": "",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1603862723,
    "dateLastModified": ""
  },
  "feat": [
    {
      "name": "Draconic Adept",
      "source": "EBoDF",
      "entries": [
        "Studying old and powerful dragons, you’ve uncovered strange but powerful abilities. Could this be the power of dragons, is this truly remnants of the abilities these great wyrms would procure? You learn one Draconian Power option of your choice from the dragon warrior and dragon shaman classes. If the power has a prerequisite, you can choose that power only if you're a dragon warrior or dragon shaman and only if you meet the prerequisite.",
        "Whenever you gain a level, you can replace the draconian power with another one from the dragon warrior and dragon shaman classes."
      ]
    },
    {
      "name": "Draconic Herald",
      "source": "EBoDF",
      "prerequisite": [
        {
          "other": "Draconic Adept"
        }
      ],
      "entries": [
        "Continuing your study of dragons, you’ve learned about all kinds of powerful wyrms and why they are so feared. You learn an additional Draconian Power option of your choice from the dragon warrior and dragon shaman classes. If the power has a prerequisite, you can choose that power only if you're a dragon warrior or dragon shaman and only if you meet the prerequisite.",
        "In addition to this power, you have advantage on Charisma ability checks made to influence dragons. This could be interpreted as inducing fear, trying to persuade a dragon to spare you or your companions, or even seek aid from a dragon."
      ]
    },
    {
      "name": "Dragon Slayer",
      "source": "EBoDF",
      "entries": [
        "Through your studies of dragons, you’ve discovered their weaknesses and can exploit them on a whim. You have advantage on saving throws against a dragon’s breath weapon, and when you successfully save against it, you can use a reaction to take no damage instead.",
        "In addition, whenever you hit a dragon with an attack using a weapon, you can treat a 19 on the d20 as a critical hit. If you already consider a 19 on the d20 as a critical hit, you instead treat an 18 as a critical hit."
      ]
    }
  ]
}