{
  "_meta": {
    "sources": [
      {
        "json": "ErikkusHeroicFeats",
        "abbreviation": "EHF",
        "full": "Erikku's Heroic Feats",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "version": "1.0.0",
        "url": "",
        "targetSchema": "1.1.2"
      }
    ],
    "dateAdded": 1589496575,
    "dateLastModified": 1589496575
  },
  "feat": [
    {
      "name": "Dedicated Hero",
      "source": "ErikkusHeroicFeats",
      "prerequisite": [
        {
          "other": [
            {
              "name": "any good alignment"
            }
          ]
        }
      ],
      "entries": [
        "Through your sheer willpower and dedication to save others you can make miracles happen. ",
        {
          "type": "list",
          "items": [
            "You can't be surprised while you are conscious.",
            "Whenever you would roll to stabilize a creature to prevent them from dying, you have advantage on the roll.",
            "When a creature would be hit by a weapon or spell attack, and that creature is within the remaining distance of twice your movement as of the end of your last turn, you can spend your reaction to take the creature's space, moving them to a space adjacent to you. You become the target for the attack, and all incoming attacks from that source thereafter. This movement does not provoke attacks of oppurtunity. If the attack would hit, it is treated as a critical hit.",
            "When a creature would be subjected to a constitution, dexterity, or strength saving throw, and that creature is within the remaining distance of twice your movement as of the end of your last turn, you can spend your reaction to take the creature's space, moving them to a space adjacent to you. This movement does not provoke attacks of oppurtunity. You shield them from the effects of the spell making yourself the main target of the spell. You suffer disadvantage on the saving throw of the spell and take twice the amount of damage you would ordinarily take, if any. If the spell would affect multiple creatures, you choose one creature to shield."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "dex",
              "con",
              "int",
              "wis",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Heroic Presence",
      "source": "ErikkusHeroicFeats",
      "prerequisite": [
        {
          "other": [
            {
              "name": "any good alignment"
            }
          ]
        }
      ],
      "entries": [
        "You stand as a paragon for the people, heroic and brave till the moment you draw your last breath. While you are concious, you have advantage on saving throws against being charmed or frightened.",
        "You can spend an action on your turn to end a charmed or frightened condition. Once you do so, you cannot do so again until you finish a short or long rest."
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Heroic Determination",
      "source": "ErikkusHeroicFeats",
      "prerequisite": [
        {
          "other": [
            {
              "name": "any good alignment"
            }
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ],
      "entries": [
        "You've been through hell and back, your will to survive is complimented by your heroic nature.",
        {
          "type": "list",
          "items": [
            "Whenever you would fall to 0 hit points, but are not outright killed, you can do one of the following:",
            "You can spend your reaction to remain at 1 hit point instead. Once you do so, you cannot do so again until you finish a short or long rest.",
            "You can expend any of your remaining hit dice, you gain an amount of temporary hit points equal to the result."
          ]
        }
      ]
    }
  ]
}