{
  "_meta": {
    "sources": [
      {
        "json": "DrM",
        "abbreviation": "DrM",
        "full": "Dragon Mage",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "CrimtaneCreeper",
          "Erikku Blade"
        ],
        "version": "2.2",
        "url": "https://docs.google.com/document/d/1gg_4wnR21KBbeJvadNxKl2ehRrCwRldmPI8EV7Uj6Wo/edit?usp=sharing",
        "targetSchema": "1.0.0"
      }
    ]
  },
  "class": [
    {
      "name": "Dragon Mage",
      "source": "DrM",
      "hd": {
        "number": 1,
        "faces": 8
      },
      "proficiency": [
        "int",
        "cha"
      ],
      "classTableGroups": [
        {
          "colLabels": [
            "Cantrips Known",
            "Draconian Powers"
          ],
          "rows": [
            [
              3,
              "-"
            ],
            [
              3,
              3
            ],
            [
              3,
              3
            ],
            [
              4,
              4
            ],
            [
              4,
              4
            ],
            [
              4,
              5
            ],
            [
              4,
              5
            ],
            [
              4,
              6
            ],
            [
              5,
              6
            ],
            [
              5,
              7
            ],
            [
              5,
              7
            ],
            [
              5,
              8
            ],
            [
              5,
              8
            ],
            [
              6,
              9
            ],
            [
              6,
              9
            ],
            [
              6,
              10
            ],
            [
              6,
              10
            ],
            [
              6,
              11
            ],
            [
              6,
              11
            ],
            [
              6,
              12
            ]
          ]
        },
        {
          "title": "Spell Slots per Spell Level",
          "colLabels": [
            "{@filter 1st|spells|level=1|class=Dragon Mage (DrM)}",
            "{@filter 2nd|spells|level=2|class=Dragon Mage (DrM)}",
            "{@filter 3rd|spells|level=3|class=Dragon Mage (DrM)}",
            "{@filter 4th|spells|level=4|class=Dragon Mage (DrM)}",
            "{@filter 5th|spells|level=5|class=Dragon Mage (DrM)}",
            "{@filter 6th|spells|level=6|class=Dragon Mage (DrM)}",
            "{@filter 7th|spells|level=7|class=Dragon Mage (DrM)}",
            "{@filter 8th|spells|level=8|class=Dragon Mage (DrM)}",
            "{@filter 9th|spells|level=9|class=Dragon Mage (DrM)}"
          ],
          "rows": [
            [
              2,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              3,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              2,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              2,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              "-",
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              1,
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              2,
              "-",
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              1,
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              "-",
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              "-",
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              "-",
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              "-"
            ],
            [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              1,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              2,
              1,
              1,
              1
            ],
            [
              4,
              3,
              3,
              3,
              3,
              2,
              2,
              1,
              1
            ]
          ]
        }
      ],
      "startingProficiencies": {
        "armor": [],
        "weapons": [
          "Daggers",
          "Darts",
          "Slings",
          "Quarterstaffs"
        ],
        "tools": [
          "Choose 1 Artisan's Tools"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "Arcana",
                "Deception",
                "History",
                "Insight",
                "Intimidation",
                "Investigation",
                "Medicine",
                "Nature",
                "Persuasion",
                "Religion"
              ],
              "count": 3
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) 1 arcane focus or (b) 1 component pouch",
          "(a) explorer's pack or (b) scholar's pack",
          "(a) 2 daggers or (b) 1 sling and a bag of sling ammunition",
          "(a) 1 set of artisan's tools"
        ],
        "goldAlternative": "5d4x10"
      },
      "multiclassing": {
        "requirements": {
          "or": [
            {
              "cha": 13,
              "int": 13
            }
          ]
        },
        "proficienciesGained": {}
      },
      "classFeatures": [
        [
          {
            "name": "Spellcasting",
            "entries": [
              "Drawing on the ancient powers of dragons, you can cast spells to shape that essence to your will and express your prowess with the arcane over all others",
              {
                "type": "entries",
                "name": "Cantrips",
                "entries": [
                  "At 1st level, you know three cantrips of your choice from your available spell lists based on your Draconian Origin. You learn additional Dragon Mage cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Dragon Mage table."
                ]
              },
              {
                "type": "entries",
                "name": "Preparing and Casting Spells",
                "entries": [
                  "The Dragon Mage table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these Dragon Mage spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
                  "You prepare the list of Dragon Mage spells that are available for you to cast, choosing from the Dragon Mage spell list. When you do so, choose a number of Dragon Mage spells equal to your Spell Casting Ability modifier + your Dragon Mage level (minimum of one spell). The spells must be of a level for which you have spell slots.",
                  "For example, if you are a 3rd-level Dragon Mage, you have four 1st-level and two 2nd-level spell slots. With a Spellcasting Ability of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Burning Hands, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells."
                ]
              },
              {
                "type": "entries",
                "name": "Spellcasting Ability",
                "entries": [
                  "Charisma or Intelligence of your choosing is your spellcasting ability for your Dragon Mage spells, since your magic can draw from the soul of a Dragon and can naturally grow stronger or you can study the arcane and master it through your wits alone. You use one of these abilities whenever a spell refers to your spellcasting ability. In addition, you use your spellcasting ability modifier when setting the saving throw DC for a Dragon Mage spell you cast and when making an attack roll with one.",
                  {
                    "type": "abilityDc",
                    "name": "Spell",
                    "attributes": [
                      "int",
                      "cha"
                    ]
                  },
                  {
                    "type": "abilityAttackMod",
                    "name": "Spell",
                    "attributes": [
                      "int",
                      "cha"
                    ]
                  }
                ]
              },
              {
                "type": "entries",
                "name": "Ritual Casting",
                "entries": [
                  "You can cast a Dragon Mage spell as a ritual if that spell has the ritual tag and you have the spell prepared."
                ]
              },
              {
                "type": "entries",
                "name": "Spellcasting Focus",
                "entries": [
                  "You can use an arcane focus or a component as a spellcasting focus for your Dragon Mage spells."
                ]
              }
            ]
          },
          {
            "name": "Draconian Origins",
            "entries": [
              "Beginning at 1st Level you choose one chromatic or metallic dragon; this color dragon will be where your power comes from. You gain features depending on this color. In addition you gain a Spellcasting List depending on the color chosen. You are also able to speak, read, and write Draconic. Some of your Draconian Abilities will require a saving throw, the DC for that will equal your Spell Save DC.",
              {
                "type": "options",
                "entries": [
                  {
                    "type": "entries",
                    "name": "Red",
                    "entries": [
                      "You have resistance to fire damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that deals fire damage, each creature that suffers the effects of the spell must make a Constitution Saving Throw. On a failed save, the creature will be wreathed in flames that will deal fire damage equal to your spellcasting ability modifier at the start of each of their turns for 1 minute. They can repeat their saving throws at the end of each of their turns, ending the effect on a success. A creature can spend their action putting out the flames, ending the effect early."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Blue",
                    "entries": [
                      "You have resistance to lightning damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that deals lightning damage, you gain an additional 10 ft. to your movement speed and your movement does not provoke attacks of opportunity each of these effects ending at the end of your turn. Additionally each creature that suffers the effects of the spell must make a Constitution Saving Throw or be stunned until the end of your next turn."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Green",
                    "entries": [
                      "You have resistance to poison damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that would deal poison damage, each creature that suffers the effects of the spell must make a Constitution Saving Throw. On a failed save, the creature is poisoned for 1 minute. While poisoned in this way, the creature suffers a -2 to AC and a -10 ft. to its movement speed."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Black",
                    "entries": [
                      "You have resistance to acid damage, at 10th level this becomes immunity. Whenever you cast a spell of 1st level or higher that would deal acid damage, each creature that suffers the effects of the spell must make a Dexterity Saving Throw. On a failed save you can choose either any non-magical armor or a non-magical weapon they are carrying, roll a d100 to determine what happens to said selected item. The higher stages inherit the lower stages’ effects. ",
                      "1-10 : The item is damaged, the next time they crit fail to attack or a critical hit is imposed onto them  the item will break. 11-20 : The item receives a -2 penalty to either AC or to Attack Rolls. 21-30 : The item becomes unwieldy, giving them disadvantage on ability checks while holding the weapon or wearing the armor. 31-40 : The target has disadvantage on attack rolls while wielding the weapon, or disadvantage on saving throws while wearing the armor. 41-50 : While the item is equipped they suffer a -2 penalty to damage rolls. 51-60 : While the item is equipped they have disadvantage on Constitution Saving Throws. 61-70 : While the item is equipped they take 1d6 acid damage at the start of their turns. 71-80 : In 1 minute, the item will be destroyed as it melts away by the acid. 81-90 : In 30 seconds, the item will snap in two, becoming either an improvised weapon, or unusable armor. 91-100 : The item is instantly destroyed and they take 4d6 acid damage."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "White",
                    "entries": [
                      "You have resistance to cold damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals cold damage, you gain 10 temporary hit points until the start of your next turn. Each creature that suffers the effects of the spell must make a Dexterity Saving Throw, on a failed save they are coated with ice, making their movement speed 0 and their attack rolls are made at a disadvantage until the start of your next turn. If they were in mid flight and failed the save, they fall to the ground and take fall damage as per normal."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Copper",
                    "entries": [
                      "You have resistance to acid damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals acid damage, the ground beneath you in a 15 ft radius becomes difficult terrain. While a creature other than yourself moves within this terrain they take 1d6 acid damage for every 5ft they move."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Bronze",
                    "entries": [
                      "You have resistance to lightning damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals lightning damage, a burst of electricity blasts out from your hands in a 15 ft radius sphere. Each creature within the sphere, excluding yourself, takes 1d6 lightning damage and must make a Strength Saving Throw. On a failed save they are pushed back 15 ft."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Brass",
                    "entries": [
                      "You have resistance to fire damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals fire damage, red gas exudes from your hands in a 15 ft radius sphere. Each creature, excluding yourself within the gas takes 1d6 fire damage and must pass a Constitution Saving throw, falling unconscious on a failed save. The creature(s) reawaken if they take any damage, or if another creature spends their action to wake them."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Silver",
                    "entries": [
                      "You have resistance to cold damage, at 10th level it becomes immunity. Whenever you cast a spell of 1st level or higher that deals cold damage, icy cold winds blow outward from your body in a 15 ft radius. Each creature within range takes 1d6 cold damage and must make a Constitution Saving Throw, suffering a -2 penalty to their AC and disadvantage on dexterity checks and saving throws on a failed save until the end of your next turn."
                    ]
                  },
                  {
                    "type": "entries",
                    "name": "Gold",
                    "entries": [
                      "You have resistance to fire damage, at 10th level it becomes immunity. You prepare spells from the Wizard’s spell list rather than the Dragon Mage’s spell list. These spells still count as Dragon Mage Spells for you. Whenever you cast a spell of 1st level or higher that deals fire damage, fire flares out in a 15 ft radius sphere. Each creature takes 1d6 fire damage and must make a Strength Saving Throw, suffering disadvantage on all Strength Checks, Saving Throws, and attacks using Strength until the start of your next turn."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "Draconian Scales",
            "entries": [
              "Being a Dragon Mage, your body is riddled with dragon scales, making your skin tougher. At 1st level While not wearing armor you have a natural armor equal to 13 + your Dexterity Modifier."
            ]
          },
          {
            "name": "Draconian Archetype",
            "entries": [
              "There are many variations of Dragon Mages, Summoners who call upon the help of an inner spirit to come to their aid, Devoted whose magic is brought upon the study or worship of either Tiamat or Bahamut, Evokers who imbue power into their allies, and Primordials who further enhance their elemental attunement."
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Draconian Powers",
            "entries": [
              "Also at 2nd level you learn the ancient secrets of dragons. You know how they can fly, shoot fire - lighting - acid - even frost out of their mouths. You start off with 3 Draconian Powers and gain more as shown in the Dragon Mage table. Some Draconian Powers are locked away by prerequisites that must be met before they obtain any of these sacred powers such as level and Draconian Origins. You can exchange a Draconian Power for others every time you level up."
            ]
          }
        ],
        [
          {
            "name": "Draconian Awakening",
            "entries": [
              "Starting at 3rd level, as an action you can awaken ancient powers from within, maximizing your magical prowess. Once your Draconian Awakening ends, you suffer 1 level of exhaustion and cannot cast spells for 1 round. You cannot use this transformation again until you finish a long rest. You gain more uses of this feature per long rest at 7th, 13th, and 17th levels. When you transform, you gain the following benefits for 1 minute :",
              {
                "type": "list",
                "items": [
                  "You gain advantage on Saving Throws against spells and other magical effects, including a Dragon’s Breath Weapon.",
                  "If you have a flying speed, it increases by 30 ft. If you do not have a flying speed, you gain a flying speed of 40 ft. Until you reach 5th level, you cannot end your turn airborne, any attempt to do so causes you to fall.",
                  "You reduce the amount of damage you take from spells and other magical effects by 1d10. You can only do so once per round.",
                  "You increase the amount of damage dealt by your spells and other magical effects by 1d10. You can only do so once per round. "
                ]
              }
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Recovery",
            "entries": [
              "At 5th level, you have learned to regain some of your magical energy by pulling power out from the depths of your draconian soul. Once per day, when you complete a short rest, you regain a single expended spell slot for each spell slot level under 6th you have. You cannot have more spell slots than your maximum.",
              "In addition, you regain a 1st level spell slot for each hit die you spend during your short rest. You cannot have more spell slots than your maximum. You can do this a number of times per day equal to your Spellcasting Ability Modifier, regaining expended uses during the next dawn or dusk whichever is further."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 6th level, gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Draconian Awakening (x2)",
            "entries": [
              "At 7th level, Gain another use of Draconian Awakening"
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Spell Expertise",
            "entries": [
              "Starting at 9th level, you have become exceptionally skilled at casting spells in combat. Whenever you take the attack action, you can cast a spell as part of that action. That spell must have a casting time of 1 action and the spell’s original level can be no higher than 4th level, you can however cast the spell using a higher level spell slot as normal.",
              "At 18th level, you can cast a spell of any level when you take the attack action."
            ]
          }
        ],
        [
          {
            "name": "Draconian Resistance",
            "entries": [
              "Starting at 10th level, whenever you fail a saving throw against a spell or magical effect, as a reaction you can roll an additional time, choosing the highest result. Once you use this feature you cannot do so again until you finish a long rest. At 15th level, instead of rolling you can choose to succeed instead."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 11th level, gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Awakening (x3)",
            "entries": [
              "At 13th level, Gain another use of Draconian Awakening"
            ]
          }
        ],
        [
          {
            "name": "Spell Expertise Improvement",
            "entries": [
              "See Spell Expertise."
            ]
          }
        ],
        [
          {
            "name": "Draconian Resistance Improvement",
            "entries": [
              "Refer to the Draconian Resistance Feature"
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          },
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 16th level, Gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Draconian Awakening (x4)",
            "entries": [
              "At 17th level, Gain another use of Draconian Awakening"
            ]
          }
        ],
        [
          {
            "name": "Draconian Mastery",
            "entries": [
              "Starting at 18th level, At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level Dragon Mage spell and a 2nd-level Dragon Mage spell. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal."
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 20th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ]
      ],
      "subclassTitle": "Draconian Archetype",
      "subclasses": [
        {
          "name": "Devoted",
          "subclassFeatures": [
            [
              {
                "name": "Devoted",
                "entries": [
                  "The Devoted Dragon Mages are those who study or even worship the mighty Dragon Gods such as Bahamut and Tiamat. Depending on the Dragon God you choose to worship or study varies the abilities you can obtain."
                ]
              },
              {
                "name": "Devoted Spellcasting",
                "entries": [
                  "At 1st level you obtain an expanded spell list depending on the Dragon God you choose to worship or study. These spells are added to your Dragon Mage Spell Lists and count as Dragon Mage spells when you cast them.",
                  {
                    "type": "table",
                    "caption": "Bahamut Spell List",
                    "colLabels": [
                      "Spell Level",
                      "Spells"
                    ],
                    "rows": [
                      [
                        "1st",
                        "Bless, Cure Wounds, Healing Word, Sanctuary, Shield of Faith"
                      ],
                      [
                        "2nd",
                        "Aid, Augury, Calm Emotions, Prayer of Healing, Lesser Restoration"
                      ],
                      [
                        "3rd",
                        "Beacon of Hope, Daylight, Mass Healing Word, Revivify, Spirit Guardians"
                      ],
                      [
                        "4th",
                        "Banishment, Death Ward, Divination, Guardian of Faith"
                      ],
                      [
                        "5th",
                        "Commune, Greater Restoration, Mass Cure Wounds"
                      ],
                      [
                        "6th",
                        "Heal"
                      ],
                      [
                        "7th",
                        "Conjure Celestial"
                      ],
                      [
                        "8th",
                        "Holy Aura"
                      ],
                      [
                        "9th",
                        "Mass Heal"
                      ]
                    ]
                  },
                  {
                    "type": "table",
                    "caption": "Tiamat Spell List",
                    "colLabels": [
                      "Spell Level",
                      "Spells"
                    ],
                    "rows": [
                      [
                        "1st",
                        "Arms of Hadar, Bane, Inflict Wounds, Wrathful Smite, Chaos Bolt"
                      ],
                      [
                        "2nd",
                        "Blindness/Deafness, Crown of Madness, Silence, Spiritual Weapon, Phantasmal Force"
                      ],
                      [
                        "3rd",
                        "Animate Dead, Bestow Curse, Hunger of Hadar, Speak with Dead, Summon Lesser Demons"
                      ],
                      [
                        "4th",
                        "Blight, Sickening Radiance, Staggering Smite, Summon Greater Demons"
                      ],
                      [
                        "5th",
                        "Contagion, Destructive Wave, Raise Dead"
                      ],
                      [
                        "6th",
                        "Harm"
                      ],
                      [
                        "7th",
                        "Finger of Death"
                      ],
                      [
                        "8th",
                        "Feeblemind"
                      ],
                      [
                        "9th",
                        "Power Word Kill"
                      ]
                    ]
                  }
                ]
              },
              {
                "name": "Divine Empowerment",
                "entries": [
                  "Also at 1st level, choose Bahamut or Tiamat, you gain one of the following abilities that correlates to what you picked. You can use each of these empowerments once per short rest. You gain another Empowerment at 6th level, another at 11th level, and finally one more at 16th level.",
                  {
                    "type": "table",
                    "caption": "Divine Empowerment Spells",
                    "colLabels": [
                      "Level",
                      "Bahamut",
                      "Tiamat"
                    ],
                    "rows": [
                      [
                        "1st",
                        "Divine Blessing : If you were to fail a saving throw, as a reaction you can add 2d4 to the roll.",
                        "Divine Bane : If a creature were to succeed on a saving throw against one of your Dragon Mage spells, as a reaction you can subtract 2d4 from their roll."
                      ],
                      [
                        "6th",
                        "Divine Healing : Whenever you heal a creature(s) with a Dragon Mage spell, as a reaction you can add an additional 2d4 to the roll.",
                        "Divine Harming : Whenever you would damage a creature(s) with a Dragon Mage spell, as a reaction you can add an additional 2d4 damage to the roll. "
                      ],
                      [
                        "11th",
                        "Divine Grace : When you would be hit by an attack you can, as a reaction you can add 2 to your armor class for that attack - potentially allowing the outcome to change.",
                        "Divine Peril: When you would miss an attack roll against a creature, as a reaction you can subtract 2 from their armor class for that attack - potentially allowing the outcome to change."
                      ],
                      [
                        "16th",
                        "Divine Protection : Whenever you would take damage, as a reaction you can subtract 2d4 from the damage roll.",
                        "Divine Retribution : Whenever you would take damage, as a reaction you can deal 2d4 damage to the attacker. The damage is dependent on your Draconian Origin."
                      ]
                    ]
                  }
                ]
              }
            ],
            [],
            [],
            [],
            [
              {
                "name": "Divine Calling",
                "entries": [
                  "At 20th level, as an action you can call upon the powers of either Tiamat or Bahamut, upon doing so gives you one of the following benefits depending on whom you call upon for 1 minute. Once the effects end you cannot call upon the powers until after you finish a long rest.",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "[Bahamut] Aura of Blessing",
                        "entries": [
                          "You and each friendly creature within 30 ft of you gain a +2 to AC and Saving Throws.",
                          "Your healing spells heal an additional 2d6.",
                          "You and each friendly creature within 30 ft of you receives 2d6 less damage from any incoming damage once per round.",
                          "You and each friendly creature within 30 ft of you do not suffer the effects of difficult terrain."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "[Tiamat] Aura of Destruction",
                        "entries": [
                          "Every hostile creature within 30 ft of you suffer a -2 to their AC and Saving Throws.",
                          "Every hostile creature within 30 ft of you receives 2d6 less hit points from healing spells.",
                          "Every hostile creature within 30 ft of you receives 2d6 more damage from your attacks and spells.",
                          "Every hostile creature within 30 ft of you suffers the effects of difficult terrain"
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          ],
          "source": "DrM",
          "shortName": "Devoted",
          "subclassSpells": [
            "Bless",
            "Cure Wounds",
            "Healing Word",
            "Sanctuary",
            "Shield of Faith",
            "Aid",
            "Augury",
            "Calm Emotions",
            "Prayer of Healing",
            "Lesser Restoration",
            "Beacon of Hope",
            "Daylight",
            "Mass Healing Word",
            "Revivify",
            "Spirit Guardians",
            "Banishment",
            "Death Ward",
            "Divination",
            "Guardian of Faith",
            "Commune",
            "Greater Restoration",
            "Mass Cure Wounds",
            "Heal",
            "Conjure Celestial",
            "Holy Aura",
            "Mass Heal",
            "Arms of Hadar",
            "Bane",
            "Inflict Wounds",
            "Wrathful Smite",
            "Chaos Bolt",
            "Blindness/Deafness",
            "Crown of Madness",
            "Silence",
            "Spiritual Weapon",
            "Phantasmal Force",
            "Animate Dead",
            "Bestow Curse",
            "Hunger of Hadar",
            "Speak with Dead",
            "Summon Lesser Demons",
            "Blight",
            "Sickening Radiance",
            "Staggering Smite",
            "Summon Greater Demons",
            "Contagion",
            "Destructive Wave",
            "Raise Dead",
            "Harm",
            "Finger of Death",
            "Feeblemind",
            "Power Word Kill"
          ]
        },
        {
          "name": "Evoker",
          "subclassFeatures": [
            [
              {
                "type": "Evoker",
                "entries": [
                  "The Evoker is a spellcaster that focuses on harnessing the energy inside of them and dispersing it, creating devastating attacks and making you and your allies stronger. However, their magic becomes wildly unstable and harder to control."
                ]
              },
              {
                "name": "Destructive Magic",
                "entries": [
                  "At 1st level, when you cast a Dragon Mage spell that deals damage it gains a bonus to the damage roll equal to your spellcasting ability modifier. "
                ]
              },
              {
                "name": "Evoke Energy",
                "entries": [
                  "Also at 1st level you have a pool of energy that you’ll use for your Evoker Features called Evoke Energy. You have an amount of Evoke Energy equal to twice your Dragon Mage level. You regain all expended Evoke Energy after a long rest. As a bonus action on your turn you can spend your Evoke Energy to do one of the following effects :",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Evoke Destruction",
                        "entries": [
                          "When you cast an evocation spell of 1st level or higher that deals damage, by spending 2 Evoke Energy you deal an additional amount of damage equal to 2 plus the spell’s level. As a result, you lose an amount of hit points equal to the bonus damage dealt."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Evoke Speed",
                        "entries": [
                          "When you cast an evocation spell of 1st level or higher, you can spend 2 Evoke Energy to grant you and allies within 20 ft of you an increase to their movement speed by 10 ft."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Evoke Durability",
                        "entries": [
                          "When you cast an evocation spell of 1st level or higher you can spend 2 Evoke Energy to grant allies within 20 ft of you temporary hit points equal to 2 plus the spell’s level."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Evoke Durability",
                        "entries": [
                          "When you cast an evocation spell of 1st level or higher, by spending 2 Evoke Energy allies within 20 ft of you gain advantage on all attack rolls and saving throws until the start of your next turn."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Evoke Aura",
                "entries": [
                  "Beginning at 6th level you can spend an action and 2 Evoke Energy to activate your “Evoke Aura”. Your Aura does not have a duration, however at the start of each of your turns you must spend 2 Evoke Energy to prolong the aura. While the Aura is active you have the following effects : ",
                  {
                    "type": "list",
                    "items": [
                      "Each creature you choose within 20 ft of you makes a Wisdom saving throw against your spell save DC, on a failed save they are frightened for as long as the aura lasts, on a success they are immune to this effect for 24 hours. Each affected creature can repeat their save at the end of each of their turns, ending this effect on a success.",
                      "Creatures who are frightened of you have disadvantage on ability checks and saving throws against Evocation spells you cast. In addition, creatures frightened of you cannot regain hit points if they are within your Aura’s radius.",
                      "As a bonus action on your turn, you can choose a number of creatures within your aura’s radius up to your spellcasting ability modifier, those creatures gain a number of temporary hit points equal to half your Dragon Mage level. "
                    ]
                  },
                  "When the effects of your Evoke Aura ends you suffer 1 level of exhaustion and lose 2d12 hit point. Once you have used your Evoke Aura once, you cannot do so again until you finish a long rest."
                ]
              }
            ],
            [
              {
                "name": "Evoke Full Release",
                "entries": [
                  "At 11th level, as an action you can spend all of your remaining Evoke Energy to release a burst of energy outward 60 ft in every direction. This Energy will heal your allies within range 1d6 per Evoke Energy spent and deal 1d6 force damage per Evoke Energy spent to each hostile creature within range. When doing so, you lose 2d6 hit points per Evoke Energy spent. When you use this feature you cannot do so again until you finish a long rest. If you were to die as a result of this attack, your body and soul are destroyed. Only the means of the Wish spell can return you to life."
                ]
              }
            ],
            [
              {
                "name": "Evoke Control",
                "entries": [
                  "At 16th level, when you spend Evoke Energy on an evocation spell that deals damage, you can spend twice the amount you would normally spend to deal no damage to objects and allies within the range of the spell. Once you use this feature you cannot do so again until you finish a short or long rest."
                ]
              }
            ],
            [
              {
                "name": "Evoke Mastery",
                "entries": [
                  "At 20th level, you have learned how to harness your Evoke Energy more efficiently, being able to call upon it more reliably. Whenever you roll initiative while you have no Evoke Energy, you regain 8. In addition, all of your Evoke Energy now restores after a short rest."
                ]
              }
            ]
          ],
          "source": "DrM",
          "shortName": "Evoker"
        },
        {
          "name": "Primordial",
          "subclassFeatures": [
            [
              {
                "name": "Primordial",
                "entries": [
                  "Fire, Water, Earth, Wind, these are the four main elementals that bring everything in perfect balance. Dragons have been able to control these elements, but only the Primordial Dragons could truly master these elements, and now you can too."
                ]
              },
              {
                "name": "Elemental Attunement",
                "entries": [
                  "Beginning at 1st level, you gain the Druidcraft cantrip and one additional cantrip depending on your Draconian Origin damage type. You also learn how to speak, read, and write all dialects of Primordial. The damage provided by your Draconian Origin becomes known as your “Primordial Damage”. ",
                  "*Original Cantrips, see spells for details",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Fire",
                        "entries": [
                          "{@spell Control Flames|XGE}"
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Cold",
                        "entries": [
                          "{@spell Shape Water|XGE}"
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Lightning",
                        "entries": [
                          "{@spell Control Sparks|DrM}*"
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Acid",
                        "entries": [
                          "{@spell Shape Acid|DrM}*"
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Poison",
                        "entries": [
                          "{@spell Poison Flow|DrM}*"
                        ]
                      }
                    ]
                  },
                  "These cantrips do not count against your total known cantrips and count as Dragon Mage cantrips. "
                ]
              }
            ],
            [
              {
                "name": "Elemental Supremacy",
                "entries": [
                  "Starting at 6th level, when you cast a spell of 1st level or higher that deals your Primordial Damage, you can instead deal the maximum amount of damage for the spell instead of rolling damage. You can use this feature a number of times equal to half your proficiency bonus rounded down. You regain all expended uses of this feature after you finish a short rest."
                ]
              }
            ],
            [
              {
                "name": "Primordial Summons",
                "entries": [
                  "Starting at 11th level, depending on your Primordial Damage, you gain the ability to conjure an Elemental to your beck and call. Conjuring this elemental takes an Action. The Elemental remains conjured for 1 hour, or until it is reduced to 0 hit points. It obeys your commands to the best of its ability, but it will not attempt to do harm to itself unless it is willing to. The Elementals adopt the appearance of Dragons, but retain the original creature size.",
                  "See the {@monster Primordial Elemental|DrM} stat block. ",
                  "Your Primordial Damage determines its damage resistance, the type of damage it deals with its slam attack, and the special actions it gains. It otherwise follows the stat block’s statistics as normal. It also uses your proficiency bonus instead of its own and you add your proficiency bonus to its perception and stealth ability checks.",
                  "When your Primordial Elemental is reduced to 0 hit points, it is destroyed and cannot be summoned again until you finish a long rest."
                ]
              }
            ],
            [
              {
                "name": "Primordial Transformation",
                "entries": [
                  "Starting at 16th level, as an action you can attain the shape of a Primordial. While in this state you gain the features of the Elementals you can summon as well as their slam attacks - which for the purposes of this transformation is the slam attacks are melee spell attacks. You retain your original features and stats, unless your Elemental has higher stats. This transformation lasts for 1 minute. Also depending on your Primordial Damage, you gain one of the following features while transformed in this way :",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Fire: Flaming Weapons",
                        "entries": [
                          "Your weapons become magical for the purposes of overcoming magic resistances and are wreathed in flames, dealing an additional 2d6 fire damage."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Cold : Frozen Body",
                        "entries": [
                          "Your AC increases by 2 and you have advantage on all Constitution Saving Throws and your Slam attacks deal 2d6 cold damage."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Lightning : Shocking Retaliation",
                        "entries": [
                          "Whenever you are hit by a melee weapon attack, the source of the attack takes 2d6 lightning damage."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Acid : Melting Touch",
                        "entries": [
                          "Whenever you come into contact with an object, make a melee spell attack. On hit you deal 2d6 acid damage and the object begins to melt away. Depending on the size of the object it could take as little as 10 seconds to as long as 1 hour to melt away."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Poison : Toxic Touch",
                        "entries": [
                          "When you come into contact with a creature, they must make a Constitution Saving Throw against your Spell Save DC. On a failed save they become poisoned for 1 hour. They can repeat their saving throw at the end of each of their turns."
                        ]
                      }
                    ]
                  },
                  "Once your transformation ends, you suffer 1 level of exhaustion and cannot transform again until you finish a long rest."
                ]
              },
              {
                "name": "Primordial Appearance",
                "entries": [
                  "Also at 16th level, rather than unleashing the might of the Primordial Transformation - you can assume the appearance of it at any given time, doing so however does not grant you the benefits of said transformation."
                ]
              }
            ],
            [
              {
                "name": "Primordial Lord",
                "entries": [
                  "At 20th level, you have mastered your control over the elements. You can now use your Primordial Transformation indefinitely and can permanently summon your Elemental as a companion, but can only summon one at a time. You also have advantage on Charisma checks with other Elementals, as they view you as a powerful Primordial.\n"
                ]
              },
              {
                "name": "Elemental Mastery",
                "entries": [
                  "Also at 20th level, whenever you deal your Primordial Damage it ignores all damage reductions, resistances, and immunities to that damage type. In addition, you gain “Absorption” to that damage type, which allows you to gain temporary hit points equal to the amount of damage you would have normally taken."
                ]
              }
            ]
          ],
          "source": "DrM",
          "shortName": "Primordial",
          "subclassSpells": [
            "Control Flames",
            "Shape Water",
            "Control Sparks",
            "Shape Acid",
            "Poison Flow"
          ]
        },
        {
          "name": "Summoner",
          "subclassFeatures": [
            [
              {
                "name": "Summoner",
                "entries": [
                  "Summoners have decided to devote their powers more so to asking for aid from spiritual manifestations of their draconic origins. This allows them to summon forth terrifying creatures of destruction in their stead to wreak havoc on their enemies. Summoners can be the most dangerous of Dragon Mages."
                ]
              },
              {
                "name": "Manifest Dragon",
                "entries": [
                  "Starting at 1st level, as an action you can manifest a spiritual dragon. When you do so, the spirit has the stat block of a wyrmling corresponding to your Draconian Origin. For example, if you are a Red dragon mage, you manifest a Red Dragon Wyrmling. Your manifested dragon has a number of hit points equal to three times your dragon mage level, rather than the amount provided by the dragon’s stat block. Your manifested dragon also uses your proficiency bonus rather than its own. In addition, your manifested dragon is instantly destroyed if it is at least 30 ft away from you. Your manifested dragon is also destroyed if it falls to 0 hit points or fewer.",
                  "The manifested dragon shares its initiative with you, but cannot take actions unless otherwise commanded to as a bonus action. This command can be mentally given. In addition, while your dragon is manifested you can do any of the following: ",
                  {
                    "type": "list",
                    "items": [
                      "When you take the attack action or cast a spell on your turn, you can replace one of your attacks with an attack originating from your manifested dragon using one of its attacks, or the spell can be cast originating from its position as if it had cast the spell. The spell still uses your own statistics when determining spell attack bonus and the spell save dc.",
                      "You can magically swap places with your manifested dragon using 15 ft of your movement, regardless of the distance between the two of you.",
                      "When a creature that you can see within 5 feet of your manifested dragon moves at least 5 feet away from it, you can use your reaction to make an opportunity attack against that creature using your manifested dragon as the attacker. Your manifested dragon cannot use their reaction when you do so until after the attack roll is made and the creature has left melee range of it."
                    ]
                  },
                  "You have a number of uses of this feature equal to your spellcasting ability modifier, and regain all expended uses when you finish a long rest."
                ]
              },
              {
                "name": "Unleash Draconic Fury",
                "entries": [
                  "Also at 1st level, when you take the attack action or cast a spell while your dragon is manifested, your dragon can make a melee attack against a creature within 5 ft of it. You have a number of uses of this feature equal to your proficiency bonus, and regain all expended uses after a short or long rest."
                ]
              }
            ],
            [
              {
                "name": "Manifest Greater Dragon",
                "entries": [
                  "Starting at 6th Level, when you use the Manifest Dragon feature, you can manifest a young dragon instead of a wyrmling. The same rules still apply, however the following changes are made:",
                  {
                    "type": "list",
                    "items": [
                      "Your manifested dragon can be up to 60 ft away from you without being destroyed.",
                      "Your manifested dragon loses any multiattack feature if it had one.",
                      "If you or an ally is within range of the manifested dragon’s breath weapon, they automatically succeed.",
                      "Your manifested dragon’s attacks are considered magical for the purposes of overcoming non-magical resistances."
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Shared Mind of the Drakes",
                "entries": [
                  "At 11th level, you can now link with your manifested dragon’s senses. You can temporarily transfer your consciousness to your manifested dragon. As an action, you can see through your dragon's eyes and hear through its ears. During this time, you are deafened and blinded. You can sustain this effect for up to 10 minutes, and you can end it at any time (requires no action). While your manifested dragon is being used in this way, it can be up to 600 feet away from you without being destroyed."
                ]
              },
              {
                "name": "Cooperative Initiative",
                "entries": [
                  "Also starting at 11th level, while your manifested dragon is summoned you have advantage on initiative checks. In addition, you can no longer be surprised by creatures as a result of being unseen by you, as your manifested dragon gives you a mental forewarning of incoming danger."
                ]
              }
            ],
            [
              {
                "name": "Manifest Superior Dragon",
                "entries": [
                  "Starting at 16th Level, when you use the Manifest Dragon feature, you can manifest an adult dragon instead of a young or wyrmling. The same rules still apply, however the following changes are made:",
                  {
                    "type": "list",
                    "items": [
                      "The dragon loses any of its legendary actions and legendary resistances if it had any. ",
                      "The dragon gains a multiattack of two melee attacks and it can use its frightful presence as part of that multiattack.",
                      "The dragon loses any lair actions if it had any."
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Mournful Sacrifice",
                "entries": [
                  "At 20th level, if you were to die by any means while your dragon is manifested, you can instantly destroy your manifestation and expend all remaining uses of your Manifest Dragon feature to avoid dying. When you do so, you are brought to your feet at 1 hit point instead."
                ]
              },
              {
                "name": "Manifest Supreme Dragon",
                "entries": [
                  "Starting at 20th Level, when you use the Manifest Dragon feature, you can manifest an ancient dragon instead of an adult, young, or wyrmling. The same rules still apply, however the following changes are made:",
                  {
                    "type": "list",
                    "items": [
                      "The dragon’s multiattack increases to three attacks.",
                      "The dragon regains 1 Legendary Resistance.",
                      "The dragon’s AC increases by your proficiency bonus."
                    ]
                  },
                  "In addition, when you roll initiative while you have no uses of your Manifest Dragon feature, you regain 1 use."
                ]
              }
            ]
          ],
          "source": "DrM",
          "shortName": "Summoner"
        }
      ],
      "fluff": [
        {
          "entries": [
            "There are many variations of Dragon Mages, Summoners who call upon the help of an inner spirit to come to their aid, Devoted whose magic is brought upon the study or worship of either Tiamat or Bahamut, Evokers who imbue power into their allies, and Primordials who further enhance their elemental attunement."
          ],
          "name": "Dragon Mage",
          "type": "section"
        }
      ],
      "classSpells": [
        "Acid Splash",
        "Blade Ward",
        "Booming Blade|SCAG",
        "Control Flames|XGE",
        "Create Bonfire|XGE",
        "Dancing Lights",
        "Fire Bolt",
        "Friends",
        "Frostbite|XGE",
        "Green-Flame Blade|SCAG",
        "Gust|XGE",
        "Light",
        "Lightning Lure|SCAG",
        "Mage Hand",
        "Mending",
        "Message",
        "Minor Illusion",
        "Mold Earth|XGE",
        "Poison Spray",
        "Prestidigitation",
        "Primal Savagery",
        "Ray of Frost",
        "Shape Water|XGE",
        "Shocking Grasp",
        "Thunderclap|XGE",
        "True Strike",
        "Absorb Elements|XGE",
        "Burning Hands",
        "Catapult|XGE",
        "Charm Person",
        "Color Spray",
        "Comprehend Languages",
        "Detect Magic",
        "Disguise Self",
        "Distort Value|AI",
        "Earth Tremor|XGE",
        "Expeditious Retreat",
        "False Life",
        "Feather Fall",
        "Fog Cloud",
        "Grease",
        "Ice Knife|XGE",
        "Jump",
        "Longstrider",
        "Magic Missile",
        "Protection from Evil and Good",
        "Ray of Sickness",
        "Shield",
        "Silent Image",
        "Sleep",
        "Thunderwave",
        "Witch Bolt",
        "Wrathful Smite",
        "Aganazzar's Scorcher|XGE",
        "Alter Self",
        "Blindness/Deafness",
        "Blur",
        "Cloud of Daggers",
        "Darkness",
        "Darkvision",
        "Detect Thoughts",
        "Dragon's Breath|XGE",
        "Dust Devil|XGE",
        "Earthbind|XGE",
        "Enhance Ability",
        "Enlarge/Reduce",
        "Flame Blade",
        "Flaming Sphere",
        "Gust of Wind",
        "Hold Person",
        "Invisibility",
        "Knock",
        "Levitate",
        "Maximilian's Earthen Grasp|XGE",
        "Mind Spike",
        "Mirror Image",
        "Misty Step",
        "Phantasmal Force",
        "Pyrotechnics|XGE",
        "Scorching Ray",
        "See Invisibility",
        "Shatter",
        "Snilloc's Snowball Swarm|XGE",
        "Spider Climb",
        "Suggestion",
        "Warding Wind|XGE",
        "Web",
        "Blink",
        "Catnap|XGE",
        "Clairvoyance",
        "Counterspell",
        "Daylight",
        "Dispel Magic",
        "Enemies Abound|XGE",
        "Erupting Earth|XGE",
        "Fear",
        "Fireball",
        "Flame Arrows",
        "Fly",
        "Gaseous Form",
        "Haste",
        "Hypnotic Pattern",
        "Lightning Bolt",
        "Major Image",
        "Melf's Minute Meteors|XGE",
        "Protection from Energy",
        "Sleet Storm",
        "Slow",
        "Stinking Cloud",
        "Thunder Step|XGE",
        "Tidal Wave|XGE",
        "Tongues",
        "Vampiric Touch",
        "Wall of Water|XGE",
        "Water Breathing",
        "Water Walk",
        "Banishment",
        "Blight",
        "Charm Monster|XGE",
        "Confusion",
        "Dimension Door",
        "Dominate Beast",
        "Fire Shield",
        "Greater Invisibility",
        "Ice Storm",
        "Polymorph",
        "Sickening Radiance|XGE",
        "Stoneskin",
        "Storm Sphere|XGE",
        "Vitriolic Sphere|XGE",
        "Wall of Fire",
        "Watery Sphere|XGE",
        "Animate Objects",
        "Cloudkill",
        "Cone of Cold",
        "Control Winds|XGE",
        "Creation",
        "Dominate Person",
        "Enervation|XGE",
        "Far Step|XGE",
        "Hold Monster",
        "Immolation|XGE",
        "Seeming",
        "Skill Empowerment|XGE",
        "Synaptic Static|XGE",
        "Telekinesis",
        "Teleportation Circle",
        "Wall of Light| XGE",
        "Wall of Stone",
        "Arcane Gate",
        "Chain Lightning",
        "Circle of Death",
        "Disintegrate",
        "Eyebite",
        "Flesh to Stone",
        "Globe of Invulnerability",
        "Investiture of Flame|XGE",
        "Investiture of Ice|XGE",
        "Investiture of Stone|XGE",
        "Investiture of Wind|XGE",
        "Mass Suggestion",
        "Mental Prison|XGE",
        "Move Earth",
        "Scatter|XGE",
        "Sunbeam",
        "True Seeing",
        "Crown of Stars",
        "Delayed Blast Fireball",
        "Etherealness",
        "Finger of Death",
        "Fire Storm",
        "Plane Shift",
        "Power Word Pain|XGE",
        "Prismatic Spray",
        "Reverse Gravity",
        "Teleport",
        "Whirlwind|XGE",
        "Abi-Dalzim's Horrid Wilting|XGE",
        "Demiplane",
        "Dominate Monster",
        "Earthquake",
        "Incendiary Cloud",
        "Power Word Stun",
        "Sunburst",
        "Foresight",
        "Gate",
        "Invulnerability|XGE",
        "Mass Polymorph|XGE",
        "Meteor Swarm",
        "Power Word Kill",
        "Psychic Scream|XGE",
        "Shapechange",
        "Time Stop",
        "True Polymorph"
      ]
    }
  ],
  "spell": [
    {
      "name": "Control Sparks",
      "source": "DrM",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You create small harmless sparks of electricity. You can shape the strands of electricity in any way you see fit within range in a 5ft cube. You can use the sparks to ignite small objects, for example a cigarette, but never actually set it aflame. You can also surround yourself with these sparks and whenever a creature comes into contact with you, the sparks zap them as if it were static electricity. You can also use this feature to give a device active electricity for up to 1 hour."
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "C"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "",
            "source": "DrM"
          }
        ],
        "fromSubclass": [
          {
            "class": {
              "name": "Dragon Mage",
              "source": "DrM"
            },
            "subclass": {
              "name": "Primordial",
              "source": "DrM"
            }
          }
        ]
      }
    },
    {
      "name": "Shape Acid",
      "source": "DrM",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "duration": {
            "type": "hour",
            "amount": 1
          }
        }
      ],
      "entries": [
        "You choose an area of acid that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:",
        {
          "type": "list",
          "items": [
            "You instantaneously move or otherwise change the flow of the acid as you direct, up to 5 feet in any direction. This movement doesn’t have enough force to cause damage and the acid being manipulated loses its damaging properties until released, which when released it deals {@damage 1d6} acid damage to a creature it is dropped on.",
            "You cause the acid to form into simple shapes and animate at your direction. This change lasts for 1 hour.",
            "You change the acid’s color or opacity. The acid must be changed in the same way throughout. This change lasts for 1 hour."
          ]
        },
        "If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "C"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "",
            "source": "DrM"
          }
        ],
        "fromSubclass": {
          "class": {
            "name": "Dragon Mage",
            "source": "DrM"
          },
          "subclass": {
            "name": "Primordial",
            "source": "DrM"
          }
        }
      }
    },
    {
      "name": "Poison Flow",
      "source": "DrM",
      "level": 0,
      "school": "T",
      "time": [
        {
          "number": 1,
          "unit": "action"
        }
      ],
      "range": {
        "type": "point",
        "distance": {
          "type": "feet",
          "amount": 30
        }
      },
      "components": {
        "s": true
      },
      "duration": [
        {
          "type": "instant"
        },
        {
          "type": "timed",
          "duration": {
            "type": "hour",
            "amount": 1
          }
        }
      ],
      "entries": [
        "Choose a poisonous substance nearby, whether it is in a vial, pool, bowl, drink, etc. You can magically move that substance freely within range. If moved into a creature, the creature can make a Dexterity Saving Throw, consuming the poison on a failed save. If a creature has a poison flowing through them, you can use this cantrip to remove the poison safely, without harming the creature who is {@condition poisoned}. The creature must be within the range of the cantrip and must remain perfectly still so that the flow is not interrupted. This process typically takes anywhere from 1 minute to 1 hour depending on how long the poison had been present."
      ],
      "miscTags": [
        "SGT"
      ],
      "areaTags": [
        "C"
      ],
      "classes": {
        "fromClassList": [
          {
            "name": "",
            "source": "DrM"
          }
        ],
        "fromSubclass": {
          "class": {
            "name": "Dragon Mage",
            "source": "DrM"
          },
          "subclass": {
            "name": "Primordial",
            "source": "DrM"
          }
        }
      }
    }
  ],
  "monster": [
    {
      "name": "Primordial Elemental",
      "source": "DrM",
      "size": "L",
      "type": "elemental",
      "alignment": [
        "U"
      ],
      "ac": [
        {
          "special": "14 + your proficiency bonus"
        }
      ],
      "hp": {
        "special": "equal the elemental's Constitution modifier + your proficiency bonus + five times your Dragon Mage level"
      },
      "speed": {
        "walk": 40,
        "fly": {
          "number": 40,
          "condition": "(only hovers)",
          "canHover": true
        }
      },
      "str": 18,
      "dex": 15,
      "con": 17,
      "int": 4,
      "wis": 10,
      "cha": 16,
      "senses": [
        "darkvision 60 ft."
      ],
      "passive": 10,
      "immune": [
        "poison"
      ],
      "conditionImmune": [
        "exhaustion",
        "paralyzed",
        "petrified",
        "poisoned",
        "unconcious"
      ],
      "languages": [
        "Primordial",
        "understands the languages you speak"
      ],
      "trait": [
        {
          "name": "Amorphous Form",
          "entries": [
            "The elemental can move through a space as narrow as 1 inch wide without squeezing."
          ]
        },
        {
          "name": "Living Storm (Lightning or Cold Only)",
          "entries": [
            "The Primordial Elemental is always at the center of a storm 120 feet in diameter. Heavy precipitation in the form of either rain (lightning) or snow (cold) falls there, causing the area to be lightly obscured. Heavy rain also extinguishes open flames and imposes disadvantage on Wisdom (Perception) checks that rely on hearing.",
            "In addition, strong winds swirl in the area covered by the storm. The winds impose disadvantage on ranged attack rolls. The winds extinguish open flames and disperse fog. Creatures of the Primordial Elemental's choosing is unaffected by these detriments."
          ]
        },
        {
          "name": "Primordial Body",
          "entries": [
            "A creature that touches the Primordial Elemental or hits it with a melee attack while within 5 feet of it takes ({@dice 2d6}) of your primordial damage.",
            "The Primordial Elemental can choose creatures to be immune to this effect."
          ]
        },
        {
          "name": "Illumination (Fire Only)",
          "entries": [
            "The primordial elemental sheds bright light in a 30-foot radius and dim light for an additional 30 feet."
          ]
        },
        {
          "name": "Acidic Touch (Acid Only)",
          "entries": [
            "When a creature is hit by the Primordial Elemental, their AC is reduced by 1, to a maximum reduction of 4."
          ]
        },
        {
          "name": "Poisonous Breath (Poison Only)",
          "entries": [
            "A creature that takes damage by the Primordial Elemental's Primordial Breath is {@condition poisoned} until the end of its next turn."
          ]
        }
      ],
      "action": [
        {
          "name": "Multiattack",
          "entries": [
            "The elemental makes a number of attacks equal to half your proficiency bonus (rounded down)."
          ]
        },
        {
          "name": "Primordial Slam",
          "entries": [
            "{@atk mw} your spell attack bonus to hit, reach 5 ft., one target. {@h}{@damage 1d10 + your spellcasting ability modifier} primordial damage."
          ]
        },
        {
          "name": "Primordial Breath {@recharge 5}",
          "entries": [
            "The Primordial Elemental releases a powerful breath weapon in a 30 ft cone. Each creature within the cone makes a Dexterity saving throw against your Spell Save DC. On a failed save, they take a number of {@dice d6} of your primordial damage equal to your spellcasting ability modifier plus your proficiency bonus. On a success, they take half damage instead."
          ]
        }
      ],
      "senseTags": [
        "D"
      ],
      "actionTags": [
        "Multiattack"
      ],
      "languageTags": [
        "P"
      ],
      "miscTags": [
        "MW",
        "AOE"
      ],
      "traitTags": [
        "Amorphous"
      ],
      "resist": [
        {
          "special": "your primordial damage"
        }
      ],
      "fluff": [
        {
          "type": "image",
          "href": {
            "type": "external",
            "url": "https://vignette.wikia.nocookie.net/thirdexalt/images/1/1c/5_Elemental_Dragons.png/revision/latest/scale-to-width-down/690?cb=20141017125505"
          }
        }
      ],
      "skill": {
        "perception": 0,
        "stealth": 2
      },
      "damageTags": [
        "F"
      ]
    }
  ]
}