{
  "_meta": {
    "sources": [
      {
        "json": "DS",
        "abbreviation": "DS",
        "full": "Dragon Shaman",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "CrimtaneCreeper",
          "Eriku Blade"
        ],
        "version": "2.0",
        "url": "",
        "targetSchema": "1.0.0"
      }
    ]
  },
  "class": [
    {
      "name": "Dragon Shaman",
      "source": "DS",
      "hd": {
        "number": 1,
        "faces": 10
      },
      "proficiency": [
        "con",
        "wis"
      ],
      "classTableGroups": [
        {
          "colLabels": [
            "Draconian Powers",
            "Draconian Shape"
          ],
          "rows": [
            [
              "-",
              1
            ],
            [
              2,
              1
            ],
            [
              2,
              1
            ],
            [
              3,
              1
            ],
            [
              3,
              1
            ],
            [
              4,
              1
            ],
            [
              4,
              1
            ],
            [
              5,
              1
            ],
            [
              5,
              1
            ],
            [
              6,
              2
            ],
            [
              6,
              2
            ],
            [
              7,
              2
            ],
            [
              7,
              2
            ],
            [
              8,
              2
            ],
            [
              8,
              2
            ],
            [
              9,
              2
            ],
            [
              9,
              2
            ],
            [
              10,
              2
            ],
            [
              10,
              2
            ],
            [
              11,
              3
            ]
          ]
        }
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          "shields"
        ],
        "weapons": [
          "simple",
          "shortswords"
        ],
        "tools": [
          ""
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "Acrobatics",
                "Athletics",
                "History",
                "Insight",
                "Intimidation",
                "Nature",
                "Perception",
                "Stealth",
                "Survival"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a Quarterstaff OR (b) any simple Weapon",
          "(a) an Explorer’s Pack OR (b) a Priest’s Pack",
          "(a) leather armor OR (b) scale mail",
          "A memento of your draconic heritage"
        ],
        "goldAlternative": "5d4"
      },
      "multiclassing": {
        "requirements": {
          "wis": 13,
          "or": [
            {
              "dex": 13,
              "str": 13
            }
          ]
        },
        "proficienciesGained": {}
      },
      "classFeatures": [
        [
          {
            "name": "Draconian Origins",
            "entries": [
              "Beginning at 1st level, you have draconic blood running through your veins as part of your draconic inheritance. You gain the following benefits:",
              "You learn how to speak, read, and write draconic. If you already have draconic from another source, you can choose one other language.",
              "Choose either chromatic or metallic, then choose from either black, blue, green, red, or white for chromatic. Brass, bronze, copper, gold, or silver for metallic. These determine your draconic origin, what type of dragon is responsible for your powers, and what type of scales riddle your body.",
              "Depending on your choice, you gain resistance to a specific damage type. ",
              {
                "type": "table",
                "caption": "Draconic Ancestry",
                "colLabels": [
                  "Type",
                  "Damage Resistance"
                ],
                "rows": [
                  [
                    "Brass, Gold, Red",
                    "Fire"
                  ],
                  [
                    "Silver, White",
                    "Cold"
                  ],
                  [
                    "Black, Copper",
                    "Acid"
                  ],
                  [
                    "Blue, Bronze",
                    "Lightning"
                  ],
                  [
                    "Green",
                    "Poison"
                  ]
                ]
              },
              "If you chose metallic, you gain proficiency in your choice of either an artisan’s tool or a musical instrument.",
              "If you chose chromatic, you gain proficiency in one of the following skills: deception, intimidation, performance, or persuasion."
            ]
          },
          {
            "name": "Draconian Shape",
            "entries": [
              "Harnessing the draconic powers that dwell within you, you can transform your shape to resemble a more draconic figure. As an action you can morph your body into that of a dragon. When you take this form, you become a large creature and your creature type changes from humanoid to dragon. At this level, you are a lesser dragon so you can understand languages, but you cannot speak or cast spells.You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense. You also retain your statistics. Such as armor class, hit points, movement speed, skill proficiencies, etc. ",
              "You can choose whether your items being worn or carried morph into your new form, or drop to the ground at your feet.",
              "While in this form, your AC is 13 plus your Wisdom modifier and you have natural weapons in the form of bites and claws. Each of these weapons deals 1d10 plus your strength or dexterity modifier in your choice of slashing or piercing damage. If you have the “Draconian Claws and Fangs” Draconian Power, it replaces this damage. You can also make one attack using your natural weapons as a bonus action.",
              "You can stay in a draconian shape for a number of hours equal to half your dragon shaman level (rounded down). You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.",
              "You can use this feature once, after which you cannot use it again until you finish a short or long rest. You gain an additional use of this feature at 10th level, and another one at 20th level."
            ]
          },
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 1st level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Draconian Powers",
            "entries": [
              "Also at 2nd level you learn the ancient secrets of dragons. You know how they can fly, shoot fire - lighting - acid - even frost out of their mouths. You start off with 2 Draconian Powers and gain more as shown in the Dragon Shaman table. Some Draconian Powers are locked away by prerequisites that must be met before they obtain any of these sacred powers such as level and Draconian Origins. You can exchange a Draconian Power for others every time you level up."
            ]
          }
        ],
        [],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Extra Attack",
            "entries": [
              "Starting at 5th level, when you take the attack action on your turn you can make an additional weapon attack. "
            ]
          }
        ],
        [
          {
            "name": "Draconian Roar",
            "entries": [
              "Starting at 6th level you can unleash a mighty roar to strike fear into your enemies. As an action while in your Draconian Shape, you can force each creature that can both see and hear you within 60 feet of you to make a Wisdom saving throw DC 8 + your proficiency bonus + your Wisdom modifier. On a failed save, each creature is frightened. On a success, the creature is immune to your roar for the next 24 hours. ",
              "Immediately after being frightened in this way, each creature is knocked prone and must use their action to dash away from you. If there is nowhere to run, the creature may take the dodge action. ",
              "At the end of each affected creatures’ turns, they can repeat their saving throw, ending the effect on a success.\n"
            ]
          },
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 7th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Flight",
            "entries": [
              "Starting at 9th level, while in your Draconian Shape, you have a flying speed of 60 ft. In addition, your creature size becomes huge instead large and you can carry up to four creatures without reducing your speed while in your Draconian Shape."
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 10th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 11th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Might",
            "entries": [
              "At 13th level you’ve awakened a power from deep within. While in your Draconian Shape, you can choose to gain advantage on your melee attacks, but attacks made against you have advantage.",
              "Your AC in your Draconian Shape becomes 15 plus your Wisdom modifier.",
              "You can make a single attack using one of your natural weapons when you use your Draconian Shape feature.",
              "In addition, while in your Draconian Shape the damage resistance granted from your Draconic Origins becomes a damage immunity instead."
            ]
          }
        ],
        [],
        [
          {
            "name": "Draconian Age",
            "entries": [
              "At 15th level, your dragon-like abilities have allowed you a timeless body and an increased lifespan. You suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however.",
              "In addition, the draconic magic that you wield causes you to age more slowly. For every 100 years that pass, your body ages only 1 year."
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          },
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 16th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ],
        [],
        [
          {
            "name": "Dracronian Master",
            "entries": [
              "At 18th level, you can ignore the verbal and somatic components of your spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your Draconian Shape.",
              "In addition, whenever you roll for initiative when you have no uses of your Draconian Shape, you regain 1 usage."
            ]
          }
        ],
        [
          {
            "name": "Ability Score Improvement",
            "entries": [
              "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
              "If your DM allows the use of feats, you may instead take a feat."
            ]
          }
        ],
        [
          {
            "name": "Draconian Archetype Feature",
            "entries": [
              "At 20th level, you gain a feature from your chosen Draconian Archetype"
            ],
            "gainSubclassFeature": true
          }
        ]
      ],
      "subclassTitle": "Draconian Archetype",
      "subclasses": [
        {
          "name": "Path of the Wildling",
          "subclassFeatures": [
            [
              {
                "name": "Path of the Wildling",
                "entries": [
                  "You were born in the wild, raised by the wilderness and nature itself. Along this path, you have learned that you possess a power to bend and control the nature around you, causing great changes to the terrain around where you call home."
                ]
              },
              {
                "name": "Terraforming Presence",
                "entries": [
                  "Starting at 1st level, as an action on your turn, you can cause the area around you to shift and turn, transmogrifying the ground beneath you for 1 minute. You create a 10 ft radius cylinder, centered on you, of difficult terrain. The cylinder moves with you, and you are immune to the effects of this difficult terrain. In addition, you can choose up to a number of creatures equal to your Wisdom modifier to be immune to these effects as well. Depending on the damage you gain resistance to from your Draconic Origins, one of the following effects becomes active, the effects ending when the difficult terrain returns to normal. You have a number of uses of this feature equal to your proficiency bonus, and regain all expended uses after a long rest. If your effect requires a saving throw, the DC is 8 + your proficiency bonus + your Wisdom modifier.",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "name": "Fire",
                        "entries": [
                          "Plumes of lava rise from the ground and the ground beneath you becomes volcanic-like in appearance. As a bonus action on your turn, you can make a ranged spell attack using Wisdom as your spellcasting ability against a creature you can see within 60 ft of your difficult terrain. On hit, the target takes 2d6 fire damage and is on fire. At the start of each of the creatures' turns they take 5 points of fire damage. That creature, or another creature within 5 feet, can use an action to smother out the flames, ending the effect."
                        ]
                      },
                      {
                        "name": "Cold",
                        "entries": [
                          "The ground beneath you freezes solid and becomes icy terrain. As part of the same action the turn you use your Terraforming Presence, and as an action on all subsequent turns thereafter, you can impose a Constitution saving throw against your Draconian Save DC on each creature suffering the effects of your difficult terrain. On a failed save, the creature takes 2d6 cold damage and is incapacitated until the end of your next turn as frost coils around their body, incasing them in ice. On a success, the creature takes no damage and is not incapacitated. "
                        ]
                      },
                      {
                        "name": "Lightning",
                        "entries": [
                          "A heavy lightning storm brews around you. As a bonus action on each of your turns, you can launch a bolt of lightning toward each creature suffering the effects of your difficult terrain. Each creature makes a Dexterity saving throw against your Draconian Save DC. On a failed save, they take 2d6 lightning damage, or half as much on a success. At the start of each of their turns, each creature suffering the effects of your difficult terrain must make a Constitution saving throw against your Draconian Save DC, or be blinded until the end of your next turn on a failed save."
                        ]
                      },
                      {
                        "name": "Acid",
                        "entries": [
                          "The ground beneath you becomes squishy, soft, and damp. As a bonus action, you can cause the moisture from beneath the ground to rise and lash it out on creatures suffering from your difficult terrain. They make a Dexterity saving throw against your Draconian Save DC, taking 2d6 acid damage on a failed save and their AC decreases by 2 until the end of your next turn, or no damage on a success and does not have their AC reduced."
                        ]
                      },
                      {
                        "name": "Poison",
                        "entries": [
                          "Earthy plants, brambles, and vines rise from the ground around you. As a bonus action, you can cause plants to sprout and release a noxious gas against creatures suffering from your difficult terrain. They make a Constitution saving throw against your Draconian Save DC, or take 2d6 poison damage and become poisoned on a failed save, or they take no damage and are not poisoned on a success."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Superior Terraforming",
                "entries": [
                  "Starting at 6th level, your Terraforming Presence’s range increases by 10 ft., in addition the damage dealt by your difficult terrain effects increases by 1d6."
                ]
              },
              {
                "name": "Natural Respite",
                "entries": [
                  "Also at 6th level, when you complete a long rest, you can end the effects of one disease or condition afflicting you. In addition, you regain all expended hit dice at the end of a long rest and gain an amount of temporary hit points equal to your Wisdom modifier. You can only gain these benefits if you complete your long rest outdoors."
                ]
              }
            ],
            [
              {
                "name": "Beastly Shape",
                "entries": [
                  "Starting at 11th level, you can expend a usage of your Draconian Shape to cast the Polymorph spell without expending a spell slot or requiring material components, but you can only target yourself. Wisdom is your Spellcasting Ability for this spell. In addition to being considered a beast, its creature type also counts as dragon."
                ]
              }
            ],
            [
              {
                "name": "Wild Nature's Release",
                "entries": [
                  "Starting at 16th level, your connection to nature allows you to push yourself in order to protect it. While  transformed by your Draconian Shape, you can enter a relentless rage to strike down any creature who would dare challenge you in the game “Survival of the Fittest”. ",
                  "While in your Wild Nature’s Release, you have advantage on all Strength ability checks. In addition, you have resistance to all damage except force, psychic, and necrotic. Also, damage dealt by your natural weapons or your Terraforming Presence gains a bonus equal to your Wisdom Modifier. ",
                  "Your Wild Nature’s Release ends after 1 minute, if you end it early as a bonus action, if you are incapacitated, if you die, if your Draconian Shape ends, or if you end your turn not hostile toward a creature."
                ]
              }
            ],
            [
              {
                "name": "Warrior of the Beast",
                "entries": [
                  "Starting at level 20, when you use the Beastly Shape feature you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours.",
                  "In addition, your Polymorph form does not require concentration to maintain the form and you can cast spells in your beast form as you retain the most basic ability to speak. You can also remain in your beast form indefinitely, unless you are dropped to 0 hit points or die.",
                  "Also, your Polymorph form retains the benefits of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as tremorsense, unless your new form also has that sense."
                ]
              }
            ]
          ],
          "source": "DS",
          "shortName": "Wildling"
        },
        {
          "name": "Path of the Ancients",
          "subclassFeatures": [
            [
              {
                "name": "Path of the Ancients",
                "entries": [
                  "Your ancestry stems back to ancient times, dragons of old encompass your past, and you can call forth their ancient might to aid you on your journeys. Their knowledge immense, their presence calming, and their friendship irreplaceable."
                ]
              },
              {
                "name": "Ancestral Ally",
                "entries": [
                  "Starting at 1st level, as an action, you can spend a usage of your Draconian Shape to instead summon a dragon rather than transform. Use the “Ancestral Ally” stat block for this feature.  In addition to being undead, the creature is also treated as a dragon. The ancestral ally shares its initiative with you, but moves immediately after you do. Being undead, the dragon cannot receive healing from any sources unless it can otherwise affect undead.",
                  "The ancestral ally takes the visage of its youngest form to represent the progression of its shaman, it can accurately recall information from its life and is more than willing to share that information, but not for free.",
                  "Being dead, the dragon no longer has any desire for material wealth. Instead, the dragon wishes to learn something in return. Make either a Charisma (Persuasion) ability check or an Intelligence ability check of the DM’s choosing. ",
                  "The base DC is 10, but the DM may increase the DC to a maximum of 25 depending on the information being learned. Things that may increase the difficulty would be extra personal information the dragon may not be as willing to share, or if the information is something the shaman can ordinarily gain themselves. Things that may decrease the DC is information long forgotten to history, information that cannot be learned by normal means (such as the “Research” downtime activity), or if the dragon is in a good mood. The dragon is also more than happy to boast about their past success in life, and how much wealth they had attained before dying, but may be bitter talking about how it died if it was slain, or if it succumbed to disease or poison.",
                  "If the ancestral ally is reduced to 0 hit points, it is destroyed and cannot be summoned again until after you finish a short or long rest.",
                  "When you gain a level in this class, your ancestral ally gains an additional hit die and when you increase an ability score, your ancestral ally receives the same increase to the same ability score. The same applies if an ability score is decreased."
                ]
              },
              {
                "name": "Bonus Proficiencies",
                "entries": [
                  "Also at 1st level, you gain proficiency in your choice of either Animal Handling, Arcana, or History."
                ]
              }
            ],
            [
              {
                "name": "Ancient Kinship",
                "entries": [
                  "Starting at 6th level, your bond between you and your Ancestral Ally deepens as you get used to each other’s presence and your ideals become one. ",
                  "Your Ancestral Ally becomes immune to being charmed. In addition, you have advantage on saving throws against being charmed. ",
                  "In addition, you form a telepathic bond between you and your ancestral ally, granting you both telepathy to an unlimited range, but only to yourselves and only if you’re both on the same plane of existence. In addition, you know where each other is while you’re on the same plane of existence, but either of you can suppress that knowledge at any given time."
                ]
              },
              {
                "name": "Empowered Ancestor",
                "entries": [
                  "Also at 6th level, your ancestral ally becomes a large creature and its Strength, Constitution, and Charisma scores increase by 2 and it can now attack twice instead of once, but can only bite once.",
                  "In addition, your ancestral ally loses its “Limited Flight” feature and instead has a flying speed of 60 ft. It can still hover 1 foot off the ground as normal. Its breath weapon also increases in damage by 4d6."
                ]
              }
            ],
            [
              {
                "name": "Ancestral Strike",
                "entries": [
                  "Starting at 11th level, whenever you are hit by a weapon attack your ancestral ally can retaliate and a powerful attack. By spending your reaction, you can command your ancestral ally to attack the attacking creature if it is within 60 ft of it. If the ancestral ally is within 5ft, it uses one of its natural weapons, if not it uses a special ranged attack that uses its Charisma modifier for the attack roll. On a hit with this special attack, the ancestral ally deals 2d10 plus its Charisma modifier damage. The damage type is the same as its breath weapon. ",
                  "The special attack resembles a mote of dragonfire being shot at high speeds toward its target.",
                  "You can only use this feature a number of times up to your proficiency bonus, regaining all spent uses after a short or long rest."
                ]
              }
            ],
            [
              {
                "name": "Ancestral Recovery",
                "entries": [
                  "Beginning at 16th level, your Ancestral Ally gains a regeneration feature. At the start of each of its turns, they regain an amount of hit points equal to your Wisdom Modifier, as long as they have at least 1 hit point."
                ]
              }
            ],
            [
              {
                "name": "Ancestral Bond",
                "entries": [
                  "At 20th level, your bond between your Ancestral Ally and you becomes unrivaled. While within 30 ft of each other, you both gain a +2 bonus to AC. ",
                  "In addition, while within 30 ft of each other you both have a bonus to saving throws equal to your Wisdom Modifier. ",
                  "If you were to die while within 60 ft. of your Ancestral Ally, the Ancestral Ally can restore you to life by sacrificing its own spirit, severing your bond with the Ancestor. The Ancestral Ally can also do this so long as it has been less than 1 hour after you died.",
                  "To gain a new Ancestral Ally, it will take an 8 hour ritual of concentration (as if you were concentrating on a spell) to find a new Ancestor to call upon. After which, you instantly develop a bond with that Ancestor, as it gains the memories of your previous ally from your own mind.",
                  "You can only do so a number of times equal to your Wisdom Modifier, as that is how many Ancestors you can call upon in your lifetime. Attempting to find more will result in your soul getting lost in the Astral Plane, leaving your body behind incapacitated. "
                ]
              },
              {
                "name": "Grand Ancestor",
                "entries": [
                  "Also at 20th level, as you’ve reached your peak potential, so has your Ancestral Ally. Your Ancestral Ally becomes gargantuan in size, but can reduce its size at will. Its Strength, Constitution, and Charisma ability scores increase by 4 and it can make up to four attacks, but only once with its bite. Its breath weapon also increases in damage by 6d6."
                ]
              }
            ]
          ],
          "source": "DS",
          "shortName": "Ancients"
        },
        {
          "name": "Path of the Warrior",
          "subclassFeatures": [
            [
              {
                "name": "Path of the Warrior",
                "entries": [
                  "A genius on the battlefield, mastery with all kinds of weaponry. You are vastly more trained in martial combat than any other Shaman. You’ve likely trained with other powerful warriors and taken inspiration from the greatest minds in battle."
                ]
              },
              {
                "name": "Bonus Profiiciencies",
                "entries": [
                  "Starting at 1st level, You have proficiency in heavy armor and martial weapons."
                ]
              },
              {
                "name": "Martial Training",
                "entries": [
                  "Also at 1st level, you can use martial weapons as draconian weapons, so long as they lack the Special property. In addition, when you engage in two-weapon fighting, you can use any martial weapon as a light weapon, so long as it lacks the heavy and two-handed properties."
                ]
              }
            ],
            [
              {
                "name": "Draconian Enchantment",
                "entries": [
                  "At 6th level, you’re able to harness your draconic powers into your dragon weapons. Your dragon weapons adopt a draconic appearance, becoming scaly and rough to the touch.",
                  "You have a list of enchantments that you can imbue into your weapons as shown below. You can spend a 1 hour ritual to imbue a single weapon with as many enchantments equal to one fourth your dragon shaman level (rounded up). Some enchantments are only available at later levels as described below. If you attempt to enchant another weapon, your previously enchanted weapon loses all of its enchantments.",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "type": "entries",
                        "name": "Enchantment of Returning",
                        "entries": [
                          "Your weapon gains the thrown property if it did not already have one. If it did not have the property, its thrown range becomes 20ft/40ft. After you throw the weapon, hit or miss the weapon flies back into your hand."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Enhanced Weapon",
                        "entries": [
                          "Your weapon becomes magical for the purposes of overcoming magical resistances. In addition, they gain a +1 bonus to attack and damage rolls. At 10th level, this bonus becomes +2 and at 17th level it becomes +3."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Elemental Overflow (Requires level 10)",
                        "entries": [
                          "Once per round, you can gain an additional amount of damage using this weapon equal to a number of d6s times your Wisdom modifier. Doing so drains a lot of stamina. After the damage calculation, you lose an amount of hit points equal to half of the damage dealt by this Enchantment."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Flying Weapon (Requires level 10)",
                        "entries": [
                          "Your weapon can hover off the ground, and you can mentally control the weapon. It gains a flying speed of 50 feet, but can only move as you mentally command it, no action required. The weapon falls to the ground if it moves more than 100 ft away from you."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Arcane Weapon",
                        "entries": [
                          "Your weapon becomes an arcane focus for the purposes of casting somatic component spells. In addition, if it was not already magical they count as magical for the purposes of overcoming non-magical resistances."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Life Draining Poison",
                        "entries": [
                          "When you attack a creature with this weapon and roll a 20 on the attack roll, that target takes an extra amount of necrotic damage equal to your Wisdom Modifier if it isn't a construct or an undead. You also gain the same amount of temporary hit points."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Weapon of the Medusa Dragon (Prerequisite 16th level)",
                        "entries": [
                          "When you attack a creature with this weapon and roll a 20 on the attack roll, the creature must make a Constitution saving throw against your Draconian Save DC in addition to suffering the attack's normal effects. On a failed save, the creature is restrained and must make another Constitution saving throw at the end of each of its turns. If it successfully saves against this effect three times, the effect ends. If it fails its saves three times, it is turned to stone and subjected to the petrified condition for 1 hour.",
                          "A creature is immune to this effect if it is immune to damage of the weapon's type, does not have a body made of flesh, or has legendary actions."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Weapon of the Vengeful Dragon (Level 10)",
                        "entries": [
                          "Your weapon becomes infused with a chaotic spirit. Each time you are dealt damage you gain a Vengeance Stack point. You can have a number of these points equal to your Dragon Shaman level. You can expend any number of stack points to deal an extra 2 points of damage to any weapon attack made with a dragon weapon. ",
                          "When you spend stacks using this feature, you make a Wisdom Save against your Draconian Save DC plus the amount of stack points spent. On a failed save, you become enraged as if you were under the effects of the Enemies Abound spell.",
                          "At the end of each of your turns while you have stack points, you make a Wisdom saving throw against your Draconian Save DC, with a bonus to you the DC equal to your number of acquired stack points. On a failed save, you are under the effects of the enemies abound spell, to which you make another Wisdom save at the end of each of your turns, ending the effect on a success."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Blade of the Elementals",
                        "entries": [
                          "You change the slashing, piercing, and bludgeoning damage type on the weapon to the damage associated by the damage resistance gained by your Draconic Origins. In addition, you can use your Wisdom modifier in place of strength or dexterity for your damage rolls using this weapon."
                        ]
                      },
                      {
                        "type": "entries",
                        "name": "Enchantment of Sentience",
                        "entries": [
                          "You call forth an ancient spirit to inhabit the weapon. Your weapon becomes sentient and has an Intelligence, Wisdom, and Charisma scores equal to your own. It can communicate to you, or anyone wielding the weapon telepathically. Its alignment and intentions are determined in secret by the DM. If this enchantment is lost, the next time it is imbued into a weapon it uses the same spirit as before, unless the spirit was otherwise destroyed.",
                          "The spirit tears into the minds of the creature it impacts, allowing you to gain insights to the creature’s strengths and weaknesses. Whenever you hit a creature using this sentient weapon, you learn one of the following traits: if it has any damage resistances or immunities, if it has any damage vulnerabilities, if it’s immune to any conditions, or how many hit points it has. If the creature is immune to being charmed or if it is under an effect that blocks divination magic, this has no effect. Once you learn a trait, you cannot do so again for 1d3 rounds."
                        ]
                      }
                    ]
                  }
                ]
              }
            ],
            [
              {
                "name": "Conjure Draconic Weapons",
                "entries": [
                  "At 11th level, you’ve learned how to summon forth a weapon when you are unarmed. As an action, you can call forth power from within to create a temporary solid weapon for 10 minutes. The weapon can be any simple or martial weapon that lacks the special property and is considered magical for the purposes of overcoming magical resistances. When you conjure this weapon, you can choose to end any enchantments on a previous weapon you have enchanted and grant those same enchantments to the weapon you conjured. If you did not have a previously enchanted weapon, you can give the conjured weapon any 1 enchantment.",
                  "When the duration ends, your conjured weapon is destroyed. You have a number of uses of this feature equal to your Wisdom modifier, regaining all expended uses after a short or long rest."
                ]
              }
            ],
            [
              {
                "name": "Dragon's Fighting Spirit",
                "entries": [
                  "Starting at 16th level, you’ve become exceptionally relentless on the battlefield. As a bonus action on your turn, you can gain advantage on your first attack roll provided you did not have disadvantage. When you do so, you gain a number of temporary hit points equal to your Dragon Shaman level. ",
                  "You have a number of uses of this feature equal to your proficiency bonus, regaining all expended uses after a long rest."
                ]
              }
            ],
            [
              {
                "name": "Conjure Greater Draconic Weapon",
                "entries": [
                  "At 20th level, when you use your Conjure Draconic Weapon feature it no longer has a duration, and can remain conjured for an indefinite amount of time. This conjured weapon can be enchanted as any ordinary weapon could be, and regardless of the enchantment you choose it has a magic bonus of +1. (The Enhanced Weapon Enchantment replaces this bonus.)",
                  "In addition, this weapon can have any one of the following special properties, you can choose to replace this property during a long rest:",
                  {
                    "type": "options",
                    "entries": [
                      {
                        "name": "Magical Greed",
                        "entries": [
                          "When you would kill a creature using this weapon, you can magically steal one random treasure off the creature provided it has any. If the creature had nothing of value, you instead magically receive a gemstone worth 100 gp by severing its soul from the afterlife and transforming it into a valuable treasure. (If said creature were to be resurrected, the gemstone shatters and the soul is retrieved by the source resurrecting them.)"
                        ]
                      },
                      {
                        "name": "Magical Swiftness",
                        "entries": [
                          "The blade becomes exceptionally light to the touch, allowing you to swing it at breakneck speeds. When you engage in two-weapon fighting using this weapon, you can make an additional attack using this weapon."
                        ]
                      },
                      {
                        "name": "Impaling Critical",
                        "entries": [
                          "This weapon is exceptionally powerful, imbued with the very might of a Dragon’s powerful force. When you roll damage, treat any 1 on the damage dice as a 2, in addition when you roll a 20 on the d20, you add an additional damage die."
                        ]
                      },
                      {
                        "name": "Ethereal Bane",
                        "entries": [
                          "Provided you can see the creature, you can attack a creature on the ethereal plane using this weapon. Once, you can cast the See Invisibility spell using this weapon as the arcane focus for it. You regain the ability to cast this spell again after a long rest."
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          ],
          "source": "DS",
          "shortName": "Warrior"
        }
      ],
      "fluff": [
        {
          "entries": [
            ""
          ],
          "name": "The Dragon Shaman",
          "type": "section"
        }
      ]
    }
  ]
}