{
  "_meta": {
    "sources": [
      {
        "json": "BMWizardSchool",
        "abbreviation": "Wiz:BM",
        "full": "School of Blood Magic",
        "authors": [
          "Erikku Blade"
        ],
        "version": "1.0",
        "url": "",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1593332840,
    "dateLastModified": 1593332840
  },
  "subclass": [
    {
      "name": "School of Blood Magic",
      "subclassFeatures": [
        "School of Blood Magic|Wizard||School of Blood Magic|BMWizardSchool|2",
        "Blood Magic|Wizard||School of Blood Magic|BMWizardSchool|2",
        "Blood Manipulation|Wizard||School of Blood Magic|BMWizardSchool|2",
        "Dark Devotion|Wizard||School of Blood Magic|BMWizardSchool|6",
        "Sigil of the Blood Arcane|Wizard||School of Blood Magic|BMWizardSchool|10",
        "Permanent Blood Focus|Wizard||School of Blood Magic|BMWizardSchool|10",
        "Iron Will|Wizard||School of Blood Magic|BMWizardSchool|14"
      ],
      "source": "BMWizardSchool",
      "shortName": "School of Blood Magic",
      "className": "Wizard",
      "classSource": "PHB"
    }
  ],
  "subclassFeature": [
    {
      "name": "School of Blood Magic",
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 2,
      "entries": [
        "Shrouded by curiosity and insidious methods, you have sacrificed a portion of your mortality to gain greater arcane power. You’ll do anything to get an edge over your opponents, even at the cost of your own strength."
      ]
    },
    {
      "type": "entries",
      "name": "Blood Magic",
      "entries": [
        "Starting at 2nd level, you have a pool of magic that you can call upon at the expense of your vitality. These are represented by a number of d4s equal to your Wizard level. When you spend one of these dice, you roll it and take damage equal to what you rolled. These blood magic dice increase in size as you gain levels in this class, becoming a d6 at 7th level, a d8 at 13th level, and a d10 at 18th level. Your Blood Magic pool replenishes after a long rest.",
        "Alternatively, you can spend a hit die and roll it as if you were restoring hit points on a short rest, only instead you take damage equal to the roll. Afterwards, you replenish 2 spent Blood Magic dice."
      ],
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 2,
      "header": 1
    },
    {
      "type": "entries",
      "name": "Blood Manipulation",
      "entries": [
        "Starting at 2nd level, you have the ability to empower you and your spells with your blood magic. Using your Blood Magic, you can do one of the following :",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Blood Boost",
              "entries": [
                "When you make an ability check, attack roll, or saving throw, you can spend a blood magic die and add what you rolled to the result."
              ]
            },
            {
              "type": "entries",
              "name": "Blood Empowerment",
              "entries": [
                "When you cast a wizard spell of 1st level or higher, you can spend any number of blood magic dice up to your Intelligence Modifier (minimum of 1.) and add the total rolled to any damage or healing the spell provides. Alternatively, you can increase the save DC of the spell by 1 for every 2 blood magic dice spent."
              ]
            },
            {
              "type": "entries",
              "name": "Blood Focus",
              "entries": [
                "When you roll initiative, or as a bonus action every subsequent turn thereafter, you can spend a blood magic die and create an arcane focus for your wizard spells. This arcane focus replaces any costly materials for a spell up to 100 gp. If the spell consumes the material, your focus is also consumed. This arcane focus lasts for 1 hour, until consumed, or until dispelled as a bonus action. Right before the duration ends, you can spend an additional blood magic die to keep the arcane focus manifested for an additional hour."
              ]
            }
          ]
        }
      ],
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 2,
      "header": 1
    },
    {
      "name": "Dark Devotion",
      "entries": [
        "Starting at 6th level, your devotion to the dark arts of blood magic gives you a will stronger than most. You have advantage on saving throws against being charmed or frightened.",
        "In addition, while toying with your mortality you’ve strengthened your body to better take your lust for destruction. You gain 6 hit points, and 1 additional hit point each time you gain a level in this class."
      ],
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 6,
      "header": 2
    },
    {
      "name": "Sigil of the Blood Arcane",
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 10,
      "header": 2,
      "entries": [
        "Starting at 10th level, you’ve discovered an arcane sigil that allows you to prepare more spells at a given time. Choose a number of wizard spells in your spellbook equal to your Constitution modifier. (minimum of 1.) You always have these spells prepared and they do not count against your total number of prepared spells. You can also cast them without expending a spell slot by spending blood magic dice equal to the spell’s level. Once you cast each of these spells in this way, you cannot do so again until you finish a long rest.",
        "Additionally, when you use your Arcane Recovery feature, you can spend any number of blood magic dice up to your Constitution modifier (minimum of 1.) to increase the total level of spells you can recover for each blood magic die spent. (For example, at level 10 if you spend 2 blood magic dice you can recover 7 levels worth of spell slots.) You otherwise follow the rules of the feature as normal."
      ]
    },
    {
      "name": "Permanent Blood Focus",
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 10,
      "header": 2,
      "entries": [
        "Also at 10th level, when you manifest a Blood Focus using your Blood Manipulation, you can spend an additional 4 blood magic dice to keep the Blood Focus manifested until it is consumed by a spell or dispelled as a bonus action. When you do so, the gold cost of the material increases to 1000 gp.",
        "If the spell consumes the material component, but it is worth less than 1000 gp, you subtract the difference and your Blood Focus is not consumed. The result becomes your new gold cost. When the gold cost reaches under 100 gp, your blood focus is consumed."
      ]
    },
    {
      "name": "Iron Will",
      "source": "BMWizardSchool",
      "page": 112,
      "className": "Wizard",
      "classSource": "PHB",
      "subclassShortName": "School of Blood Magic",
      "subclassSource": "BMWizardSchool",
      "level": 14,
      "header": 2,
      "entries": [
        "Starting at 14th level, your dedication to blood magic has strengthened both your body and mind. You add your Constitution modifier to your Intelligence and Wisdom saving throws. You also become proficient in Constitution saving throws. If you already have proficiency in this saving throw, choose one between Strength or Dexterity.",
        "In addition, once when you would take damage from one of your Blood Magic features, you can choose to not take damage instead. When you do so, you gain vulnerability to the next damage roll, ignoring any resistances or immunities you would otherwise have. You have a number of uses of this feature equal to your Constitution Modifier, regaining expended uses after a long rest."
      ]
    }
  ]
}