{
  "_meta": {
    "sources": [
      {
        "json": "HemomancerFighter",
        "abbreviation": "HEM",
        "full": "Hemomancer",
        "authors": [
          "Erikku Blade"
        ],
        "version": "1.0",
        "url": "",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1593332840,
    "dateLastModified": 1593332840
  },
  "subclass": [
    {
      "name": "Hemomancer",
      "subclassFeatures": [
        "Bonus Proficiencies|Fighter||Hemomancer|HemomancerFighter|3",
        "Hemomancy|Fighter||Hemomancer|HemomancerFighter|3",
        "Blood Bath|Fighter||Hemomancer|HemomancerFighter|7",
        "Blood Reserves|Fighter||Hemomancer|HemomancerFighter|10",
        "Hemomatic Bulwark|Fighter||Hemomancer|HemomancerFighter|15",
        "Hemomatic Mastery|Fighter||Hemomancer|HemomancerFighter|18"
      ],
      "source": "HemomancerFighter",
      "shortName": "Hemomancer",
      "className": "Fighter",
      "classSource": "PHB"
    }
  ],
  "subclassFeature": [
    {
      "name": "Bonus Proficiencies",
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 3,
      "entries": [
        "When you choose this archetype at 3rd level, you gain proficiency in one of the following skills of your choice: Arcana, Insight, Medicine, or Religion."
      ]
    },
    {
      "type": "entries",
      "name": "Hemomancy",
      "entries": [
        "{@i 3rd-level Hemomancer feature}",
        "Studying occult-based magic, you’ve learned the very nature of blood magic and can use it yourself to a limited degree. Your blood magic will be represented by hemomancy dice. These dice are d4s and you have a number of hemomancy dice equal to twice your proficiency bonus. ",
        "You use these dice to fuel your blood magic abilities, and you regain all of your hemomancy dice after a long rest. You cannot gain more hemomancy dice than you can have at your current level in this way. If a hemomancy feature requires a creature to make a saving throw, the DC equals 8 + your proficiency bonus + your Constitution modifier.",
        "When you use a Hemomancy die, regardless if it is spent or not, you roll the die and take damage equal to what you roll. Your hemomancy dice grows stronger with you as you gain levels in this class, becoming a d6 at 7th level, a d8 at 10th level, a d10 at 15th level, and a d12 at 18th level.",
        "You can use your hemomancy dice in the following ways:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Blood-Boosted Accuracy",
              "entries": [
                "Whenever you would miss with a weapon attack, you can use a hemomancy die and add a bonus to the roll equal to what you rolled, potentially turning the attack into a hit. If it hits, you deal a number of necrotic damage equal to what you rolled to that creature. You spend the hemomancy die only if the attack hits."
              ]
            },
            {
              "type": "entries",
              "name": "Blood Bursting Strike",
              "entries": [
                "Whenever you deal damage with a weapon, you can expend a hemomancy die and roll it, adding a number of necrotic damage equal to the number rolled and then that creature makes a Constitution saving throw. On a failed save, the creature has disadvantage on attack rolls until the end of your next turn."
              ]
            }
          ]
        }
      ],
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 3,
      "header": 1
    },
    {
      "type": "entries",
      "name": "Blood Bath",
      "entries": [
        "{@i 7th-level Hemomancer feature}",
        "You can push your body to its absolute limit to unleash a dark power from within using a combination of the power of your will and your rage. You can spend a hemomancy die to enter a blood bath. As a bonus action, you magically gain the following benefits, which last for 1 minute:",
        {
          "type": "list",
          "items": [
            "Whenever you deal damage using a weapon, you can deal an additional amount of damage equal to your proficiency bonus. The damage dealt is of the weapon’s damage type.",
            "You can forgo one of your extra attacks to gain advantage on all of your weapon attacks for the rest of this turn.",
            "Whenever you take damage, except from your hemomancy dice, once per round you can reduce that damage by half using your reaction.",
            "As a bonus action, and part of the bonus action used to enter your blood bath, you can make one weapon attack using a blood weapon."
          ]
        },
        "During your Blood Bath, each time you hit with a weapon attack you lose 1 hit point. Your blood bath ends early if you are reduced to 0 hit points, incapacitated, or die. You can use your blood bath once, regaining the ability to use it again when you complete a short or long rest."
      ],
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 7,
      "header": 1
    },
    {
      "name": "Blood Reserves",
      "entries": [
        "{@i 10th-level Hemomancer feature}",
        "Whenever you use your Second Wind feature while your Blood Bath is active, you can add an additional amount of healing equal to your hemomancy die as you draw upon even greater reserves of power from your blood magic. This expends a Hemomancy Die but does not deal damage to yourself for using it.",
        "In addition, as a bonus action you can deal damage to yourself equal to your hemomancy die and regain a spent hemomancy die. You can do so once, regaining the ability to do so when you finish a short or long rest."
      ],
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 10,
      "header": 2
    },
    {
      "name": "Hemomatic Bulwark",
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 15,
      "header": 2,
      "entries": [
        "{@i 15th-level Hemomancer feature}",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Blood Barrier",
              "entries": [
                "As a reaction whenever you would be hit by an attack, you can spend a hemomancy die and add the number rolled to your AC until the start of your next turn, potentially turning the attack into a miss."
              ]
            },
            {
              "type": "entries",
              "name": "Blood-Boosted Ability",
              "entries": [
                "Whenever you make an ability check or saving throw that uses Strength, Dexterity, or Constitution, you may use a hemomancy die and add the number rolled to the d20, provided you are not incapacitated. You spend the hemomancy die only if the check or save was successful."
              ]
            }
          ]
        },
        "Once you use this feature on another creature you cannot do so again until you finish a long rest, or you spend a hit die to regain a use of this feature. You can only spend a hit die in this way once and cannot do so again until you finish a long rest."
      ]
    },
    {
      "name": "Hemomatic Mastery",
      "source": "HemomancerFighter",
      "page": "",
      "className": "Fighter",
      "classSource": "PHB",
      "subclassShortName": "Hemomancer",
      "subclassSource": "HemomancerFighter",
      "level": 18,
      "header": 2,
      "entries": [
        "{@i 18th-level Hemomancer feature}",
        "You regain all of your spent Hemomancy Dice whenever you finish a short or long rest. In addition, the following options are added to your Hemomancy feature:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Blood Curse",
              "entries": [
                "As an action, you can spend a hemomancy die to magically curse a creature within 60 feet of you that you can see. That creature becomes overwhelmed and cursed by your blood magic for 1 minute. That creature becomes vulnerable to necrotic damage and gains no benefits from having resistance to necrotic damage. A creature makes a Constitution saving throw at the end of each of its turns, ending the effect on itself on a success. A creature is immune to this effect if it is a plant, undead, or construct, or if it is immune to necrotic damage. You can only have one creature affected by your blood curse at a time. A remove curse can also remove these effects."
              ]
            },
            {
              "type": "entries",
              "name": "Bloody End",
              "entries": [
                "When you reduce a creature to 0 hit points, as a reaction you can absorb part of its life force into your own body to fuel your vitality. You can spend a hemomancy die and roll it, gaining a number of temporary hit points equal to what you rolled plus your Constitution modifier. You do not take damage when you spend a hemomancy die in this way."
              ]
            }
          ]
        }
      ]
    }
  ]
}