{
  "_meta": {
    "sources": [
      {
        "json": "IcebornSorc",
        "abbreviation": "IbS",
        "full": "Iceborn Sorcerous Origin",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "version": "1.0",
        "color": "97b1f3",
        "url": "https://docs.google.com/document/d/1XiHbxUeEWoL3dpbdsyUlSQkOzIgNunVwdcMyBh4WBtk/edit?usp=sharing",
        "targetSchema": "1.2"
      }
    ],
    "dateAdded": 1618291453,
    "dateLastModified": 1618291453
  },
  "subclass": [
    {
      "name": "Iceborn",
      "source": "IcebornSorc",
      "page": 1,
      "shortName": "Iceborn",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSpells": [
        "armor of agathys",
        {
          "name": "frost fingers",
          "source": "IDRotF"
        },
        "Gentle Repose",
        "Feign Death",
        "Hunger of Hadar",
        "Otiluke's Resilient Sphere",
        "Antilife Shell"
      ],
      "subclassFeatures": [
        "Iceborn|Sorcerer|PHB|Iceborn|IcebornSorc|1",
        "Iceborn Guide|Sorcerer|PHB|Iceborn|IcebornSorc|6",
        "Frigid Winds|Sorcerer|PHB|Iceborn|IcebornSorc|6",
        "Frostbiting Mark|Sorcerer|PHB|Iceborn|IcebornSorc|14",
        "Frozen Soul|Sorcerer|PHB|Iceborn|IcebornSorc|18"
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "Iceborn",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 1,
      "level": 1,
      "entries": [
        "{@i 1st-level Iceborn feature}",
        "Born from wastes made of ice and snow, your ancestors come from the faraway tundras. From the deep Abyss to the 5th layer of the Nine Hells, Stygia, your heritage can range from primordial beings of ice to even the most fiendish creatures. Your powers can also be gifts from these same otherworldly beings. Gods and Goddesses of Winter, such as Auril, are also prime candidates for the origin of these powers. Consult the Iceborn Origins table, or work with your DM on where your ice magic stems from.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Frozen Ancestry|Sorcerer|PHB|Iceborn|IcebornSorc|1"
        },
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Cryomancy Magic|Sorcerer|PHB|Iceborn|IcebornSorc|1"
        }
      ]
    },
    {
      "name": "Cryomancy Magic",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 1,
      "level": 1,
      "header": 1,
      "entries": [
        "Your magic comes from the frozen wastes, giving you the ability to always keep a cool head and give your enemies the cold shoulder. You learn additional spells when you reach certain levels in this class, as shown on the Cryomancy Spells table. Each of these spells counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know.",
        "Whenever you gain a sorcerer level, you can replace one spell you gained from this feature with another spell of the same level. The new spell must be a {@filter conjuration or transmutation spell from the sorcerer, warlock, or wizard spell list|spells|class=sorcerer;warlock;wizard|school=C,T|level=1;2;3;4;5} and if it deals damage, you must choose a spell that deals either cold, bludgeoning, piercing, slashing, or necrotic damage.",
        {
          "type": "table",
          "caption": "Cryomancy Spells",
          "colLabels": [
            "Sorcerer Level",
            "Spell"
          ],
          "colStyles": [
            "col-3 text-center",
            "col-9 text- "
          ],
          "rows": [
            [
              "1st",
              "{@spell Armor of Agathys|PHB}, {@spell Frost Fingers|IDRotF}"
            ],
            [
              "3rd",
              "{@spell Gentle Repose|PHB}, {@spell Snilloc's Snowball Swarm|XGE}"
            ],
            [
              "5th",
              "{@spell Feign Death|PHB}, {@spell Hunger of Hadar|PHB}"
            ],
            [
              "7th",
              "{@spell Ice Storm|PHB}, {@spell Otiluke's Resilient Sphere|PHB}"
            ],
            [
              "9th",
              "{@spell Antilife Shell|PHB}, {@spell Cone of Cold|PHB}"
            ]
          ]
        }
      ]
    },
    {
      "name": "Frozen Ancestry",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 1,
      "level": 1,
      "header": 1,
      "entries": [
        "{@i 1st-level Iceborn Summoner feature}",
        "Given your origins, you become accustomed to the creatures of your ancestry. Choose one of the following languages: Abyssal, Infernal, or Primordial. You learn to speak, read, and write the language you chose.",
        "In addition, you have an innate ice magic that flows within you. You learn the {@spell Frostbite|XGE} cantrip and it does not count against your total number of known cantrips. If you already have this cantrip, choose one from: {@spell gust|XGE}, {@spell mending}, {@spell prestidigitation}, {@spell ray of frost}, or {@spell shape water|XGE}. You learn that cantrip instead."
      ]
    },
    {
      "name": "Iceborn Guide",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 1,
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Iceborn Summoner feature}",
        "Your heritage gives you an innate ability to push through the harsh environments of frozen wastes which allows you to make traversing these areas easier for you and your allies. You have resistance to cold damage and ignore the effects of extreme cold.",
        "In addition, you ignore difficult terrain created by ice or snow and are not impeded by harsh environments in tundras or similar wastes. By spending 10 minutes you can magically provide this benefit to a number of allies of your choice equal to twice your proficiency bonus. This benefit lasts until the next time you finish a long rest. Creatures who gain this benefit do not gain your resistance to cold damage, but they do have advantage on saving throws made to resist the effects of extreme cold."
      ]
    },
    {
      "name": "Frigid Winds",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 1,
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Iceborn Summoner feature}",
        "Whenever you start casting a spell of 1st level or higher that deals cold damage, icy winds blow out from you. This icy wind causes creatures of your choice that you can see within 20 feet of you to take cold damage equal to your proficiency bonus."
      ]
    },
    {
      "name": "Frostbiting Mark",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 2,
      "level": 14,
      "header": 2,
      "entries": [
        "{@i 14th-level Iceborn Summoner feature}",
        "When a creature fails a saving throw against one of your 1st level or higher spells that deals cold damage, you can mark that creature with a chilling brand. While marked with this brand, ice and frost slowly creeps into their body, granting them vulnerability to all damage until the end of your next turn. This renders any resistance or immunities they had useless until the effect fades. Once they next take damage after being marked, the frozen brand melts away, ending the effect. A creature is immune to the effects of this mark if they have resistance or immunity to cold damage.",
        "You can only mark one creature at a time using this feature, and you can only mark creatures with this special brand a number of times equal to your proficiency bonus, regaining all spent uses after a long rest."
      ]
    },
    {
      "name": "Extraplanar Master",
      "source": "IcebornSorc",
      "className": "Sorcerer",
      "classSource": "PHB",
      "subclassSource": "IcebornSorc",
      "subclassShortName": "Iceborn",
      "page": 2,
      "level": 18,
      "header": 2,
      "entries": [
        "{@i 18th-level Iceborn Summoner feature}",
        "Your mastery over cryomancy permanently changes your very being as you become one with your ancestry. You have immunity to cold damage and learn the Investiture of Ice spell. If you already knew the Investiture of Ice spell, you can choose another spell from the sorcerer spell list to learn instead. This spell does not count against your total number of sorcerer spells and you can cast it once at its lowest level without expending a spell slot.",
        "Casting Investiture of Ice in this way does not require concentration and lasts up to an hour rather than its normal duration of 10 minutes.",
        "Whenever you cast Investiture of Ice using a spell slot, its range becomes touch instead of self and you can target other creatures with the spell. Casting the spell at higher levels allows you to target one additional creature per spell slot level above 6th."
      ]
    }
  ]
}