{
  "_meta": {
    "sources": [
      {
        "json": "WayofTempest",
        "abbreviation": "MT:WoT",
        "full": "Way of the Tempest",
        "authors": [
          "Erikku Blade"
        ],
        "convertedBy": [
          "Erikku Blade"
        ],
        "version": "3.2",
        "url": "https://docs.google.com/document/d/1oHAnv77kX3EZ50_uCeLFhmi07LxvDOgzMiSjJU7mFYc/edit?usp=sharing",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1588106289,
    "dateLastModified": 1588106289
  },
  "subclass": [
    {
      "name": "Way of the Tempest",
      "subclassFeatures": [
        "Way of the Tempest|Monk|PHB|Tempest|WayofTempest|3",
        "Channel the Storm|Monk|PHB|Tempest|WayofTempest|3",
        "Step of the Tempest|Monk|PHB|Tempest|WayofTempest|3",
        "Stormlord’s Protection|Monk|PHB|Tempest|WayofTempest|6",
        "Storm Disciple|Monk|PHB|Tempest|WayofTempest|6",
        "Storm Grandmaster|Monk|PHB|Tempest|WayofTempest|11",
        "Stormborn’s Tempest|Monk|PHB|Tempest|WayofTempest|11",
        "Overwhelming Storm|Monk|PHB|Tempest|WayofTempest|17"
      ],
      "source": "WayofTempest",
      "shortName": "Tempest",
      "className": "Monk",
      "classSource": "PHB"
    }
  ],
  "subclassFeature": [
    {
      "name": "Way of the Tempest",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "entries": [
        "Born with the might of dragons, elementals, giants, or other similar stormborn creatures, you follow a monastic tradition that teaches you to harness the power of a raging storm that brews within you. When you focus your ki, you can align yourself with the storm inside you and bend them to your will, using them as an extension of your body. ",
        "Many monks of this tradition tattoo their bodies with representations of their ki powers, commonly imagined as coiling dragons, but also as elder tempests and arcane sigils."
      ]
    },
    {
      "type": "entries",
      "name": "Channel The Storm",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Tempest Feature}",
        "You can call upon the might of a raging tempest that lies deep within your soul. Up to twice per round on your turn, you can add bonus lightning or thunder damage (you choose when you use this feature) to your monk weapons or unarmed strikes when you hit with them. This bonus equals your martial arts die."
      ]
    },
    {
      "type": "entries",
      "name": "Step of the Tempest",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 3,
      "header": 1,
      "entries": [
        "{@i 3rd-level Tempest Feature}",
        "When you use your Step of the Wind feature, you can spend an additional ki point to increase your movement speed by an additional 10 feet until the end of the turn."
      ]
    },
    {
      "type": "entries",
      "name": "Stormlord’s Protection",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Tempest Feature}",
        "You gain resistance to lightning and thunder damage."
      ]
    },
    {
      "type": "entries",
      "name": "Storm Disciple",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 6,
      "header": 2,
      "entries": [
        "{@i 6th-level Tempest Feature}",
        "You can channel your inner storm into magical spells. You learn the {@spell shocking grasp} and {@spell thunderclap|XGE} cantrips which uses Wisdom as your spellcasting ability.",
        "In addition you have learned certain disciplines that allow you to cast spells using ki points. You have three disciplines of your choice as detailed below starting at level 6. You learn two additional disciplines of your choice at 11th and 17th levels. Whenever you learn a new discipline, you can also replace one discipline that you already know with a different discipline.",
        "See {@book chapter 10|PHB} of the Player's Handbook for the general rules of spellcasting. To cast one of these spells, you use its casting time and other rules, but you don't need to provide material components for it. When you cast a spell with a discipline, it is cast at the spell's lowest level unless otherwise specified. You use Wisdom for your Spellcasting Ability.",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Booming Thunder",
              "entries": [
                "You learn the {@spell booming blade|TCE} cantrip and can cast it at will."
              ]
            },
            {
              "type": "entries",
              "name": "Electro-Whip",
              "entries": [
                "You learn the {@spell lightning lure|TCE} cantrip and can cast it at will."
              ]
            },
            {
              "type": "entries",
              "name": "Fist of Four Thunders",
              "entries": [
                "You slam your fists together in front of you, causing a thunderous boom that blows away everything around you. You can spend 1 ki point to cast {@spell thunderwave}."
              ]
            },
            {
              "type": "entries",
              "name": "Relentless Shock",
              "entries": [
                "You condense your mystical energies together into a single mote of lightning of which you hurl at a single enemy. You can spend 1 ki point to cast {@spell witch bolt}."
              ]
            },
            {
              "type": "entries",
              "name": "Thunderous Boom",
              "entries": [
                "You summon forth a storm within your weapon, allowing you to impact your enemies with the might of thunder and lightning. You can spend 1 ki point to cast {@spell thunderous smite}."
              ]
            },
            {
              "type": "entries",
              "name": "Dragon's Lightning",
              "entries": [
                "You can summon the ancient might of the breath of dragons. You can spend 2 ki points to cast {@spell dragon's breath|XGE}, but can only choose lightning damage."
              ]
            },
            {
              "type": "entries",
              "name": "Tempestous Barrier",
              "entries": [
                "You create a howling wind to bat away incoming projectiles. You can spend 2 ki points to cast {@spell warding wind|XGE}."
              ]
            },
            {
              "type": "entries",
              "name": "Ire of the Storm",
              "entries": [
                "You can draw from the energies around you to conjure a small storm, of which you channel the flow of your ki through in order to strike your foes with lightning bolts. You can spend 3 ki points to cast {@spell call lightning}."
              ]
            },
            {
              "type": "entries",
              "name": "Artemis's Lightning",
              "entries": [
                "You can channel raw ki into your ranged attacks, electrifying your shots. You can spend 3 ki points to cast {@spell lightning arrow}."
              ]
            },
            {
              "type": "entries",
              "name": "Chariot of the Elder Tempest",
              "entries": [
                "You call forth a mighty source of power from within you, unleashing a mighty bolt of electricity being carried by an elder tempest. You can spend 3 ki points to cast {@spell lightning bolt}."
              ]
            },
            {
              "type": "entries",
              "name": "Thor's Leap",
              "entries": [
                "You summon forth a mighty strength from within which allows you to burst through the tethers of the material plane, allowing you to make a thunderous step and appear in another position. You can spend 3 ki points to cast {@spell thunder step|XGE}."
              ]
            },
            {
              "type": "entries",
              "name": "Ride the Lightning",
              "entries": [
                "You call upon the power of the storm to increase your speed and leave a trail of lightning behind you. You can spend 3 ki to cast the {@spell flame stride|UA2021DraconicOptions} spell, but it deals lighting damage instead."
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Storm Grandmaster",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 11,
      "header": 2,
      "entries": [
        "{@i 11th-level Tempest Feature}",
        "You can spend additional ki points to increase the level of a discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as lightning bolt does. The spell's level increases by 1 for each additional ki point you spend. For example, if you are a 11th-level monk and use Chariot of the Elder Tempest to cast lightning bolt, you can spend 4 ki points to cast it as a 4th-level spell (the discipline's base cost of 3 ki points plus 1).",
        "The maximum number of ki points (its base ki point cost plus any additional points) that you can spend on the spell is 6, unless a discipline specifies otherwise. You also gain access to learn the following disciplines:",
        {
          "type": "options",
          "entries": [
            {
              "type": "entries",
              "name": "Sphere of the Storm King",
              "entries": [
                "You conjure the power of ancient giant lords to summon forth a powerful storm condensed within a large sphere. You can spend 4 ki points to cast the storm sphere spell."
              ]
            },
            {
              "type": "entries",
              "name": "Overwhelming Surge",
              "entries": [
                "You can release outward a powerful force of electrifying power by letting loose the storm within you. You can spend 5 ki points to cast the destructive wave spell, but you replace the radiant damage with lightning instead."
              ]
            },
            {
              "type": "entries",
              "name": "Ballet of Storms",
              "entries": [
                "You perform a variety of stances that allows you to move at lightning speeds. You can spend 5 ki points to cast the steel wind strike spell, but deals your choice of thunder or lightning damage instead of force."
              ]
            },
            {
              "type": "entries",
              "name": "Fury of the Storms",
              "entries": [
                "You let loose a wild surge of electricity that jumps from one target to the next. You can spend 6 ki points to cast the chain lightning spell."
              ]
            },
            {
              "type": "entries",
              "name": "Ritual of the Storm Lord",
              "entries": [
                "You perform an ancient religious dance that unlocks hidden potential from within, allowing you to become one with the storms. You can spend 6 ki points to cast the Investiture of Wind spell, but the special action you use to create a cube of swirling wind deals your choice of thunder or lightning damage instead of bludgeoning, adopting a new appearance accordingly."
              ]
            },
            {
              "type": "entries",
              "name": "Revival Shock",
              "entries": [
                "You rub your hands together to generate a large amount of electric energy that you can use in a pinch to resurrect a dead comrade. You can spend 6 ki points to cast the revivify spell, however in order for the spell to succeed you must make a DC 16 Wisdom (Medicine) ability check. On a failed check, the spell fails and you lose the ki points used to cast the spell. You can spend an additional ki points (to a maximum of 4) to reduce the DC by 1 for every ki point spent."
              ]
            }
          ]
        }
      ]
    },
    {
      "type": "entries",
      "name": "Stormborn’s Tempest",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 11,
      "header": 2,
      "entries": [
        "{@i 11th-level Tempest Feature}",
        "As a bonus action you can spend 3 ki points to channel a powerful storm that coils around your body for 1 minute. While active, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain a flying speed equal to your walking speed and can hover.",
            "Whenever you deal an amount of lightning or thunder damage each creature that takes damage takes an additional amount of lighting or thunder damage equal to your proficiency bonus.",
            "Whenever you are hit by a melee attack from a creature within 5ft of you, they take an amount of lightning or thunder damage equal to your proficiency bonus."
          ]
        },
        "Once your Stormborn’s Tempest ends, you cannot enter it again until you finish a short or long rest."
      ]
    },
    {
      "type": "entries",
      "name": "Overwhelming Storm",
      "source": "WayofTempest",
      "page": 80,
      "className": "Monk",
      "classSource": "PHB",
      "subclassShortName": "Tempest",
      "subclassSource": "WayofTempest",
      "level": 17,
      "header": 2,
      "entries": [
        "{@i 17th-level Tempest Feature}",
        "Your lightning has become so powerful, it has become effective against those who resist it. You can spend a ki point to ignore damage resistances and immunities to lightning and thunder damage. Creatures that were immune to lightning and thunder damage instead take half damage. If you are dealing damage to multiple creatures, you spend 1 ki point per creature or for as many creatures as you can affect.",
        "When you deal lightning damage to a creature with the Lightning Absorption feature, you can spend 4 ki points to ignore the absorption effect for that damage. You spend an additional 2 ki points for every creature with the lightning absorption feature past the first one, or for as many creatures you can affect."
      ]
    }
  ]
}