{
	"_meta": {
		"sources": [
			{
				"json": "FateWeaverJan2021",
				"abbreviation": "FW",
				"full": "Fate Weaver",
				"authors": [
					"Erikku Blade"
				],
				"convertedBy": [
					"Erikku Blade"
				],
				"url": "https://docs.google.com/document/d/14vUyGeWLmqMC4nIAS02hcria6P3ZJ4B_6f6-KoI1WY4/edit?usp=sharing",
				"version": "2.2.0",
				"color": "F363FF"
			}
		],
		"dateAdded": 1617998456,
		"dateLastModified": 1617998456
	},
	"monster": [
		{
			"name": "Starlight Companion",
			"size": "S",
			"type": "celestial",
			"source": "FateWeaverJan2021",
			"alignment": [
				"L",
				"N"
			],
			"ac": [
				{
					"special": "PB + 2 times your Fate Weaver level"
				}
			],
			"hp": {
				"special": "See below"
			},
			"speed": {
				"walk": 0,
				"fly": {
					"number": 30,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 12,
			"dex": 15,
			"con": 16,
			"int": 10,
			"wis": 12,
			"cha": 15,
			"passive": 11,
			"senses": [
				"darkvision 60 ft."
			],
			"senseTags": [
				"D"
			],
			"languages": [
				"understands Celestial",
				"and the languages of its creator",
				"but can't speak"
			],
			"languageTags": [
				"CE",
				"CS"
			],
			"save": {
				"wis": "+1",
				"cha": "+2",
				"int": "+0"
			},
			"trait": [
				{
					"name": "Companion's Bond",
					"entries": [
						"The Starlight Companion cannot be {@condition charmed} by creatures other than its summoner. The Starlight Companion gets another use of its Starlight Wish per day when its summoner reaches 6th and 10th levels."
					]
				},
				{
					"name": "Companion's Tether",
					"entries": [
						"The Starlight Companion can be no further than 60 ft away from its summoner, or it begins to lose hit points. It loses 5 hit points if it starts its turn more than 60 ft away from its summoner. If it is reduced to 0 hit points in this manner, it is destroyed. While the Starlight Companion is within 30 ft of its summoner, both the summoner and the companion regains 1 hit point, so long as one of them has half of their remaining hit points or less. Whenever a spell or magical effect that lasts longer than one round is cast on its Summoner, the Starlight Companion shares the same magical effect."
					]
				}
			],
			"action": [
				{
					"name": "Bless (1/rest)",
					"entries": [
						"The Starlight Companion casts {@spell bless} as a 1st level spell. Its summoner becomes an automatic target of the spell, and the other two targets must be creatures friendly to its summoner. Once this spell is cast in this way, it cannot be cast again until its summoner completes a short or long rest even if a new Starlight Companion is summoned."
					]
				},
				{
					"name": "Starlight Slam",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one target. {@h}4 ({@damage 1d4 + 2}) radiant damage."
					]
				},
				{
					"name": "Starlight Wish (1/Day)",
					"entries": [
						"The Starlight Companion asks you or a creature friendly to you what they desire. It will do its best to accomplish this wish, whatever that may be. Choose one of the following effects to grant: that creature receives healing equal your fate weaver level plus your proficiency bonus; that creature removes one disease or poison afflicting it; that creature gains the benefit of the help action for 1 minute; that creature can teleport once up to 30 ft as a bonus action for the next minute, losing the ability to do so afterwards; that creature's speed is doubled for the next minute.",
						"Anything beyond what is mentioned above is beyond what the starlight companion can grant."
					]
				}
			],
			"damageTags": [
				"R"
			],
			"miscTags": [
				"MW"
			]
		}
	]
}